[
  {
    "title": "0 AD – After Dairy: A Split Bill Stand-Up Show",
    "presenter": "Liam Jackson and Grant Barr / Free Festival",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240ADAFTE_2A.jpg",
    "description": "An hour of wall-to-wall laughs from two of Scotland's most exciting new comedians – Liam Jackson and Grant Barr! Liam dissects his mishaps in the job market, travels and Scottish culture from a fresh perspective with verve and hilarity. ‘Very relaxed, confident, at ease on stage. Very consistent flow with good punchlines. Also... funny!’ (The Stand Comedy Club). Grant Barr is a stand-up and farmer hailing from the Kingdom of Fife. Grant's side-splitting observations and hysterical anecdotes on farming and rural Scottish life will leave you howling.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "0 Plans: A Crowd Work and Stand-up Comedy Show",
    "presenter": "Reece Kidd",
    "location": "Alchemist | St James Quarter",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240PLANSA_CLE.jpg",
    "description": "A crowd-work and improvised stand-up comedy show with zero plans. Join us for an intimate night of comedy where Northern Irish comedian Reece Kidd and friends will entertain you and make you laugh. Reece has over 30 million views online and over 30,000 followers on Instagram. Zero Plans had a sold-out run of the Edinburgh Fringe in 2023 with 50+ five-star audience reviews.; Category: Comedy",
    "start": ""
  },
  {
    "title": "0 Plans: A Crowd Work and Stand-up Comedy Show",
    "presenter": "Reece Kidd",
    "location": "Alchemist Cocktail Bar and Restaurant",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240PLANSA_CLD.jpg",
    "description": "A crowd-work and improvised stand-up comedy show with zero plans. Join us for an intimate night of comedy where Northern Irish comedian Reece Kidd and friends will entertain you and make you laugh. Reece has over 30 million views online and over 30,000 followers on Instagram. Zero Plans had a sold-out run of the Edinburgh Fringe in 2023 with 50+ five-star audience reviews.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "0 to 30 – Dan Boerman's Quarter Life Crisis",
    "presenter": "Dan Boerman",
    "location": "Scottish Comedy Festival @ Waverley Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20240TO30DA_CFF.jpg",
    "description": "Unhinged, in the best way, and genuinely original. Live from New Zealand - Dan Boerman debuts his high-energy solo hour in Edinburgh, after packed-out New Zealand Fringe shows! Dan has turned 30, and started going to therapy. He's not there to find a solution, he just wanted to tell a stranger he doesn't plan on changing. Join Dan Boerman in his chaotic solo hour, sharing tales as a long-haired lout all the way from NZ. 'Please come' (Dan).; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "001 – Laughing Matters (Work in Progress)",
    "presenter": "Ori Halevy / Free Festival",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024101LAUG_BSB.jpg",
    "description": "I left Israel to live in Berlin, because it is ironically safer. My mother would disagree as she is a Holocaust survivor and therefore kind of needy, so I moved to the one country she would never visit me in. Come and I'll tell you all about it.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "007 Voices of Bond",
    "presenter": "Night Owl Shows",
    "location": "theSpace @ Symposium Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024007VOIC_V6.jpg",
    "description": "Immerse yourself in the world of 007 and the legendary voices that have accompanied Bond. Goldfinger, Skyfall, Diamonds Are Forever and more brought to life by agents Ella McCready, Alex Beharrell and the Night Owl band. Night Owl Shows bring you more than just the music with a new take on the tribute genre that has won them standing ovations worldwide. This chronological trip through the music of 007 promises all the classics with fascinating facts delivered by our own onstage agents and agent M beaming on to a screen from his bunker in London. ; Category: Music",
    "start": "Aug 7-25 "
  },
  {
    "title": "01_Algorhythm.mp3",
    "presenter": "Algorhythm",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024VOCALMA_3S.jpg",
    "description": "Ten beatboxers, armed only with their microphones, charming personalities, and about 50p to their names, set out to transcend the greatest threat to the modern day entertainment scene – the algorithm. Prepare to see just how far the human voice can be morphed, to not only produce sensational music, but override AI itself.; Category: Music",
    "start": "Aug 19-24 "
  },
  {
    "title": "1, 2, 3. Sh*t, that's my OCD",
    "presenter": "AMUART",
    "location": "Just the Tonic at The Caves",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024123SHTT_JC.jpg",
    "description": "In a world full of ugliness, desperation and people touching you with dirty hands, OCD became a coping mechanism. This young girl tries to hide her symptoms, for example touching things three times, but it's in her DNA and to her discomfort the world starts noticing. But, relax. It's a comedy. Fine, tragi-comedy. A monologue full of 1,2,3s, changing from verse to prose and focused on the PTSD of sexual abuse, which worsened the girl's Obsessive Compulsive Disorder and developed it to a place where she didn't feel \"normal\". Based on real stories.; Category: Theatre",
    "start": "Aug 9-11 "
  },
  {
    "title": "1.295 Reframing Autistic Success (Kitten Steps)",
    "presenter": "Stags Woodward",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412999_BJP.jpg",
    "description": "After 2023’s sell-out show, Stags returns with laughs, adventures and his more innovative 1.295-step mission for success. Add to that some neurospicy experimentation and questioning what it means to be AuDHD in a neurotypical world, Stags finds he’s reframing everything. 'Few things more charming... With nothing but a microphone and a rain sound machine, Stags brings his audience into his memories... Audience doubled up in laughter' (Margaret Hall, Playbill). 'An immensely likeable and charismatic performer' (NeurodiverseReview.com). 'Highly recommended!!' 'Very very funny' (Audience reviews).\n; Category: Comedy",
    "start": "Aug 7-11, 13-18, 20-25 "
  },
  {
    "title": "#1 All-Time Best Comedy Champion: War of the Flags",
    "presenter": "Katharyn Henson / Free Festival",
    "location": "Laughing Horse @ Kick Ass Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241WORLDC_CQX.jpg",
    "description": "Who are the funniest comedians? The Americans? The English... eh... probably the Scottish, but maybe it's the Arabs? Or the Asians? Canadians? No, it's your Irish cousin... or your Indian dad? Can't forget about the Jews! The time to wonder has run out! Comics from every nation, culture and background will go head-to-head and answer the age old question: who are the funniest people? Records won't lie, there will be one champion. Join us with your country's colors, paint your face, show us your nips and let's get ready to rumble!; Category: Comedy",
    "start": "Aug 6-9, 11-25 "
  },
  {
    "title": "1 and Only Absolute Burlesque and Cabaret",
    "presenter": "Sassy School of Burlesque",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241ANDONL_P1.jpg",
    "description": "Delighting audiences with sell-out shows since 2017, we are back! Experience the fiery passion and irresistible allure of our home-grown hotties at a burlesque show like no other. Watch as we charm, tease and captivate you with our sultry moves and magnetic charisma. Get ready for a night of sizzling performances, seductive secrets and scintillating entertainment that will leave you wanting more. Join us for one of a kind extravaganza that celebrates the art of tease and the beauty of burlesque. Share our ethos: Every body is a burlesque body!; Category: Cabaret and Variety",
    "start": "Aug 6-10, 12-17, 19-25 "
  },
  {
    "title": "1 Awesome Magic Show for Families with Sam Hurst",
    "presenter": "Samuel Hurst (Beautiful Magicians Club) / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ CC Blooms",
    "image_url": "https://tickets.edfringe.com/www-data/",
    "description": "Samuel Hurst, UK Family Entertainer of the Year 2019 grew up watching Saturday morning TV and Magic. The only magician the world to be on both Mr Beast and Sidemen YouTube channels brings an early morning show of amazing magic, shocking dad jokes and pure joy you could only get sat in front of the TV with a bowl of cereal. This show should be in your top five list of things to see with your family. 'Takes silliness and makes it an art form' **** (BroadwayBaby.com).; Category: Cabaret and Variety",
    "start": "Aug 14-21, 23-25 "
  },
  {
    "title": "1 Ball Show: 1 More Encore",
    "presenter": "1BallCo",
    "location": "Just the Tonic at The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241BALLSH_ACJ.jpg",
    "description": "When Terence Hartnett found out that his testicular cancer had spread to his lung, he got out his notebook and started writing jokes. Two years later, 1 Ball Show has been performed at New York City's Carolines on Broadway, Chicago's Lincoln Lodge and at the Edinburgh Festival Fringe for sold-out crowds. Chemo sucks and so does losing a lung, but if you can't laugh, you might as well be dead already. 'Highly recommended show!' (FringeReview.co.uk); 'Insightful, emotional and laugh-out-loud funny!' (Comedy Clubhouse).; Category: Comedy",
    "start": "Aug 6-11, 13-14, 16-25 "
  },
  {
    "title": "1 Cent Comedy: Moni Zhang's (digital) Pick of Fringe",
    "presenter": "1 Cent Comedy, Moni Zhang and Friends",
    "location": "Fringe Online",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EDFRING_CBS.jpg",
    "description": "Can't afford a trip to Scotland? Too cozy in your depression nest to leave the house? Or just a savvy Fringe-goer doing your homework? Moni Zhang's got you covered. Four daily acts: a buffet of comic flavours, handpicked by Moni Zhang. Some chosen for brilliance, some for weirdness, some because Moni's a sucker for guilt trips. Catch us on YouTube.; Category: Comedy",
    "start": "Aug 30 "
  },
  {
    "title": "1 Cent Comedy presents: 1001 Space Adventures: Breadlove and Poophead – Interactive Children Show",
    "presenter": "Stoopid Comedy by Mihai Tartara / Free Festival",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241STORY2_UB.jpg",
    "description": "Join Breadlove and Poophead in a cosmic journey where your child isn't just an audience member – they're the hero of their own interstellar adventure! Will they save the galaxy? It's up to our young space explorers! Mixing puppets, sound effects, painting and many more in this interactive sci-fi adventure filled with fun, learning and imagination.; Category: Children's Shows",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "1 Cent Comedy presents: Black Widows",
    "presenter": "Moni Zhang Comedy",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024666BLAC_BKH.jpg",
    "description": "Welcome to the dark side of laughter, where our comics don't give a damn about your comfort zone. It's where the fearless female comics come to play, and by play we mean mercilessly toy with every dark corner of comedy there is. Expect an evening soaked in pitch-black humour, where insults are the highest form of flattery and the comedy is so twisted, it feels sinfully right. Edinburgh Fringe 2023 sell-out show! Daily rotating line-up of badass comediennes, hosted by Moni Zhang.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "1 Cent Comedy presents: Depression vs. Anxiety (Game Show)",
    "presenter": "Berlin Mental Health Festival and Moni Zhang Comedy",
    "location": "Scottish Comedy Festival @ Waverley Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412DEPRE_CFF.jpg",
    "description": "Think your emotional baggage is heavy? Wait 'til you see ours! Join us for a night where anxiety and depression duke it out, comedy style. It's like therapy, but cheaper and with a donation at the end. Get ready to laugh at all the wrong things for all the right reasons. Who will win? Who cares! Edinburgh Fringe 2022 sell-out show. Host by Moni Zhang with a daily rotating line-up.; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "1 Cent Comedy presents: Mental Health Matters at Edinburgh Fringe",
    "presenter": "1 Cent Comedy, Moni Zhang Comedy",
    "location": "Fringe Online",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MENTALH_CBS.jpg",
    "description": "Edinburgh Fringe 2024 is where we turn mental health discussions inside out!  Get real, get raw and definitely get ready to laugh with us. Dive into the chaos and clarity of mental health, all while exploring Edinburgh city's vibrant atmosphere. Hosted by Moni Zhang.; Category: Comedy",
    "start": "Aug 30 "
  },
  {
    "title": "1 Cent Comedy presents: Moni Zhang: Asian Daddy, Dead",
    "presenter": "Moni Zhang Comedy",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241990MON_6R.jpg",
    "description": "Warning: Dark comedy zone! Enter at your own risk! Emerging from the ashes of her father's death, Moni Zhang brings you a dark and hilarious comedy show that will leave you gasping for air. With twisted and taboo humour, she makes light of her traumatic past, mental-health struggles and her relationship with her dead daddy. Edinburgh Festival Fringe 2023 sell-out show.\n; Category: Comedy",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "1 Cent Comedy presents: Normal Dysfunctional Family (Game Show)",
    "presenter": "Stoopid Comedy by Mihai Tartara / Free Festival",
    "location": "Laughing Horse @ The Raging Bull",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241001NOR_ANU.jpg",
    "description": "A comedy game show where comedians battle each other using childhood trauma and the audience decide who had the worst parents. Sold-out run Edinburgh Fringe 2023. Three rounds. Round One: a five-minute stand-up set about family and childhood. Round Two: prepared scenarios containing a location and a subject, and our comedians have to improvise a family fight scene based on the notes. Round Three: similar to the game Scenes We'd Like to See from Mock the Week, but only with family topics.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "1 Cynic, 1 Mystic: A Late Night Comedy Extravaganza",
    "presenter": "Republic of Comedy",
    "location": "Laughing Horse @ West Port Oracle",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CANYOUP_CNB.jpg",
    "description": "The world-famous 'Magdalena the fortune teller' is finally coming to Fringe! She will show you the future, as a very cynical German comedian reminds you of the past. And trust us, by the end you will realize how funny the present really is. 'An unexpected mixture and a fascinating show' (Scotsman).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "1 Date: The 18+ Game Show (Free!)",
    "presenter": "Look At That Productions / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Liquid Room Annexe/Warehouse",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241DATETH_AOX.jpg",
    "description": "Not for the easily offended, this hilarious brand-new dating show sees the audience play naughty games, five guys compete for a date, and overall chaos. If you love to laugh, compete and – of course – join in a sing-along, this is the perfect way to begin your evening at the Fringe. We recommend having a drink before you come!; Category: Cabaret and Variety",
    "start": "Aug 6-13 "
  },
  {
    "title": "1 Date: The 18+ Game Show (Free!)",
    "presenter": "Look At That Productions / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Burrito ‘n’ Shake",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241DATETH_CHS.jpg",
    "description": "Not for the easily offended, this hilarious brand-new dating show sees the audience play naughty games, five guys compete for a date, and overall chaos. If you love to laugh, compete and – of course – join in a sing-along, this is the perfect way to begin your evening at the Fringe. We recommend having a drink before you come!; Category: Cabaret and Variety",
    "start": "Aug 6-25 "
  },
  {
    "title": "1 Dazzling Cabaret Show",
    "presenter": "Cabaret in The City ",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241DAZZLI_1U.jpg",
    "description": "'Life is a cabaret, old chum, come to the Cabaret!' Come be treated to a night of creativity, diversity and artistic impression – from sultry dancers to dazzling singers and hilarious comedians. Featuring a mix of music, dance, comedy and tantalising performances, this show will treat you to a diverse range of acts: from glamorous dancers to soulful singers as well as cheeky comedians and seductive burlesque performers. This show exudes playfulness, sensuality and empowerment in a vibrant and inclusive environment. A show that promise to entertain and intrigue all tastes.\n; Category: Cabaret and Variety",
    "start": "Aug 6, 8-13, 15-20, 22-25 "
  },
  {
    "title": "1 Hour of Insane Magic",
    "presenter": "Insane Productions",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241HOUROF_BRI.jpg",
    "description": "After a sell-out sensation at the Edinburgh Fringe 2023, Insane Magic are back even bigger and even more Insane! Witness some of the most incredible acts of magic from 'three of the best magicians in the country' (EdinburghLive.com). Cameron Gibson, Elliot Bibby and Luke Osey return with everything from insane magic tricks and impossible illusions, to amazing acts of mind-reading, this is a show that's 'so insanely good' (WorldMagicReview.com) it has to be seen to be believed!; Category: Cabaret and Variety",
    "start": "Aug 9, 13-16, 18-26 "
  },
  {
    "title": "1 Hour of Insane Magic: After Dark",
    "presenter": "Insane Productions",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241HOUROG_BRH.jpg",
    "description": "After their sell-out sensation at the Edinburgh Fringe 2023, Insane Magic are back... but this time After Dark! Join the Insane Magic boys – along with some hand-picked special guests from the world of magic, circus and variety – for an hour of naughty, wild and sometimes extreme late-night magic. This show is full of stuff a little too raunchy for their daytime show! May contain: adult themes, naughty language, traces of nuts and a little nudity... and one cast member doesn't go to the gym!; Category: Cabaret and Variety",
    "start": "Aug 8-11, 15-18, 22-25 "
  },
  {
    "title": "1 in a Chameleon",
    "presenter": "Narie Foster",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241INACHB_5B.jpg",
    "description": "How do we uncover our true colours in a world full of reasons to hide? A life-affirming, thought-provoking comedy about trying to blend in everywhere yet belonging nowhere, from engineer, entrepreneur (Forbes 30 Under 30) and award-winning storyteller Narie Foster in her Edinburgh Fringe debut. Born in New York to Thai and Canadian scientists, Foster takes us on a multifaceted exploration of freedom, authenticity and scantily camouflaged metaphors. 'Beautifully written. Raw and honest. Naturally hilarious.' **** (InReview.com.au).; Category: Theatre",
    "start": "Aug 6-11 "
  },
  {
    "title": "1 Irish 1 English: Afternoons",
    "presenter": "Reece Kidd and Ollie Fox",
    "location": "Laughing Horse @ Eastside",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241IRISH1_CKC.jpg",
    "description": "Join us at 16.35 for a stand up comedy show featuring English comedian Ollie Fox and Irish comedian Reece Kidd. They have over 25 million views online, 27K+ Followers, and a British Comedy Guide award under their belts, with two sold-out shows last year at the Edinburgh Fringe.; Category: Comedy",
    "start": "Aug 11-25 "
  },
  {
    "title": "1 Irish, 1 English: Evenings ",
    "presenter": "Reece Kidd and Ollie Fox ",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241IRISHB_CNM.jpg",
    "description": "Join us at 20:15 for a stand up comedy show featuring English comedian Ollie Fox and Irish comedian Reece Kidd. They have over 30 million views online, 30K+ followers, and a British Comedy Guide award under their belts, with two sold-out shows last year at the Edinburgh Fringe.; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "1 Irish, 1 English: Mornings",
    "presenter": "Ollie Fox and Reece Kidd",
    "location": "Just the Tonic at Cabaret Voltaire",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241IRISHA_CRD.jpg",
    "description": "Join us at 11am for a stand-up comedy show featuring English comedian Ollie Fox and Irish comedian Reece Kidd. With over 25 million views online, 27,000 followers, a British Comedy Guide Award under their belts, and sold-out shows last year in Edinburgh, London and Barcelona. 'Formidable' (NottsComedyReview.wordpress.com).; Category: Comedy",
    "start": "Aug 7-11, 13-25 "
  },
  {
    "title": "1 *Irishman: A Stand-up Comedy Show ",
    "presenter": "Reece Kidd / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Carbon",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IRISHAS_BRC.jpg",
    "description": "1 *Irishman: is a stand-up comedy show featuring Northern Irish comedian Reece Kidd supported by his favourite Irish comedians. Reece has 30 million views online and had two sold-out Edinburgh shows in 2023 which received over 80+ five-star reviews from audience members. This is a work in progress show so there will be plenty of crowd work and interaction with the audience. ; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "1 Lung Run",
    "presenter": "1BallCo",
    "location": "Just The Tonic Legends",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241LUNGRU_CQJ.jpg",
    "description": "After beating cancer twice (losing a lung and a testicle in the process) NYC comedian Terence Hartnett is starting to run again in his new home: Vienna. An ex-pat, a cancer survivor and a runner walk into a bar... 'Whip-smart and emotionally intelligent, Hartnett is not to be missed.' (Comedy Clubhouse).; Category: Comedy",
    "start": "Aug 6-11, 13-14, 16-25 "
  },
  {
    "title": "1 Moment in Time",
    "presenter": "Sean Alexander",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MOMENTS_BSH.jpg",
    "description": "In his brand new, thought-provoking show, magician and mind illusionist Sean Alexander reflects on the defining moments in time that shape each and every one of us. With jaw dropping magic throughout, each instance intertwined with powerful metaphors and storytelling, this show is unlike anything else. Discover your moments in time all over again... 'You are incredible, I will have you attend the palace' (HRH Princess Michael of Kent). 'Incredibly talented' (Stephen Mulhern). 'I love magic that tells a story and I really like you' (Simon Cowell).; Category: Cabaret and Variety",
    "start": "Aug 6-10, 12-24 "
  },
  {
    "title": "1 Murder: The Mind-Reading Lawyer",
    "presenter": "Tomas McCabe",
    "location": "theSpaceTriplex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241MURDER_AMP.jpg",
    "description": "Fringe veteran mind reader, Tomas McCabe, is back with a show that combines his trademark mentalism with a courtroom drama. Having been the go-to Fringe performer for mind reading for four years running, Tomas has now taken his skills to the next level by training as a barrister. Expect a family-friendly show of incredible mentalism mixed with the drama of court. Are you brave enough to sit as the judge or jury, or will you be the one on trial?; Category: Cabaret and Variety",
    "start": "Aug 6-10, 12-17 "
  },
  {
    "title": "1 Murder: The Mind-Reading Lawyer",
    "presenter": "Tomas McCabe",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241MURDER_BSH.jpg",
    "description": "Fringe veteran mind reader, Tomas McCabe, is back with a show that combines his trademark mentalism with a courtroom drama. Having been the go-to Fringe performer for mind reading for four years running, Tomas has now taken his skills to the next level by training as a barrister. Expect a family-friendly show of incredible mentalism mixed with the drama of court. Are you brave enough to sit as the judge or jury, or will you be the one on trial?; Category: Cabaret and Variety",
    "start": "Aug 19-24 "
  },
  {
    "title": "#1 Son – Natasha Mercado",
    "presenter": "Natasha Mercado",
    "location": "Underbelly, Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241SON_UF.jpg",
    "description": "LA clown Natasha Mercado invites you to a mass that’s equal parts holy and horny – hosted by God’s sexiest son, Father Greg Orian. Experience a religious awakening like no other. Desire and devotion. Sacred, yet profane. It's like church, but with 'smash or pass' revelations about lust, lies and living with your demons... As seen on HBO Max and [adult swim].; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Pilgrim",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_2W.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 12 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Banshee Labyrinth",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_4R.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 6-8, 11-15, 18-22, 25 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ The Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_3P.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 13 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Globe Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_ZY.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 10 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ BrewDog Lothian Rd",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_BKI.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 15 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Strathmore Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_CKK.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 11 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Whistlebinkies",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_CNE.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 19 "
  },
  {
    "title": "10,000 Digits of Pi",
    "presenter": "Vinay Sagar / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Satyr",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410000DI_CVA.jpg",
    "description": "'This guy will do anything for a laugh, and it works' **** (FringeToronto.com). 'This show is certainly unique. Because the set of numbers and audience-chosen punishments change between shows, every performance is different. Sagar doesn’t seem to play a character, and the audience is involved throughout. This is one of those shows that blurs the line between audience and performer, and makes you wonder if it’s a play or even a comedy show altogether. It’s a nice respite from the otherwise formality of theatre' (PatronAndPearl.com).; Category: Comedy",
    "start": "Aug 18 "
  },
  {
    "title": "10,000 Ideas by Robyn Perkins",
    "presenter": "Robyn Perkins",
    "location": "Laughing Horse @ 32 Below",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410001ID_CEO.jpg",
    "description": "Winner: Best Comedy, Shaftesbury Fringe 2023. In her latest hour of critically acclaimed stand-up, London-based comedian Robyn Perkins invites you to ask her anything, and she’ll do the rest. Previous questions (answered truthfully) include: 'Would America be better off if it didn’t elect its own presidents?', 'Can we draft your wedding vows?' and even 'Who’s the hottest audience member?'. Same title, different show. Participation is optional. But audiences can’t help getting involved in Perkins’ energetic, eclectic and absolutely enthralling show. Reviews of 10,000 Ideas: 'Downright hilarious' **** (FringeFeed.com.au). 'She makes some excellent noises.' **** (One4Review.co.uk).; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "10 Party Games – Jollybox!",
    "presenter": "Tommy Jollyboat / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Liquid Room Annexe/Warehouse",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TOMMY10_AJG.jpg",
    "description": "The comedy game show where the audience play along! Quip, quiz and draw your way to victory as we find the funny in everything! Artistic talent not required. Bring a charged smartphone and join us!; Category: Comedy",
    "start": "Aug 6-24 "
  },
  {
    "title": "10 Pound Baby",
    "presenter": "Leah Renee",
    "location": "Laughing Horse @ 32 Below",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WOULDIL_ALY.jpg",
    "description": "The average C-section in the USA costs £25-40K, but you can just squat one out in the back like a feral cat for FREE! Comedian and skinflint Leah Renee returns to Fringe with a new hour about the price of believing in yourself. Show reviewers called it 'Funny, daring and quite surprising in places' with 'laugh out loud moments...wryness, poignancy, shock and tenderness' (EdFringeReview.co.uk).; Category: Comedy",
    "start": "Aug 7-12, 14-19, 21-25 "
  },
  {
    "title": "10 Songs for Geeks – Jollyboat",
    "presenter": "Jollyboat / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Liquid Room Annexe/Warehouse",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JOLLYBO_AJG.jpg",
    "description": "Fringe legends Jollyboat bring their best comedy songs from 14 years of touring and sold-out Fringe shows. Catchy tunes, witty lyrics and high-energy fun from start to finish. Help us celebrate the things that make us laugh, and find out why so many people return year after year! ***** (BroadwayBaby.com). ***** (GeekChocolate.co.uk). ***** (InformedEdinburgh.co.uk).; Category: Comedy",
    "start": "Aug 6-24 "
  },
  {
    "title": "10 Things They Hate About Me",
    "presenter": "Shinanne Higgins",
    "location": "Laughing Horse @ The Brass Monkey",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202410THING_CLZ.jpg",
    "description": "When it comes to relationships, Shinanne is all about the D... disappointment! She's a 40-year-old, single \"lady\" on a journey of reflection. Her eggs are hanging on like contestants in Gladiators... even her cultural references are old! The show is a hilarious account of the trials and tribulations of dating in a Tinder reality after growing up in a kissing in the disco world. Inevitably she begins to ask 'what's wrong with me?' So begins the introspective, somewhat ridiculous and comical list of \"flaws\" that expose Shinanne's weaknesses in the modern dating era.; Category: Comedy",
    "start": "Aug 18-25 "
  },
  {
    "title": "100% C*ntinental",
    "presenter": "Random Things Comedy",
    "location": "Laughing Horse @ Home Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024100CNTI_BCN.jpg",
    "description": "What’s the difference between expats and immigrants? Can Americans get deported from countries? What even is Europe after being dumped by the UK? These global comedians are putting their lives (or at least their dignity) on the line to find out. 100% C*ntinental is a stand-up comedy mix show, unpacking the experiences of international women adjusting to life, love and paperwork via Google Translate. Find out if it's true that Italians are sexy and Germans are humourless, and what would happen if Emily went to Paris on minimum wage.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "100% My Type On Paper",
    "presenter": "Drop Dead Theatre",
    "location": "C ARTS | C venues | C alto",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024100MYTY_CSM.jpg",
    "description": "Sammy and Clyde are on their first date. It’s cute. It’s awkward. It’s bad jokes and forced laughter. Sweaty hands and wondering who gets the next round. It’s 'I really want to kiss her' and 'I hope he doesn’t try to kiss me'. It’s excruciating, but that’s a first date, right? As Sammy and Clyde get to know each other again, and again, their reality slowly falls to pieces. Missed jokes become hilarious one-liners. Awkward silences become witty repartee. The customers become an audience. Everyone starts watching – and Sammy and Clyde? They become disposable.; Category: Theatre",
    "start": "Aug 12-17, 19-25 "
  },
  {
    "title": "100% The Greatest Comedian Alive or Dead (No Refunds)",
    "presenter": "Burt Williamson / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Voodoo Rooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024100THEG_4Q.jpg",
    "description": "Bristol comedian and club favourite Burt Williamson, 'hilarious at every turn' **** (Scotsman), performs his second hour of stand-up comedy. Silly and serious, smart and stupid, Burt packs dense punchlines with goofy charm to great comedic effect. At the forefront of a new and exciting generation of comics emerging from Bristol, Burt leads the charge on a new wave of talent in British comedy in this exciting solo hour. 'The funniest, most unlikely, rudest yet sweetest' **** (Entertainment-Now.com). 'Absurd and excellent' (Rife Magazine). 'Affable and poised' **** (Bristol365). ***** (EdFringeReview.com).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "100 Things You are Overthinking – An Improv Stand-up Comedy Game Show!",
    "presenter": "Republic of Comedy",
    "location": "Alchemist Cocktail Bar and Restaurant",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024001OVES_CLD.jpg",
    "description": "Fifth year on the Fringe! Join our comics as they battle it out, creating comedy from any thought you have. Just write them anonymously on pieces of paper we provide and watch the comics create a set on the spot, just for you! Entry without tickets is not guaranteed, as we have regulars that religiously come back every evening for a completely different show. 'Very funny but also thought-provoking' (Scotsman).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "100 Things You are Overthinking – An Improv Stand-up Comedy Game Show!",
    "presenter": "Republic of Comedy",
    "location": "Alchemist | St James Quarter",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024001OVES_CLE.jpg",
    "description": "Fifth year on the Fringe! Join our comics as they battle it out, creating comedy from any thought you have. Just write them anonymously on pieces of paper we provide and watch the comics create a set on the spot, just for you! Entry without tickets is not guaranteed, as we have regulars that religiously come back every evening for a completely different show. 'Very funny but also thought-provoking' (Scotsman).; Category: Comedy",
    "start": ""
  },
  {
    "title": "The 100-Year-Old Letter",
    "presenter": "Good Wolf People",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024100YEAS_CPV.jpg",
    "description": "In 1916, Christabel Mennell writes a letter of apology to Katie Marsh. It is finally delivered in 2021 and becomes a global news sensation. Travelling from Bath to London, via two world wars and two pandemics, the unreceived letter of apology sparked people’s imaginations, opening up a fascinating mystery: what was the apology for? Who were the women writing to one another? What became of them? After a year of speculation and research, Good Wolf peels back the layers of time to reveal a funny, moving story of history, war, faith, friendship and porridge oats.; Category: Theatre",
    "start": ""
  },
  {
    "title": "100 Years of Disney",
    "presenter": "Octavoce",
    "location": "The Edinburgh Academy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024100YEAT_AVM.jpg",
    "description": "Celebrating over 100 years since the iconic Disney title sequence first graced our screens, award-winning international vocal ensemble Octavoce present another whirlwind a cappella trip through our favourite Disney tunes. A sell-out at the Fringe 2023, we'll take you from earlier films like Cinderella and Jungle Book, to the Disney Renaissance of the 90s, right up to more recent films such as Brave and Frozen. We know Disney animations hold a very special place in the hearts of many generations so we welcome all ages. Come on down and tap into that Disney nostalgia.; Category: Music",
    "start": "Aug 7 "
  },
  {
    "title": "100 Years of Musicals!",
    "presenter": "Show Choir",
    "location": "theSpaceTriplex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024100YEAR_BKL.jpg",
    "description": "In their Fringe debut, the UK's No.1 show choir invites you on a joyous journey through the rich history of musical theatre, in a fun-packed a cappella show for all the family! Starting back in the raucous days of the music hall, this high energy revue features much-loved and well-known songs from genre defining composers like Gershwin and Lloyd Webber – all the way through to big, modern day musical titans like Lin Manuel Miranda. Join us for a glorious celebration of the very best of West End magic!; Category: Music",
    "start": ""
  },
  {
    "title": "1000% Musical Comedy from David Hoare",
    "presenter": "David Hoare",
    "location": "Hill Street Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241000MUS_BMC.jpg",
    "description": "Award-winning David Hoare returns with another bumper show, brimming with silliness. He aims to bring you maximum musical comedy! Last year’s show 1 Billion Songs Please! was a rousing success and 2022's show 100 Songs in an Hour had a sell-out run! Don’t miss this early afternoon hour of joyfully rude songs. 'An annoyingly funny young man' (Gary Delaney). 'David has that magic combination of quick wit and observational insight' (EdFringeReview.com). 'With some slick one-liners and aggression akin to Bo Burnham, James Acaster or Tim Vine' (DeadlineNews.co.uk).; Category: Comedy",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "101 Comedy Club – Free",
    "presenter": "Ian Miller / Mat Wills / Laughing Horse",
    "location": "Laughing Horse @ The Hanover Tap",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024101COME_BBE.jpg",
    "description": "'Funny. Fast. Free' **** (ThreeWeeks). 'Picture BBC's Live at the Apollo' **** (DeadlineNews.co.uk). Each night sees four experienced acts performing. All our comedians have been hand-picked from an ethical, fair-trade farm where they've been grown in only the finest organic dog poo. All our fart jokes are sustainable due to our unique carbon offset scheme. Each time one of us blows off, a tree is planted in Dagenham, Essex.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "101 Ways to Annoy Your Parents and Other Really Old People",
    "presenter": "Matty Grey – Kids Comedian ",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BUBBALI_J7.jpg",
    "description": "Title says it all! *Evil laugh*. Don't worry, I'll also teach the parents how to annoy their kids as well. From multi award-winning kids comedian Matty Grey. Laugh your guts out of your butthole as he brings the chaos of his mind to the Edinburgh Fringe. 'Matty Grey is the master of children's entertainment and he knocks it out of the park' ***** (Advertiser, Adelaide). 'Matty Grey is loud, enthusiastic, and will (mildly) insult your children!' ***** (PlayAndGo.com.au). Winner: Best Kids Show, Adelaide Fringe 2023.; Category: Children's Shows",
    "start": "Aug 8-18 "
  },
  {
    "title": "101 Ways to Annoy Your Parents and Other Really Old People – The Christmas Special",
    "presenter": "Matty Grey – Kids Comedian",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024101WAYS_J7.jpg",
    "description": "It's all in the title (hahahahahahahaha). 101 Ways to Annoy Your Parents and Other Really Old People is back, and this time we're taking on Christmas – in August?! Matty Grey brings the second chapter in his award-winning series to England... (agent whispers into Matty's ear while typing). 'What's that? Scotland isn't a part of England?! No, I didn't see the end of Braveheart.' Winner: Best Kids Show, Adelaide Fringe 2023, Perth Fringe 2020 and 2017. 'Matty Grey will mildly insult your kids' (Advertiser, Adelaide).; Category: Children's Shows",
    "start": "Aug 19-25 "
  },
  {
    "title": "10th Annual Haters' Ball",
    "presenter": "Hate N Live",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241STANNU_CNH.jpg",
    "description": "The crown jewel of comedy... The smash hit stand-up event 10 years in the making... The show that Gerard Butler declared to be 'the most fun I've ever had compacted into one hour'... Now celebrating a decade of comedy, chaos, and hilarity, it's The 10th Annual Haters' Ball. Four hilarious headline comedians compete to be named the biggest 'Hater' in comedy. Fully interactive, no two shows are the same. 'Brutally funny' (Scotsman). 'Raucous, dick-swinging comedy' (Chortle.co.uk). 'Every show is guaranteed to be unique and hysterical' (Dircksey.com.au).; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "11 Lessons on Being Loud (from an American Opera Singer)",
    "presenter": "Steph DePrez",
    "location": "Laughing Horse @ Home Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202411LESSO_BCN.jpg",
    "description": "Knockout opera-singing stand-up comedian Steph DePrez is back with a new show about dreams, risks and how exactly Americans learn to be so… loud. Steph weaves stories about confidence and failure in between opera arias, gospel hymns and jazz standards 'performed with the gravitas afforded by possessing a diaphragm like a blacksmith’s bellows' (TheWeeReview.com). Audience reviews: 'Well worth a trip off the beaten track'. 'Hilarious chats, heavenly singing. A real hidden gem'. 'Never thought of combining stand-up comedy with opera, but Steph does it beautifully! A ton of laughs'. ; Category: Cabaret and Variety",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "11pm Live at the Big Cave",
    "presenter": "RGB Monster",
    "location": "Just the Tonic at The Caves",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202411PMLIV_V1.jpg",
    "description": "End your day at the Festival in style at our iconic Edinburgh venue with the very best in stand-up talent. Expect top TV names, Netflix stars, and gems of the festival in this 90-minute late-night boozy extravaganza where anything goes! Rub shoulders and boogie with the artists until the wee hours!; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "12th Year! John Hunt Four O'Clock Afternoon Blues and Swing",
    "presenter": "21st Century Blues Legends",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202412THYEA_ZO.jpg",
    "description": "'Fantastic!' (Jools Holland). 'Boogie-woogie slide-guitar master' **** (Scotsman). 'The Fringe's most unique, inventive and soulful blues performer, a fantastic gig' **** (BroadwayBaby.com). Hunt's 12th Fringe following 11 years of full-house performances. 'Blues legend built his own cannibalised, recycled guitars from a B&Q shelf and papier-mache' **** (Herald). 'Instantly evocative of the deep south blues. Unique R'n'B take on Sinatra alongside a James Bond mash-up. Whatever Hunt plays, it feels refreshingly authentic' **** (List). 'Ingenious 21st-century blues' **** (ThreeWeeks). 'Like Seasick Steve in a science lab, a storming set' (Ian Rankin).; Category: Music",
    "start": "Aug 7, 9-10, 14, 16-18, 22, 24 "
  },
  {
    "title": "13th Morning",
    "presenter": "BT Hayes",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024THIRTEE_CPX.jpg",
    "description": "13th Morning comes, naturally, after the Twelfth Night. Sebastian and Olivia are married after she had been in love initially with Viola. Is it bad that she can't stop thinking about her husband's sister? Meanwhile, Antonio returns from his trips across the sea to share with Sebastian this new thing called \"being gay\"! They recall a time when they might have been just that. And Malvolio is still trying to figure out a way to seek his revenge, but all he's managed to do is learn to play shitty acoustic covers of Oasis songs. Or just one.; Category: Theatre",
    "start": "Aug 12-17, 19-24 "
  },
  {
    "title": "15 – Equinox",
    "presenter": "Davy Macdonald",
    "location": "Dundas Street Gallery",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202415EQUIN_BAU.jpg",
    "description": "Contemporary Edinburgh artist Davy Macdonald celebrates his 15th annual solo exhibition with a stunning new collection of abstract, conceptual and figurative oil paintings. A richly imaginative and inspiring collection of narrative landscapes, soulful portraits and abstract expressionistic paintings bursting with colour, pattern and musical rhythm. Over the past decade or so, Davy has developed his own very distinctive aesthetic, criss-crossing genres with surreal and sensual, dramatic and dreamlike vision. A diverse and unique exhibition not to be missed.\n; Category: Exhibitions",
    "start": ""
  },
  {
    "title": "16 Postcodes",
    "presenter": "Jessica Regan / The Spontaneity Shop",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202416POSTC_HP.jpg",
    "description": "Twenty years, 16 postcodes, one city. In her debut storytelling show, Jessica Regan (BBC, Channel 4, Guilty Feminist) shares lessons lived and learned from a life in no particular order. Each show is drawn from true tales of love and landlords, of mice and men and more, told with help from the audience who will play their part in her odyssey as she moves North, South, East and West, finding out which is best. This is a journey through an impenetrable city with an all-too-open heart. You'll laugh, you'll cry, you rent cos you can't afford to buy...; Category: Theatre",
    "start": "Aug 7-11, 13-26 "
  },
  {
    "title": "160th Edinburgh International Exhibition of Photography 2024",
    "presenter": "Edinburgh Photographic Society",
    "location": "Edinburgh Photographic Society",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024160THED_ANE.jpg",
    "description": "Edinburgh Photographic Society's first international photography exhibition was shown in 1861. This is the 160th running of this prestigious international print exhibition. Invited judges select around 160 of the best photos out of thousands entered. Entry is open to all from March until June. We have two categories, Mono and Colour with up to four entries in each. Any genre is eligible. Images must originate as captures by light and the copyright owned by the submitting photographer. A printed A4 colour catalogue is included in the entry fee. ; Category: Exhibitions",
    "start": "Aug 6-25 "
  },
  {
    "title": "1954: Ella, Etta, Eartha",
    "presenter": "Melissa Western",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241954ELL_P2.jpg",
    "description": "It's the year 1954. Ella Fitzgerald, Etta James and Eartha Kitt are all at the dizzy heights of their careers. With swinging jazz, powerful soul and cheeky kitsch, these women broke new ground for all who followed. Award-winning singer/actor Melissa Western and her musicians pay tribute to this magnificent era in music and inspiring trio of pioneering singers. 50s style abounds. 'Western is a force of nature... Great storyteller, feisty, highly enjoyable' ***** (BroadwayBaby.com). 'Absolutely brilliant… Her aptitude for music is vast and versatile' ***** (ThreeWeeks). 'Western's gorgeous singing voice serves her well' (TheAustralian.com.au).; Category: Cabaret and Variety",
    "start": "Aug 7-10 "
  },
  {
    "title": "1984",
    "presenter": "witintheatre",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241984_R7.jpg",
    "description": "1984 is a compelling physical theatre adaptation of George Orwell's classic, performed by Slavic actors. With inspiration from Nick Hern's adaptation, it delves into themes of surveillance and control, offering a haunting and immersive experience that challenges perceptions of truth and reality. Through expressive movement and visceral choreography, audiences are transported into Orwell's dystopian universe, feeling the oppressive atmosphere of Big Brother's world firsthand. This innovative fusion of physicality and narrative captivates spectators, leaving a lasting impact and sparking thought-provoking conversations about the state of our society and the dangers of unchecked power.; Category: Theatre",
    "start": "Aug 7-9, 11 "
  },
  {
    "title": "199 Jokes Before Lunchtime: High Whisk",
    "presenter": "Danny Matinee",
    "location": "theSpace @ Symposium Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HIGHWHI_CES.jpg",
    "description": "An insect joke? Tick. A tartan joke? Check. A joke about giraffes in a bar? That's a tall order. Danny Matinee takes you to the grocer (who sells him a dodgy razor, bloody cheek), Nando's (with the menu on the ceiling, he needs a peri-periscope) and beyond in his new show, full of one-liners, puns, props and pictures. Suitable for all ages, especially fans of Masai Graham, Milton Jones and Tim Vine. Might include free coffee. By the author/performer of solo shows at the Brighton Fringe, Edinburgh Fringe and Leicester Comedy Festival.; Category: Comedy",
    "start": "Aug 7-10 "
  },
  {
    "title": "1k Comedy Presents: Toby Shure and Friends – Love Ireland!",
    "presenter": "Peter Bazely / Free Festival",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241KCOMED_2A.jpg",
    "description": "Are you looking for love in all the wrong places? Toby was, until he discovered the ancient lost Gaelic secrets to love, life and the universe. Fringe legend Toby Shure invites you to join him and some of his favourite comedians from around the world for a crazy party of a good time. Dating-themed stand-up compilation show, come for laughter and leave with a partner. Three sold out Fringe runs – get your tickets in advance to avoid disappointment! ‘You’ll probably get cancelled’ (Prince Abdi). ***** (Cambridge Footlights).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "1st Dates: Asian Bachelor",
    "presenter": "Lance Mao",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241STDATE_CNK.jpg",
    "description": "31, single, and lives with his mother. Sounds like a catch? Join Lance on his quest to find \"the one\" during (yes, during) this stand-up show about Chinese culture, dating, mental health, aspiration and struggle through the lens of a first-generation Chinese immigrant family. Why is he still single? Is it the stereotypes? His personality? Does he just have high standards? 'He needs a real therapist' * (an Uber driver). 'What kind of man defames his family' * (His mother). 'Here are five asterisks' *****, 'One day he will be a *' (Himself). 'Disturbing' (Audience member).; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "2/3rds of a Threesome (and Friends)",
    "presenter": "AJ Holmes and Caitlin Cook",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202423RDSOF_BBI.jpg",
    "description": "A raucous evening of music, comedy and musical comedy hosted by AJ Holmes (Book of Mormon, StarKid) and Caitlin Cook (The Writing on the Stall). Featuring their funniest and most famous friends from Hollywood, Broadway, stand-up, musical theatre, clown and everything in between; this musical variety spectacle regularly sells out shows in NY, LA, London and Edinburgh. Past guests include Daniel Sloss, Ilana Glazer, David Cross, Phil Wang, Janeane Garofalo, Reggie Watts, Flo & Joan, Mark Normand, Larry Dean, Catherine Cohen, Ivo Graham and more. You never know who is going turn up!; Category: Comedy",
    "start": "Aug 22-24 "
  },
  {
    "title": "2.7 Men",
    "presenter": "Louis George, Will Scambler and Louisa Corr",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202427MEN_Z2.jpg",
    "description": "These three rising stars of the London comedy circuit return to Edinburgh following a sell-out run last year to do two things: blow their life savings on an Airbnb, and perform an hour of mind-melting stand-up comedy. And guess what? Their direct debit's just gone through... Join Louis George (SYTYF? semi-finalist), Will Scambler (Chortle Student Comedy finalist) and Louisa Corr (as seen in This Time With Alan Partridge) for this tantalising triple bill. There's something for everyone! And, thanks to the gender pay gap, you've got three acts for the price of just 2.7 men.; Category: Comedy",
    "start": "Aug 11-25 "
  },
  {
    "title": "2 and a Half Women",
    "presenter": "Mari Volar, Ann Vaida, Annick Adelle",
    "location": "Laughing Horse @ Home Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242ANDAHA_BCN.jpg",
    "description": "Three queer international comedians (Ann Vaida, Annick Adelle and Mari Volar) bring their WIP shows to Edinburgh and band together to make their solo debuts less harrowing. Mari Volar is presenting the world with a feminist manifesto for all aspiring trophy wives. Ann Vaida invites you along to exist in a completely arbitrary sh*tstorm of a society, and other jokes. Annick Adelle offers the world stand-up shows where true magic unfolds. A show made up of three comedians. One will show up to your show. These really are some of the best odds in showbusiness.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "2 Artists, 2 Concerts, 2 Premieres",
    "presenter": "Johan Hartman – Bass Baritone, Ailsa Aitkenhead – Piano",
    "location": "Greyfriars Kirk",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242ARTISU_GK.jpg",
    "description": "Rising American opera star and composer Johan Hartman is joined by Edinburgh’s Ailsa Aitkenhead in two varied programs. Featured works include Mr Hartman’s song cycles on poems by WB Yeats and Robert Browning, as well as lieder and songs by Franz Schubert and Gerald Finzi.; Category: Music",
    "start": "Aug 6, 9 "
  },
  {
    "title": "2 Become Wand: Hudson & Hudson – Magic",
    "presenter": "Hudson & Hudson",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242BECOME_BRK.jpg",
    "description": "When real-life married funny magicians decided to perform a double-act, they thought it would be the perfect combination of fun and tricks. However, their personal-life bickering tends to get in the way of the magic. 'Climaxes ranging from silly to mind-blowing. Two immensely engaging and talented performers' **** (BroadwayBaby.com). 'You fooled us' Penn & Teller. 'Ace. Brilliant. Authentic' (Amanda Holden).; Category: Comedy",
    "start": "Aug 6-12, 14-26 "
  },
  {
    "title": "2 Funny Feckers",
    "presenter": "Wes Dalton / Sergi Polo / Free Festival",
    "location": "Laughing Horse @ The Hanover Tap",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242FUNNYF_BBE.jpg",
    "description": "The craic is back after a sell-out run in 2023 with 60 minutes of non-stop laughs from two hilarious comics seen on RTE, BBC, and ITV – Wes Dalton (creator of sell-out show 4 Funny Feckers) and Barcelona's Sergi Polo. Hosted by Wes, an international Irish comedian returning with tales of his Asian comedy tour/mid-life crisis and featuring Sergi, an award-winning one-liner comic and internet sensation, plus a different guest comedian nightly. This is an amazing hour of comedy with something for everyone: spine-tingling crowd work, cheekiness and stories from Wes, and brilliant one-liners from Sergi. ; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "2 Guys 1 Pub",
    "presenter": "Richy Sheehy and Mark O'Keeffe / Free Festival",
    "location": "Laughing Horse @ The Brass Monkey",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242GUYS1P_BSA.jpg",
    "description": "Two award-winning comics deal late-night craic in the mid-afternoon, a wild mix of dark, satirical stand-up and musical comedy. 'These guys are going to be huge' (David McSavage). 'Cork's finest export' (RedFM.ie).; Category: Comedy",
    "start": "Aug 6-13, 15-25 "
  },
  {
    "title": "2 Guys, 3 Drams: The Ultimate Live Blues and Whisky Experience",
    "presenter": "The Rhythm and Booze Project",
    "location": "theSpace @ Venue45",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242GUYS3D_VN.jpg",
    "description": "2022 and 2023 Fringe sell-out show. Join duo The Rhythm and Booze Project as they play some stomping blues music and serve you three superb Scotch whiskies. In a whirlwind 65 minutes, get ready to learn how to sound clever about whisky, appreciate top-quality drams, and enjoy some raucous tunes. 'If you like blues and you like whisky then you’ve got to see this show' **** (BroadwayBaby.com). 'This provided the most euphoric experience I have ever had at the Fringe' ***** (MumbleMusic.net).; Category: Music",
    "start": "Aug 8-24 "
  },
  {
    "title": "2 Muslim 2 Furious",
    "presenter": "Aisha Amanduri and Hasan Al-Habib / Free Festival",
    "location": "Laughing Horse @ Dragonfly",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242MUSLIM_CET.jpg",
    "description": "Aisha and Hasan prove that not all British Muslims perform useful jobs, like doctors, nurses or playing for Liverpool. But just try to name a funnier Kazakh-Iraqi double act… we’ll wait! 2M2F is a work-in-progress stand-up comedy show from: Birmingham Comedy Festival Breaking Talent Award 2023 winner Hasan Al-Habib and Funny Women One-To-Watch 2023 Aisha Amanduri. 'Deliciously funny' (Guardian, no surprise they're fans). 'Clever, edgy and unexpected' (Kemah Bob of BBC’s Richard Osman's House of Games, FOC It Up! podcast). 'Super talented' (Mae Martin of Channel 4’s Taskmaster).; Category: Comedy",
    "start": "Aug 6-9, 11, 13-18, 20-25 "
  },
  {
    "title": "2 Slut Drops and a Chicken Burger",
    "presenter": "Kirsty Munro",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242SLUTDR_6R.jpg",
    "description": "Slut drop it like it's hot! Kirsty talks about sexy times, nights out and starting a fight with a yoga instructor. 'An absolute joy from start to finish. 100% highlight of the Fringe' (Audience review, 2023). 'Kirsty is a fantastic high-energy act, she was a huge hit with the Fat Penguin audience' (Jay Handley, Fat Penguin Comedy Club). 'High-energy storytelling and subjects from cringe to pure genius. You will absolutely love her!' (Who Knows Comedy). Finalist, Some-Antics Comedy Slam 2023. ; Category: Comedy",
    "start": "Aug 7-12, 14-25 "
  },
  {
    "title": "2 Truths, 1 Lie",
    "presenter": "Simon Caine",
    "location": "Ghillie Dhu",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242TRUTHS_ARK.jpg",
    "description": "Funny, but is it true? Three headline comedians step on stage. Two are telling the truth, one is a big fat liar. Can you tell who...? The award-winning interactive comedy compilation sell-out show returns to a brand-new air-conditioned venue on the Grassmarket! The perfect show for fans of BBC's Would I Lie To You? Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 17, 26 "
  },
  {
    "title": "2 Truths, 1 Lie",
    "presenter": "Simon Caine",
    "location": "Le Monde",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242TRUTHS_CLJ.jpg",
    "description": "Funny, but is it true? Three headline comedians step on stage. Two are telling the truth, one is a big fat liar. Can you tell who...? The award-winning interactive comedy compilation sell-out show returns to a brand-new air-conditioned venue on the Grassmarket! The perfect show for fans of BBC's Would I Lie To You? Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "2 Truths, 1 Lie",
    "presenter": "Simon Caine",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242TRUTHS_CNH.jpg",
    "description": "Funny, but is it true? Three headline comedians step on stage. Two are telling the truth, one is a big fat liar. Can you tell who...? The award-winning interactive comedy compilation sell-out show returns to a brand-new air-conditioned venue on the Grassmarket! The perfect show for fans of BBC's Would I Lie To You? Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "2 Truths, 1 Lie",
    "presenter": "Simon Caine",
    "location": "Hoots @ Potterrow",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242TRUTHS_CRA.jpg",
    "description": "Funny, but is it true? Three headline comedians step on stage. Two are telling the truth, one is a big fat liar. Can you tell who...? The award-winning interactive comedy compilation sell-out show returns to a brand-new air-conditioned venue on the Grassmarket! The perfect show for fans of BBC's Would I Lie To You? Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 5 "
  },
  {
    "title": "2 White Guys Rapping: Whose Rhyme is it Anyway?",
    "presenter": "Whose Rhyme?",
    "location": "Laughing Horse @ 32 Below",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242WHITEG_ALY.jpg",
    "description": "If Eminem and Whose Line is it Anyway had a baby... this is what you'd get!  Award-winning performer Daniel Delby and acclaimed Aussie freestyle rap superstar Macshane have joined forces to create the most interactive freestyle comedy show on Earth! Expect high energy, improvised chaos as their lightning-quick wits and razor-sharp mic skills battle it out for the ultimate victory - your laughs! 'I believe it is one of the best events this Fringe season' ****½ (FringeFeed.com.au).; Category: Comedy",
    "start": "Aug 15-25 "
  },
  {
    "title": "2 Wongs and a White",
    "presenter": "2 Wongs and a White / Free Festival",
    "location": "Laughing Horse @ Eastside",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242WONGSA_CNA.jpg",
    "description": "Get ready to laugh with Two Wongs and A White: a stand-up comedy show featuring Australia’s funniest comedians. Each night Jenny Tian, Patrick Golamco and Nick Schuller bring you the best of Australian humour. They’ve been on TV, toured internationally, sold out festival runs and written for telly. 'Delivery is spot-on' ****½ (TheatreMatters.com.au). 'Perfectly timed' ****½ (TheAge.com.au). ***** (Scotsman).; Category: Comedy",
    "start": "Aug 7, 12-25 "
  },
  {
    "title": "20 Years of the Free Fringe Festival – Charity Gala Show",
    "presenter": "Laughing Horse Comedy / Free Festival / 20 Years Celebration",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202420YEARS_LH.jpg",
    "description": "A huge gala show with all proceeds going to the Sepsis Trust, celebrating 20 years of the Laughing Horse's Free Edinburgh Festival Fringe. Featuring a host of big-name comedians and faces from the past two decades of the Free Fringe Festival coming together for a good cause and an unmissable one-off celebration looking back at the last 20 years of the Free Fringe Festival, an organisation that has helped to change the face of the Edinburgh Fringe. Then, join the after-party with the performers and DJs until 3am.; Category: Comedy",
    "start": "Aug 14 "
  },
  {
    "title": "200% and Bloody Will Be Thy End",
    "presenter": "Siege of Herons",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024200ANDB_CPY.jpg",
    "description": "Star-cross'd storytellers take you through multiple anarchic, humorous and contradictory re-enactments of a midsummer night they'd rather forget. Cross-cutting personal anecdotes of love, dances with death, dressing up and living their best life. ; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "200 Puns in One Hour with Roger Swift",
    "presenter": "Roger Swift / Free Festival",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024200PUNS_BKH.jpg",
    "description": "The comedic prop-pun lunatic Roger Swift shoots out 200 puns in one hour! With his trademark crazy homemade props, audio cues and PowerPoint slides. Expect corny jokes and silliness; with no theme besides wordplay. Do not expect someone taking himself seriously. Dave's Funniest Joke of the Fringe list 2016 and 2023.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "2018: Launch on Warning",
    "presenter": "Siege of Herons",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242018LAU_CPY.jpg",
    "description": "False missile alert. Hawaii, 2018. Four teenagers shelter in a walk-in freezer in this The Breakfast Club-meets-Oppenheimer exploration of human connection, existentialism, and whether we act in ways that align with who we think we are in emergencies.; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "2024 Greek Comedian of The Year, Greek in The Sheets – George Zacharopoulos",
    "presenter": "Georgios Zacharopoulos",
    "location": "Just The Tonic Legends",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242024GRE_CQK.jpg",
    "description": "Brand new show about my love of life, my fear of death and the time I was accused of terrorism and espionage by the Australian Federal Police. Sold-out in Melbourne International Comedy Festival. 'Accomplished stand-up at quite a frenetic pace' ***** (One4Review.co.uk). 'A masterclass in comedic storytelling' ***** (TheQR.co.uk). 'Wicked sense of humour' ***** (TheReviewsHub.com). 'It is simply brilliant' **** (EdFringe Review).; Category: Comedy",
    "start": "Aug 6-11, 13-17, 19-25 "
  },
  {
    "title": "21: The Music of Adele",
    "presenter": "Night Owl Shows",
    "location": "theSpace @ Symposium Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202421THEMU_V6.jpg",
    "description": "Heartfelt homage to one of music’s most-awarded females. Hits Rolling In the Deep, Someone Like You and Set Fire to The Rain sung by the awe-inspiring Ella McCready and the Night Owl Band. Night Owl Shows bring more than just the music with a take on the tribute genre that has won them awards and sold out shows worldwide. Experience why Adele captured so many souls in this powerful voyage through a modern classic set delivered from the heart of a genuine fan, with an unbelievable ability to reach emotions touched only by Adele herself.; Category: Music",
    "start": "Aug 7-25 "
  },
  {
    "title": "22 (Brooke's Version)",
    "presenter": "Brooke / 36 Expressions",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202422_CEV.jpg",
    "description": "New York comedian/Moth StorySLAM Champ's debut comedy hour follows sold-out short-form workshops. Come laugh with Brooke as she trips and falls fighting spacetime continuum, economy, patriarchy, fertility, herself, while trying to get a date. In her pop-culture/Broadway mental musical (Swifties enjoy an invisibly-strung Eras tour), Brooke campaigns to lead a better future. Join Brooke's New Year's Eve-celebration, reflection, resolution. She'd like to change her life New Year's Day. Ideally, February 2nd. Audience reviews: 'Smart comedy for smart people'; 'Wild ride'; 'Fast-paced, quick-witted stand-up/storytelling mashup'; 'Never experienced anything like that'; 'Highly inspirational message.' Previous: **** (Skinny, TheatreWeekly.com, LondonTheatre1.com).; Category: Comedy",
    "start": "Aug 9-11, 16-18, 21-25 "
  },
  {
    "title": "22 Mirrors – A Musical Journey Through the Tarot",
    "presenter": "Giulia Drummond",
    "location": "The Speakeasy at The Royal Scots Club",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202422MIRRO_CSD.jpg",
    "description": "Joined by two musicians and two dancers, Brazilian singer/songwriter Giulia Drummond takes us through a ritualistic performance exploring the 22 Major Arcana of the Tarot. Expect an entrancing and intriguing experience, a magical journey through symbols and sonorities.; Category: Music",
    "start": "Aug 11, 18 "
  },
  {
    "title": "The 25th Annual Putnam County Spelling Bee",
    "presenter": "C&C Productions Ltd",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202425THANN_3S.jpg",
    "description": "Rachel Sheinkin and William Finn's musical The 25th Annual Putnam County Spelling Bee tells the story of six middle-schoolers growing up and of the relationships they form with each other, with their families and with the three adults running the Bee. With audience participation and improv elements, it is a heartwarming and hilarious tale of childhood motivations, friendship, making yourself proud and juiceboxes!; Category: Musicals and Opera",
    "start": "Aug 12-17, 19-24 "
  },
  {
    "title": "The 25th Annual Putnam County Spelling Bee",
    "presenter": "Edinburgh University Savoy Opera Group",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202425THANO_P1.jpg",
    "description": "Please spell 'entertaining'! The 25th Annual Putnam County Spelling Bee follows six quirky and sometimes obnoxious students in their quest for the coveted first place trophy. Accompanied by three even quirkier adults, audience members, juice boxes, community service requirements, magic feet, and the unfortunate effects of puberty, the spellers must make their way through a series of increasingly difficult (and hilarious) words, whilst also dealing with their own stressful, embarrassing, or occasionally upsetting personal lives. This show is guaranteed to leave you laughing, crying and wondering if 'hasenpfeffer' is even a real word.; Category: Musicals and Opera",
    "start": "Aug 6-10 "
  },
  {
    "title": "\"26\" Songs Nicole Cassandra Smit Wants to Sing",
    "presenter": "Nicole Cassandra Smit",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202426SONGS_ZO.jpg",
    "description": "Scotland's Queen of Blues, Nicole Cassandra Smit turns her hand on jazz, interpreting standards from Dinah Washington to Monica Zetterlund to Astrud Gilberto. The stellar new quintet will include Vid Gobac on drums, Cameron Bradley on bass, Dave Toule on guitar and Kassandra E'Silva on saxophone.; Category: Music",
    "start": "Aug 2 "
  },
  {
    "title": "27",
    "presenter": "Cold Open Theatre (Scotland)",
    "location": "C ARTS | C venues | C aurora",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242A_CJW.jpg",
    "description": "As Jam’s 28th birthday approaches, he announces to his flatmates Hank and Morgan that he's going to kill himself instead, earning a place in the 27 Club, and getting the three of them famous. Bickering and hijinks lead them closer and closer to a birthday party themed around dead celebrities, revelations about themselves and their friendship, and an utterly unforgettable drunken self-tape for Virgin Media. 27 is the story of three young artists and their ridiculous exploits as they try to break into the industry.; Category: Theatre",
    "start": ""
  },
  {
    "title": "2Flamenco",
    "presenter": "TuFlamenco",
    "location": "Argyle Cellar Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242FLAMEN_BLI.jpg",
    "description": "Powerful, exquisite, beautiful and unforgettable Flamenco experience. Inma Montero and Danielo Olivera, well known Flamenco artists and Fringe regulars for more than a decade, bring a fresh, elegant and original vision to the main styles of Flamenco, creating a magical, intimate and special atmosphere. Experience an uplifting, moving and highly entertaining trip into the essences of Flamenco, where guitar, singing and dance coordinate spontaneously with sensitiveness, humour and complicity in a genuine twist without forgetting its pure roots, providing audiences a glimpse of Flamenco's origins and even the future. A treat for music and dance lovers. Fiesta time!; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 6-25 "
  },
  {
    "title": "2lian Stern Keeps 2rying",
    "presenter": "Julian Stern / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Burrito ‘n’ Shake",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242LIANST_CHS.jpg",
    "description": "'Funniest show I've seen this year!' (Audience Review). Julian Stern (Maxim, McSweeney's, FuseTV, Playstation) brings back his beloved 2023 show, Julian Stern Keeps Trying, a show about whether to try. Jokes and songs about OCD, Anne Hathaway at Target, depression-eating an entire rotisserie chicken and the dangers of improv comedy. 2023 Audience reviews: 'Julian’s storytelling is great and his songs are some of the absolute funniest I’ve ever heard'; 'Extremely special!'; 'Outstanding storytelling!'; '(Hopefully not for long) underrated show! A gem of a show!'; Category: Comedy",
    "start": "Aug 14-18 "
  },
  {
    "title": "2lian Stern Keeps 2rying",
    "presenter": "Julian Stern / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Carbon",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242LIANST_CVO.jpg",
    "description": "'Funniest show I've seen this year!' (Audience Review). Julian Stern (Maxim, McSweeney's, FuseTV, Playstation) brings back his beloved 2023 show, Julian Stern Keeps Trying, a show about whether to try. Jokes and songs about OCD, Anne Hathaway at Target, depression-eating an entire rotisserie chicken and the dangers of improv comedy. 2023 Audience reviews: 'Julian’s storytelling is great and his songs are some of the absolute funniest I’ve ever heard'; 'Extremely special!'; 'Outstanding storytelling!'; '(Hopefully not for long) underrated show! A gem of a show!'; Category: Comedy",
    "start": "Aug 6-13 "
  },
  {
    "title": "3",
    "presenter": "Mick Perrin Worldwide by arrangement with The Free Association",
    "location": "Assembly George Square Studios",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FREEASS_AAV.jpg",
    "description": "Three improvisers. Endless possibilities. A unique three-act theatrical comedy experience, created in the moment by an all-star cast of improvisers (Austentatious, St Doctor's Hospital, KoolStoryBro) and very special guests. Three of the UK's finest, funniest improvisers will create a unique and hilarious hour-long play improvised entirely in the moment. In this miraculous feat of spontaneous storytelling, the three performers will play every character – inspired by three audience suggestions, a live musician and three pieces of set – to create a one-of-a-kind show. Brought to you by The Free Association. 'The FA know how to find the funny' (Guardian).; Category: Comedy",
    "start": "Aug 14-26 "
  },
  {
    "title": "3 Chickens Confront Existence",
    "presenter": "LookFWD Arts",
    "location": "Assembly Roxy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243CHICKE_9B.jpg",
    "description": "Three factory farm chickens attempt to find a greater sense of purpose by engaging each other in a series of philosophical debates, games, feuds and emotional experiments while awaiting their imminent trip to the broiler.; Category: Theatre",
    "start": "Aug 9-11, 13-18, 20-26 "
  },
  {
    "title": "3 Couples, 2 Breakups, 1 Barbie and The Berlin Wall",
    "presenter": "Square Pegs – Macready Theatre Young Actors’ Company",
    "location": "C ARTS | C venues | C aquila",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243COUPLE_CL.jpg",
    "description": "Seven teenagers (and a Barbie doll) invite you to a joyfully absurd play about love – in all its weird and wonderful forms. Square Pegs ask lots of questions about what it means to be human in their life-imitating-art play about growing up and in its own inimitable, absurdist fashion, offer absolutely no answers whatsoever! Offie-nominated Macready Theatre Young Actors share tales of breakups, heartache and what it’s like to fall in love with the Berlin Wall with fast-paced, fun-filled story-telling. ‘A short spectacular showcase’ ***** (MumbleTheatre.net). ‘Joyous’ **** (BroadwayBaby.com).; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "3 Kidneys, No Colon",
    "presenter": "Dave Piontkowski",
    "location": "Laughing Horse @ Eastside",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243KIDNEY_CNA.jpg",
    "description": "Dave infuses humor into the highs and lows of his health journey battling chronic kidney disease and ulcerative colitis, while discovering the resilience of the human spirit.; Category: Comedy",
    "start": "Aug 6-23 "
  },
  {
    "title": "3 Out of 4 Twats",
    "presenter": "Backbone Comedy",
    "location": "Laughing Horse @ Downstairs at Betty's",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243OUTOF4_CKD.jpg",
    "description": "Curated, produced and hosted by Glasgow Comic, Jimi Longmuir, this show has evolved across Edinburgh Fringe and GICF since 2022 with acts chosen to best represent the current climate within the world of stand-up. Its one constant is a vibrant and exciting dynamic to delight audiences with a unique atmosphere and vibe. This August, we are bringing NYC internet sensation Ashley Gutermuth, Zimbabwe-born but Orkney-bred comic Grant Gunn and English expat dominatrix Sally Porter with tales of life as a dominatrix in the Netherlands and Falkirk; plus a variety of special guests.; Category: Comedy",
    "start": "Aug 7-11, 14-18, 21-25 "
  },
  {
    "title": "3 Queens of New York",
    "presenter": "Meka Mo, Onika McLean, Glorelys Mora / Free Festival",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243QUEENS_2A.jpg",
    "description": "Three Queens from New York. This hilarious comedic showcase highlights three very different comedians from three very different parts of New York City. These three women all bring a different style and energy to their comedy, but at the end of the day, it’s all very New York!; Category: Comedy",
    "start": "Aug 6, 8-13, 15-20, 22-25 "
  },
  {
    "title": "3's Comedy: Afternoons",
    "presenter": "Splinter Comedy",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243SCOMEE_BKH.jpg",
    "description": "You've had a big lunch, now have a big laugh at 3's Comedy: Afternoons. Featuring Adam Knox, Ben Searle and Jordan Barr, three of the best of the new wave of Australian comedians at the festival. They've done stand-up on television, they've won awards, they've been all over the radio, they've hosted countless podcasts, they've sold out shows, they've gigged around the world and now they've arrived in Edinburgh to do comedy for you!; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "3's Comedy: Late Late Nights",
    "presenter": "Splinter Comedy",
    "location": "Laughing Horse @ The Pear Tree",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243SCOMEH_BCS.jpg",
    "description": "It's not late. It's late-late. And there's no better time for some loose laughs than when it's late-late. 3's Comedy: Late Late Nights brings together three of the hottest grots of the new wave of Australian comedy in Lewis Garnham, Alessio Carducci and Ty Gray to make you laugh.; Category: Comedy",
    "start": "Aug 6-24 "
  },
  {
    "title": "3's Comedy: Late Nights",
    "presenter": "Splinter Comedy",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243SCOMEG_U7.jpg",
    "description": "The night is young and 3's Comedy: Late Nights is going to bring you an electrifying mix of crowd work and stand-up comedy. You never know what's going to happen at Late Nights, the only guarantee is that you're going to laugh. 3's Comedy: Late Nights stars Ben Searle, Lewis Garnham and Adam Knox, three of the brightest stars of the new wave of Australian comedy. They're staying up late to deliver you some late-night laughs.; Category: Comedy",
    "start": "Aug 6-13, 15-25 "
  },
  {
    "title": "3's Comedy: Mornings",
    "presenter": "Splinter Comedy",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243SCOMED_BJP.jpg",
    "description": "Start your day off with a laugh at 3's Comedy: Mornings. 3's Comedy brings together Adam Knox, Bronwyn Kuss and Peter Jones, three of the rising stars of the new wave of Australian comedy for a whole new hour of hilarious stand-up. They've been seen on TV, they've been heard on the radio and they've been bumped into on public transport on the way to gigs all across the world. Knox, Kuss and Jones are guaranteed to make you laugh. are guaranteed to make you laugh. 'You'll laugh 'til it hurts' (TheWest.com.au).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "3's Comedy: Nights",
    "presenter": "Splinter Comedy",
    "location": "Laughing Horse @ Eastside",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243SCOMEF_CMW.jpg",
    "description": "The sun has gone down and the lights have come up so that means it's time for comedy. 3's Comedy: Nights brings together three of the best young acts of the new wave of Australian comedy for an hour that's jam packed with laughter. Ben Searle, Aidan Jones and Adam Knox have done it all have done it all – they've been on TV, they've been on radio, they've performed all over the world and now they're at the Fringe ready to make you laugh.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "300 Hours Behind Fringe",
    "presenter": "Moni Zhang Comedy and 1 Cent Comedy",
    "location": "Fringe Online",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024300HOUR_CBS.jpg",
    "description": "Ever wondered what it's like to be a Edinburgh Fringe comedian? Neither has Moni Zhang, but she's doing it anyway. Tune in and watch her slowly lose her mind as she live streams her 12-hour workdays for 25 straight days at the Edinburgh Fringe. Because who needs rest when you can have comedy-induced delirium?; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "300 Paintings",
    "presenter": "Sam Kissajukian",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024300PAIO_AKS.jpg",
    "description": "Winner of eight Australian Fringe Festival awards. Is art a joke? Sydney artist and comedian Sam Kissajukian examines 300 paintings created during a five-month long manic bipolar episode. An epic story exploring art, mental health and creativity.; Category: Theatre",
    "start": "Aug 6-11, 13-18, 20-26 "
  },
  {
    "title": "The 30th Anniversary Edinburgh London Literary Pub Crawl",
    "presenter": "Nick Hennegan – The London Literary Pub Crawl",
    "location": "Pleasance Dome",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202430THANN_CUJ.jpg",
    "description": "After many acclaimed Edinburgh productions from the Maverick Theatre Company, its writer and director, Nick Hennegan, celebrates his 30 years of the Fringe with this new, unique Edinburgh version of the acclaimed London Literary Pub Crawl! Joining Hennegan will be Charles Dickens, William Shakespeare, Harry Potter, D.I. Rebus and other literary giants who lived and loved in Scotland's capital and frequented many of its fine pubs. It will feature some readings of both modern and contemporary works... and visit many pubs! Alcohol is optional! A literary love letter to Edinburgh from Nick.; Category: Theatre",
    "start": "Aug 6-14, 16-25 "
  },
  {
    "title": "33 Years Single",
    "presenter": "Daniel Delby",
    "location": "Laughing Horse @ Dragonfly",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202433YEARS_CET.jpg",
    "description": "One-of-a-kind interactive comedy show featuring Australia's most eligible bachelor Daniel Delby who had his first girlfriend at 33... for six weeks. Daniel tells stories of rejection, love and everything in between. But the fun doesn't stop there – you'll have the opportunity to join in with Delby's trademark, his improv freestyle songs, ranging from R&B love songs to red flags being a good thing! 'Delby is a must-see for your Fringe experience. He will have you leaving the show with a grin, wanting to see his next show too.'  ***** (FringeFeed.com.au, 2024).; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "360 ALLSTARS",
    "presenter": "Onyx Productions",
    "location": "Assembly Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024360ALLS_AT.jpg",
    "description": "Sold out on Broadway! Sold out at the Sydney Opera House! Seen by over one million people worldwide! BMX, basketball, breakdancing, beatboxing, acrobatics, drumming and more, 360 ALLSTARS connects the street with the elite to deliver a supercharged urban circus. Boasting a stellar cast of World Champion and World Record-holding artists and athletes, the international smash hit returns to Edinburgh as part of its 2024 World Tour! 'Blindingly talented' ***** (BroadwayBaby.com). 'Destined to be a sell-out' ***** (TheWeeReview.com). 'The most thrilling stage show ever' ***** (WeekendNotes.com).; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 7-13, 15-26 "
  },
  {
    "title": "360° Street Art Exhibition, Spray Paint Tasters and Affordable Art Sale",
    "presenter": "Quality Yard",
    "location": "Quality Yard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024360STRE_BVB.jpg",
    "description": "Outdoor 360° wrap-around street art exhibition at Quality Yard in Leith. Bringing creative street art and graffiti by nationally and internationally exhibited artists to Edinburgh.  Newly painted artworks covering over 50m are free to view on six external walls. We accept Pay-What-You-Want donations, have fun Pay-What-You-Want spray paint tasters and an affordable street art prints sale. A unique Edinburgh 360° visual experience in our quiet 18th-century walled courtyard in the heart of Leith’s historic old town. A hidden Leith gem, just 180 metres from The Shore Tram stop.; Category: Exhibitions",
    "start": "Aug 10, 17, 24 "
  },
  {
    "title": "3HAMS",
    "presenter": "3HAMS",
    "location": "Just the Tonic at The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243HAMT_ACK.jpg",
    "description": "3HAMS is produced by Charlie Traisman and Makena Miller. The play premiered in NYC at Triskelion Arts Brooklyn, and ran at Brooklyn Comedy Collective and Caveat NYC. Director: Billie Aken-Tyers, associate director of the hit show, Titanique (Off-Broadway, Daryl Roth Theater). 3HAMS follows Max and Ry, two friends whose bond was forged through their shared struggle with eating disorders. In the confines of their collective brain, they must confront truths of their unhealthy dynamic, and what is needed to break the cycle. In the muck of it all, the greatest insight comes from an unlikely source… a literal ham.; Category: Theatre",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "4 Antipodeans Walk into a Bar",
    "presenter": "Sully O'Sullivan",
    "location": "Scottish Comedy Festival @ The Beehive Inn",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20244ANTIPO_1I.jpg",
    "description": "New Zealand Comedy Award Winner Sully O’Sullivan hosts a rolling showcase of some of the best comedic talent Australasia has to offer. With typical downunder directness, this show does exactly what it says on the tin: one microphone, one stage, and four stand-ups from the other side of the globe. 'Kiwi Sully O'Sullivan is our hilarious host' (ThreeWeeks). 'His timing and wit were impeccable!' (Australian Times). Please note the producers of 4 Antipodeans Walk into a Bar are not liable for any Home Office raids that may occur during the show.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "4 Comedy Masterminds: Stand up Comedy and Game Show – A Crowd Work Special",
    "presenter": "Prateek Jajoo / Free Festival",
    "location": "Laughing Horse @ The Raging Bull",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20246THSENS_ANU.jpg",
    "description": "A Hit Stand-up Comedy Game Show from Berlin makes its debut in Fringe. Get ready for a show that buzzes with laughter and good vibes, thanks to pro-comedians and a unique interactive comedy game that will make your day. Our show promises not just giggles but a wholesome experience of joy, health and beauty, thanks to the magic of laughter! Enjoy a line-up of Edinburgh's finest comedians, carefully curated for this show and with at least five years of stage experience. It's a total blast!; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "4 Funny Feckers",
    "presenter": "Wes Dalton / Free Festival",
    "location": "Laughing Horse @ The Hanover Tap",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20244FUNNYF_BBE.jpg",
    "description": "Return of the craic! 4 Funny Feckers, a sell-out Fringe favourite, is hosted by cheeky Irish comic Wes Dalton, an Irish charmer who has cheekiness and likeability down to a tee. One of London's most popular stand-up comedy nights, we showcase four fantastic comedians daily from Ireland and beyond. Devour the best of the fest for lunch. At the 2017 Fringe, Wes managed to convince a Dutchman to propose to his girlfriend on stage. The video went viral and the following year they returned to 4 Funny Feckers on their honeymoon. Different acts daily. Keep coming back!; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "4 girls the first letter e",
    "presenter": "Missing Rib Collective",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20244GIRLST_CPW.jpg",
    "description": "In 2012, two girls stabbed their friend 19 times at Slenderman’s instruction. This play is loosely inspired by these real events. Evie and her friends are obsessed with the video-game world of The King. As reality and gameplay blurs, how far will they go to save themselves from each other? This show explores how we teach young girls to grow up and who we should really be afraid of. Its sold-out London reading was described by audiences as 'truly gripping,' 'a beautiful balance of light and dark,' and 'as strong as (it was) understated.'; Category: Theatre",
    "start": "Aug 12-17, 19-24 "
  },
  {
    "title": "#40sandsingle – The Early Morning Cabaret Comedy Show!",
    "presenter": "Performer: Joyce Lao. Company Name: The Ally Artists Group LLC",
    "location": "theSpace @ Symposium Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202440SANDT_CES.jpg",
    "description": "Dr. Kara Kibara is a self-proclaimed and successful online dating expert. She has helped thousands of people find love, but she herself is still single in her 40s. In this interactive cabaret show, Dr. Kara goes back to her past and reflects on what went wrong (or maybe right) that caused her to still be loveless. She shares her insights on dating, relationships and love, and she offers her advice on how to find The One.; Category: Cabaret and Variety",
    "start": "Aug 13-17 "
  },
  {
    "title": "419 Dirty Words",
    "presenter": "Fair Pley / The Stand Comedy Club",
    "location": "The Stand Comedy Club 5 & 6",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024419DIRT_AEO.jpg",
    "description": "What makes a word into a slur? How can two inoffensive words put together make an offensive phrase? And why are competitive Scrabble players so upset about being denied the chance to use deeply unpleasant language in polite company? Dr Chris Cummins (The University of Edinburgh) takes a look at word meaning and use on the ragged edge of good taste, while trying not to get drafted for the culture wars.; Category: Spoken Word",
    "start": "Aug 17, 22 "
  },
  {
    "title": "44 Sex Acts In One Week",
    "presenter": "Clubhouse Productions",
    "location": "Pleasance Dome",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202444SEXAC_PV.jpg",
    "description": "A fruity apocalyptic rom-com from the razor-sharp pen of Fringe First winner David Finnigan. Girl meets boy. Girl hates boy. Girl f*cks boy 44 times. The world collapses. Some seriously naughty actors go down on their microphones, mangos and melons in this slippery, subversive take on a classic radio play, a clever and uproarious response to humanity's decision to go harder, faster, FASTER! towards the end of the world. 'Brilliantly horny and unhinged.' **** (Time Out). 'You've probably been waiting all year for something to make you laugh this hard' **** (Sydney Morning Herald).; Category: Theatre",
    "start": "Aug 6-11, 13-18, 20-26 "
  },
  {
    "title": "45 Degrees of Perspiration",
    "presenter": "Ben Harrington / Free Festival",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202445DEGRE_BSB.jpg",
    "description": "Prepare for a great show full of laughter and enlightenment as comedian Ben Harrington tackles one of the most pressing issues of our time in his latest comedy show, 45 Degrees of Perspiration. Ben Harrington fearlessly delves into the complexities of climate change, offering a fresh perspective on the serious subject matter through the lens of humour. The show promises to deliver a blend of clever observations, witty anecdotes and funny commentary that will leave the audience both amused but also informed, while raising awareness about the global environmental crisis.; Category: Comedy",
    "start": "Aug 19-25 "
  },
  {
    "title": "5 Comedians for the Price of None",
    "presenter": "The Comedy Clubhouse (Barcelona) / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Southsider",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20245COMEDI_2Y.jpg",
    "description": "You have a 20% chance of enjoying the show! With the backing of Barcelona’s Comedy Clubhouse, Europe’s favourite gang of misfit comedians have put together a high-quality rotating line-up of international talents. They've won awards (Best of Brighton Fringe), they've been on TV shows (TV3, Stand Up Revolution) and they've even opened for the world's best comics (Michelle Wolf, Seann Walsh, Gianmarco Soresi and more). With five different comics every night in Richard Gadd’s (creator of Baby Reindeer) debut and favourite Fringe venue, you never know who will drop in.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "5 Headliners for £10",
    "presenter": "RGB Monster",
    "location": "Just the Tonic at The Caves",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20245HEADLI_V1.jpg",
    "description": "Five top-level circuit comedians perform their very best material, one after the other. No picking on the audience, no MC in between asking you where you're from – just non-stop laughs from headline-level international comedy circuit professionals who know exactly how to bring the funny! There is no better value-for-money way to spend £10 at the Fringe. Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 20-23 "
  },
  {
    "title": "5 Headliners for £10",
    "presenter": "RGB Monster",
    "location": "Just the Tonic Nucleus",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20245HEADLI_CER.jpg",
    "description": "Five top-level circuit comedians perform their very best material, one after the other. No picking on the audience, no MC in between asking you where you're from – just non-stop laughs from headline-level international comedy circuit professionals who know exactly how to bring the funny! There is no better value-for-money way to spend £10 at the Fringe. Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 10, 17, 24 "
  },
  {
    "title": "5 Headliners for £10",
    "presenter": "RGB Monster",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20245HEADLI_CNH.jpg",
    "description": "Five top-level circuit comedians perform their very best material, one after the other. No picking on the audience, no MC in between asking you where you're from – just non-stop laughs from headline-level international comedy circuit professionals who know exactly how to bring the funny! There is no better value-for-money way to spend £10 at the Fringe. Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-26 "
  },
  {
    "title": "5 Headliners for £10",
    "presenter": "RGB Monster",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20245HEADLI_CNI.jpg",
    "description": "Five top-level circuit comedians perform their very best material, one after the other. No picking on the audience, no MC in between asking you where you're from – just non-stop laughs from headline-level international comedy circuit professionals who know exactly how to bring the funny! There is no better value-for-money way to spend £10 at the Fringe. Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-26 "
  },
  {
    "title": "5 Mistakes That Changed History",
    "presenter": "5 Mistakes That Changed History",
    "location": "Assembly George Square Studios",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20245MISTAK_ADJ.jpg",
    "description": "We all make mistakes, but rarely do they change the course of history. Fresh from sold-out runs at Edinburgh, Sydney and Adelaide Fringe Festivals, the smash-hit historical storytelling show returns with a new show and new stories about five people and how their mistakes changed the world. Historian and comedian Paul Coulter brings history to life in a hilarious way. If you hated history at school, this is the show for you. If you loved history at school, stop looking and just book the show. Class credit not provided.; Category: Comedy",
    "start": "Aug 11, 13-18, 20-25 "
  },
  {
    "title": "5 Nights in Harperspace",
    "presenter": "Nick Harper",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NICKHAR_ZO.jpg",
    "description": "Acclaimed guitarist/singer/songwriter and double Herald Angel Award winner returns to Edinburgh's Jazz Bar and plays from his extensive back catalogue over five nights. Expect everything from the emotional to the political, from witty to virtuosic, and the singular to the universal... 'One of the finest guitarists, soaring vocals, epic songs' (Mojo). 'Harper has so much musicianship in him, that it just leaks out all over the place' (Times). 'Be there or be denied a life-affirming experience' (Rob Adams, Glasgow Herald). 'Betjeman with a guitar' (Guitarist). 'Acoustic Hendrix!' (Guitar).; Category: Music",
    "start": "Aug 7-11 "
  },
  {
    "title": "50/50 – George Zacharopoulos",
    "presenter": "George Zacharopoulos / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Whistlebinkies",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SHITSAN_CNE.jpg",
    "description": "Jokes from an award-winning comedian who headlines all over the world, followed by jokes based on audience suggestions. 50% stand-up, 50% improv. 50% me, 50% you. Tour support for Jim Jefferies, Larry Dean and Chris McCausland. 'Wicked sense of humour' ***** (TheReviewsHub.com).; Category: Comedy",
    "start": "Aug 3-25 "
  },
  {
    "title": "50/50 – George Zacharopoulos",
    "presenter": "George Zacharopoulos / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Whistlebinkies",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SHITSAN_B1.jpg",
    "description": "Jokes from an award-winning comedian who headlines all over the world, followed by jokes based on audience suggestions. 50% stand-up, 50% improv. 50% me, 50% you. Tour support for Jim Jefferies, Larry Dean and Chris McCausland. 'Wicked sense of humour' ***** (TheReviewsHub.com).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "50 Shades of Bouncer ",
    "presenter": "Aleksandr Popov",
    "location": "Alchemist Cocktail Bar and Restaurant",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202450SHADE_CLD.jpg",
    "description": "A long time has passed since I first stepped on the door. But one thing I still remember like it was yesterday – cold was the night when it all started. During the days that followed that night, I became many things... I graduated four colleges in three different countries earning degrees in law, politics and pedagogy. I worked manual labour, trained in a public sector, was an in-house lawyer, became a teacher and somehow even a college professor. I even ran for parliament! For I am the legion of 50 Shades of Bouncer.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "50 Ways Jesus (Almost) Ruined My Life",
    "presenter": "Sharon VS and Friends",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202450WAYSJ_BKH.jpg",
    "description": "Can too much religion in your teens screw up your sex life in your 50s? Then how come Mormons have so many babies? Is eternal life really worth the hassle? Forever is a long time. Especially if you’re married. Why walk on water when you could just take the ferry? Following 2023’s sold-out show, Sharon VS is back with a hilarious double-bill about mid-life crises, losing your religion and finding yourself. This show is for everyone who’s ever questioned their life choices and found a better answer than 'what would Jesus do?'.; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "500 Comedy Fans Can’t Be Wrong",
    "presenter": "Chris Scott, Sam Tennent, Natalie Bryce",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024500COME_CNK.jpg",
    "description": "A showcase of up-and-coming Scottish stand-up featuring Chris Scott (Best Newcomer nominee, Scottish Comedy Awards). His ‘why not?’ attitude has seen Chris perform in an underwear advert, at an S&M club and, less strangely, support Fringe favourites Alex Edelman and Susie McCabe. Chris is either joined by Sam Tennent (starting comedy after a life-threatening illness, he’s sold out multiple shows at the Glasgow Comedy Festival and somehow, once supported rapper Coolio); or Natalie Bryce (Scottish Comedian of the Year Finalist). Natalie is caring at heart but clumsy by nature, 'her gregarious personality engages' (Chortle.co.uk).; Category: Comedy",
    "start": "Aug 6-12, 14-26 "
  },
  {
    "title": "6 Impossible Things",
    "presenter": "Jordan Rooks",
    "location": "Just the Tonic Nucleus",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20246IMPOSS_CER.jpg",
    "description": "An Alice in Wonderland parody magic show! Come be part of the magic! Las Vegas magician Jordan Rooks combines magic, comedy and storytelling into an unforgettable time! Jordan's unique parody and magic shows combine stories we all grew up to love, real-world situations and brings magic to a whole new level. You won't want to miss this!; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "6 Steps To Success From The \"Award Winning\" Dave Chawner",
    "presenter": "Dave Chawner",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DAVECHA_Z2.jpg",
    "description": "Last year Dave won an award who's title felt like a back-handed compliment. That led to a crisis of confidence and an exploration of what success really looks like. As seen on BBC, ITV and Channel 4. As heard on Radio 1, Radio 2 and Radio 4.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "60 Minutes About Scotland",
    "presenter": "Vladimir McTavish",
    "location": "Laughing Horse @ Dragonfly",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202460MINUT_CET.jpg",
    "description": "With Vladimir McTavish and friends. Three-time winner at the Scottish Comedy Awards and 'one of the finest acts on the Scottish comedy circuit' (Guardian) hosts a one-hour showcase featuring some of the top names in stand-up from north of the border. Guests change daily, but an hour of hilarious world-class stand-up from Scotland is guaranteed. Total sell-out at the 2022 and 2023 Fringe. 'Inspired comedy brilliance' (AustralianStage.com.au).; Category: Comedy",
    "start": "Aug 6-9, 11, 13-18, 20-25 "
  },
  {
    "title": "60 Minutes Comedy Tour of the World: The Local Immigrant",
    "presenter": "Prateek Jajoo / Free Festival",
    "location": "Laughing Horse @ The Raging Bull",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LOCALIM_ANU.jpg",
    "description": "Prateek is a man of the world but don't call him an immigrant! Call him a New Yorker, Berliner, Spaniard or a Delhi Boy. His new special will take you on a world comedy tour, all through the eyes of an immigrant trying to integrate in different cultures as a local. Let's talk about Berlin's fetish scene and dating life where being monogamous is a red flag, Indian arranged marriages, and breathing in New York – expensive!; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "60 Minutes or Less: Or Your Comedy Free!",
    "presenter": "Ridwan Hussain and Oliver Moore",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202460MINUU_CNL.jpg",
    "description": "Hootenannies Fringe Act of the Year Winner and Runner up join forces again this year to bring you another stellar comedy show! In this novel concept the two stand-ups endeavour to perform for no more than 30 minutes each! Who could listen to a performance for any longer? Not me. Unless it was really really good. This show is really good, a good amount for the price range. The title is inspired by the movie 30 Minutes or Less where you can see a lady's boobs in one scene, which is nice.; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "69 and Under Date Night Comedy",
    "presenter": "Daniel Delby",
    "location": "Laughing Horse @ West Port Oracle",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202469UNDER_CNB.jpg",
    "description": "A comedy show that is perfect for date night with friends or partners. Award-winning comedian and host of Sunday Singles, Daniel Delby is your MC for the night. We start with some freestyle love songs, then decide what red/green flags are OK, an old-school perfect-match game for couples, as well as reading out the audience's own horror date stories and \"icks\" they've written and dropped into the story box prior to the show. 'So bloody funny, awesome interactive acts and the most hilarious freestyle too. Seriously recommend.' (FringeFeed.com.au 2024).; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "74th Annual Sunger Games",
    "presenter": "AcadePitch Productions",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202474THANN_3S.jpg",
    "description": "District 12, Katniss Everdeen, Ryanair. Worlds collide in this daring crossover. Music, so often a beacon of revolutionary expression, brings the popular Hunger Games universe to life as over 25 performers take to the stage in an all-singing, all-dancing a cappella adventure through the dangerous Capitol of Panem. What twist and turns lay waiting for our humble British tourists? Come and find out... and may the odds be ever in your flavour. That's the slogan right? Right.; Category: Music",
    "start": "Aug 19-24 "
  },
  {
    "title": "800 Pound Gorilla Alumni Showcase ",
    "presenter": "800 Pound Gorilla Comics ",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024800POUN_BRQ.jpg",
    "description": "US/UK Comedy Label 800 Pound Gorilla proudly presents this silly showcase celebrating some of its finest alumni. With recent releases from Fringe-favourites including Ivo Graham, Helen Bauer, Christopher Macarthur-Boyd, Josh Glanc, Harriet Kemsley, Josh Pugh, Dan Rath and Stuart Laws (to name a few); expect a stellar line-up and banana-flavoured cocktails (if they work out a palatable recipe by then).; Category: Comedy",
    "start": "Aug 21 "
  },
  {
    "title": "99 Red Hot Kitties and a Cockatoo",
    "presenter": "Red Hot Kitty Burlesque and Cabaret",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202499REDHO_3S.jpg",
    "description": "Cheeky and spirited, 99 Red Hot Kitties and a Cockatoo possesses an endearing seductiveness, with time-honoured burlesque and fan dances. Features a mix of seasoned performers and local, new, up-and-coming performers loving the skin they are in. This show is highly energetic and will leave audiences spellbound.; Category: Cabaret and Variety",
    "start": "Aug 6-10, 12-17, 19-24 "
  },
  {
    "title": "999 Problems",
    "presenter": "Mr Dead Sound",
    "location": "Just the Tonic at The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024999PROB_ACK.jpg",
    "description": "Multi award-winning Irish comedian Paul Marsh is back with his new show about turning 50, marriage and firefighting. Join Paul and his friend Lorcan on guitar, for a gag-filled hour of stories, songs, audience participation and one-liners (loads of one-liners!). The two biggest comedy clubs in Dublin refer to him as 'Ireland's biggest gag merchant' and 'the king of one-liners'. You are guaranteed a fast-paced hour of laughter, with more jokes and variety than any other show at this year's Fringe!; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "The A Cappella Xperience",
    "presenter": "The Bristol Suspensions",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACAPPEL_BRH.jpg",
    "description": "The Bristol Suspensions take you on a journey through their 10th year as a group – their triumphs, their pressures and everything in between. This student group from the University of Bristol have just hit their 10th year and want you to celebrate with them in this concert-style show. The Suspensions deliver stunning vocals, slick choreography, beautiful arrangements and leave you wondering why you didn't join an a cappella group at university. The group will give you a glimpse into the world of a cappella and leave you wanting more!; Category: Music",
    "start": "Aug 12-17, 19-24 "
  },
  {
    "title": "A.L.Ex and The ImpRobots Present: An AI Show for Kids!",
    "presenter": "Improbotics Kids!",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALEXTHE_CEU.jpg",
    "description": "Sixty minutes of hilarious fast-paced interactive science theatre for the whole family featuring real robots, AI, and laughs. Join A.L.Ex. the fully autonomous improvising-comedy robot and The Improbots, a trio of comedian scientists as they explore the science of humour. Mixing slapstick and improv comedy with provocative questions about human and artificial intelligence, kids big and small will have an opportunity to interact with A.L.Ex through improv games, dance, and silly challenges while exploring funny science.; Category: Children's Shows",
    "start": "Aug 6-18 "
  },
  {
    "title": "A-Z: The Geek's Guide to Seduction",
    "presenter": "Darius Davies",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AZTHENE_CNI.jpg",
    "description": "From Android to Zuckerberg – how to woo a partner whilst talking about discount codes, skincare routines and Wrestlemania. Darius Davies presents A-Z: The Geek's Guide to Seduction. Expect a 'a rock-solid hour of constant laughs... supercharged by precision timing and an impassioned, charismatic delivery' (Chortle.co.uk). 'Hilarious... Brutally funny' (Scotsman). 'Energetic, self-aware and genuinely hilarious... a must watch' (The Student).\n\n; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "AAA Batteries (Not Included)",
    "presenter": "Chris Turner Productions",
    "location": "Just the Tonic at The Caves",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAABATT_V1.jpg",
    "description": "An hour of sharp gags, quick wit and high energy hijinks from three of the comedy circuit's funniest performers. Don't miss out on one of the Fringe's most popular all-ages comedy shows, returning for its twelfth year at the Edinburgh Fringe after hundreds of sell-out shows! 'Humour for everyone... I can't recommend it highly enough' ***** (ThreeWeeks). 'This show has to have wide appeal. Thankfully, it has bucket loads... a great show' **** (Skinny). 'Obtains every ounce of mirth... keeping adults, children and teens alike rejoicing' **** (EdFestMag.com).; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "Aaaaa Very Fringey Show",
    "presenter": "Grownup Playhouse",
    "location": "theSpaceTriplex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAAVE_BKL.jpg",
    "description": "What makes the perfect Fringe show: comedy, theatre, magic, puppets, improv? Yes. The perfect show is every show in one. Spend 50 minutes with four young hopefuls who will pitch to you the fringiest Fringe show ever! You’re the hotshot new producer with a venue to fill and these four think they have a show that will pack in the crowds… and if their first pitch doesn’t wow you, they’ve got another hundred ideas for the ultimate Fringe hour! They won’t take no for an answer and in the end their…\"immeasurable\" talent will win you over!!; Category: Comedy",
    "start": "Aug 20-24 "
  },
  {
    "title": "Aaaaaaaaaaaargh! Here Comes Trouble!",
    "presenter": "Masai Graham",
    "location": "Laughing Horse @ Dropkick Murphys",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAAAD_ABN.jpg",
    "description": "Masai Graham, does his first-ever solo show, with tales about how he got into comedy, the clean jokes that won him multiple awards and (more importantly) the naughty jokes that got him into multiple trouble.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Aaaaaaaaaaargh! It's 101 Clean Jokes in 30 Minutes",
    "presenter": "Masai Graham",
    "location": "Laughing Horse @ Dropkick Murphys",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAAAB_ABN.jpg",
    "description": "Award-winning gag merchant and three-time Joke of the Fringe winner Masai Graham delivers over 100 clean jokes in half an hour. Expect punchy puns, outstanding one-liners and wizardry wordplay in this 3.3 laughs-per-minute bonanza. 'Annoyingly good' (Gary Delaney).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Aaaaaaaaaaargh! It's 101 Naughty Jokes in 30 Minutes",
    "presenter": "Masai Graham",
    "location": "Laughing Horse @ Dropkick Murphys",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAAAC_ABN.jpg",
    "description": "Award-winning gag-merchant and three-time Joke of the Fringe winner Masai Graham delivers over 100 naughty jokes in half an hour. Expect punchy puns, outstanding one-liners and wizardry wordplay in this 3.3 laughs-per-minute bonanza. 'Annoyingly good' (Gary Delaney).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Aaaaaaaaaaargh! It's the One Liner Show",
    "presenter": "Masai Graham",
    "location": "Laughing Horse @ Dropkick Murphys",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAAAA_ABN.jpg",
    "description": "Enjoy an hour of the best up-and-coming one-liner comedians on the circuit in this celebration of puns, one-liners and wordplay. Hosted by UK Pun Champion and Joke of the Fringe winner 2016, 2021 and 2022 Masai Graham. ; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Aaaah Look Who It Is: Jed Potts and Nicole Smit, Again!",
    "presenter": "Jed Potts and Nicole Cassandra Smit",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAAHLO_ZO.jpg",
    "description": "The King and Queen of Scottish blues are back with their tongue-in-cheek take on jazz, country and dreamy soundscapes. Jed and Nicole's banter will make you laugh and the songs will bring some tears, guaranteed. For fans of Patsy Cline, George Jones, Nina Simone and Patti Page.; Category: Music",
    "start": "Aug 13, 15 "
  },
  {
    "title": "Aaaand Now for Something Completely Improvised",
    "presenter": "Racing Minds",
    "location": "Assembly George Square Studios",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAAANDN_ADJ.jpg",
    "description": "Improv legends Racing Minds return to Edinburgh for their 11th year of unscripted escapades! A doddery grandfather can't quite remember his ripping yarn, but with your help, a mystery stuffed with hilarious characters, whip-smart wit and breathtaking twists will take hasty shape before your very eyes. Anything could happen, but excitement is guaranteed in this improvised comic adventure based entirely on audience suggestions! 'Clever, funny and satisfying' (SundayTimes). 'Crafted by the gods of comedy' ***** (ThreeWeeks). 'Insanely original' ***** (TheNewCurrent.co.uk). 'Improv at its very best' (BroadwayBaby.com). Suitable for all ages.; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "Aaalternative Comedy Club",
    "presenter": "Teknicolour Smoof / Free Festival",
    "location": "Laughing Horse @ Coco Boho",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAALTER_CUN.jpg",
    "description": "Teknicolour Smoof's alternative comedy club comes to the Edinburgh Fringe with five different comedians each day. Expect the weird and the bonkers but always something for everyone.; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "Aalex Mandel-Dallal: As She Lives and Breathes",
    "presenter": "Aalex Mandel-Dallal",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AALEXMA_2A.jpg",
    "description": "Here she is! Join Aalex, one of London’s most exciting comics, for tales of her pigeon enemies, self-mastering her shortcomings and giving advice nobody should take. Watch her ask, 'to kid, or not to kid, is that the question?' as she experienced the crazy scientific thing women in these times can do now: egg freezing. The very honest whys, hows and now whats? With dramatic tales of what went wrong thrown in. Be prepared to cross your legs and attempt to protect your ovaries, whether you have them or not.; Category: Comedy",
    "start": "Aug 14-25 "
  },
  {
    "title": "Aardvark Comedy with Dylan Clarke",
    "presenter": "Dylan Clarke",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AARDVAS_LH.jpg",
    "description": "Aardvark Comedy returns to the Edinburgh Fringe following a successful run in 2023. This mixed-bill comedy show contains some of the best new comedians on the scene and little to no aardvark-related content, but the show's creator insisted we aimed for the number one spot in the Fringe's alphabetically ordered programme. Unfortunately, the same creator failed to notice that numbers are prioritized over letters in the programme, an oversight which has caused the show to fall to the fourth page of the comedy listings, just sneaking in before a couple of Aarons.; Category: Comedy",
    "start": "Aug 16-19, 21-23, 25-26 "
  },
  {
    "title": "Aardvark Comedy with Dylan Clarke",
    "presenter": "Dylan Clarke",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AARDVAS_1U.jpg",
    "description": "Aardvark Comedy returns to the Edinburgh Fringe following a successful run in 2023. This mixed-bill comedy show contains some of the best new comedians on the scene and little to no aardvark-related content, but the show's creator insisted we aimed for the number one spot in the Fringe's alphabetically ordered programme. Unfortunately, the same creator failed to notice that numbers are prioritized over letters in the programme, an oversight which has caused the show to fall to the fourth page of the comedy listings, just sneaking in before a couple of Aarons.; Category: Comedy",
    "start": "Aug 20-25 "
  },
  {
    "title": "Aaron Chen: Funny Garden",
    "presenter": "AEG Presents",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AARONCH_PC.jpg",
    "description": "'Life is bristling with thorns, and I know no other remedy than to cultivate one's garden' (Voltaire). 'You're allowed to put whatever you like in your blurb. It doesn't even have to describe the show' (Aaron). Born and raised in Sydney, Aaron's quickly climbed the ranks of the international comedy scene. Aaron made his mark on Australian comedy with his debut solo show in 2017 and has since toured to sold-out crowds and rave reviews, earning him the sought-after awards for Best Newcomer and Director's Choice and nomination for Best Show at Melbourne International Comedy Festival.; Category: Comedy",
    "start": "Aug 11, 13-18, 20-25 "
  },
  {
    "title": "Aaron Hartnell-Booth Plays Mozart With the Glendal Quintet",
    "presenter": "The Glendal Quintet",
    "location": "Edinburgh New Town Church",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AARONHA_SE.jpg",
    "description": "Enjoy an evening of Clarinet Quintet music performed by the Glendal Quintet, a talented group of graduates of the Royal Conservatoire of Scotland. Aaron Hartnell-Booth, master of the clarinet and bass clarinet will play the wonderful quintet by Mozart, York Bowen's Phantasy Quintet (for bass clarinet) and premiere Nigel Don's Clarinet Quintet. He will be accompanied by Sophie Hamilton and Yik Liang Soo (violins), Aaron Morrison (viola) and Rebekah Lesan (cello).; Category: Music",
    "start": "Aug 14 "
  },
  {
    "title": "Aaron Levene: An ADHD Love Story (WIP)",
    "presenter": "Aaron Levene / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Carbon",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AAASHIN_BRC.jpg",
    "description": "Does everyone have ADHD? What's it like being married to a space cadet? Lots of asides are a sign of ADHD! 'Acidic wit' **** (Edinburgh Reporter). 'Didn't put a foot wrong. Adept, funny, very good' (NottsComedyReview.wordpress.com).; Category: Comedy",
    "start": "Aug 6, 8-13, 15-20, 22-24 "
  },
  {
    "title": "Aaron Twitchen: Himbo",
    "presenter": "RBM",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AARONTX_CEV.jpg",
    "description": "Dumped during his best friend's wedding, Aaron has decided to laugh it off. 'Hilarious, warm, energetic... Twitchen is a quadruple threat' (Skinny). After making poor choices himself, Aaron hands you control to choose the comedy topics you want. Expect jokes about dating disasters, pop-culture and geriatric millennials in this camp, energetic hour. 'Fierce, fresh and fabulous' (Alesha Dixon). From star of Channel 4's Dumped and host Top 20 Apple charting podcast Pod of the Pops. A show for anyone who has loved, lost or longed for a diamond the size of their fist.; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Aaron Wood: Chameleon",
    "presenter": "Aaron Wood",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AARONWP_CNJ.jpg",
    "description": "When you were younger you'd look at adults and think they had it all figured out. Now we're adults we realise none of us have a clue what we're doing. Wandering around pretending, trying to blend in and hoping nobody notices. Following a sold-out run in 2023, Aaron Wood is back and finally has it all figured out. Honest(!). Described as talent way beyond his time on the circuit and host of the Off Ya Chest podcast with over 100 million views online. 'A very big future in this business!' (Tom Stade). 'Absolutely brilliant' (Tim Vine).; Category: Comedy",
    "start": "Aug 6-12, 14-26 "
  },
  {
    "title": "ABBA Gold The Concert",
    "presenter": "Solid Gold ABBA",
    "location": "The Liquid Room",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABBAGOL_APH.jpg",
    "description": "Calling all Dancing Queens! Featuring an all-star cast of the UK's finest musicians and vocalists, ABBA Gold The Concert is packed with all of ABBA's greatest hits, stunningly authentic costumes, superb choreographed dance routines and a sprinkling of light-hearted humour which make this a show which is not to be missed. So dust down your platforms, put on your flares and sing along with all of your favourite ABBA hits including: Waterloo, Mamma Mia, Thank You For The Music, Take A Chance On Me, Dancing Queen, Winner Takes It All, Gimme, Gimme, Gimme... and many more!; Category: Music",
    "start": "Aug 16-18 "
  },
  {
    "title": "ABBA Odyssey – The Live Concert! ",
    "presenter": "ABBA Odyssey ",
    "location": "Greyfriars Hall at Virgin Hotels Edinburgh",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABBAODY_CNY.jpg",
    "description": "Come and see ABBA Odyssey – The Live Concert! This all-seated show features singers who produce the most authentic tribute to the iconic ABBA sound. With over 12 years of experience performing throughout the UK together, our Agnetha and Frida (Fran and Kat) have perfected their highly acclaimed vocal blend. ABBA Odyssey – The Live Concert! features all the hits that you know and love, plus a few hidden gems for the most devoted ABBA fans! Suitable for all ages.; Category: Music",
    "start": "Aug 24 "
  },
  {
    "title": "Abbi Cole and Ancika Mester: Shinpads",
    "presenter": "Abbi Cole and Ancika Mester / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Burrito ‘n’ Shake",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABBICOL_CHS.jpg",
    "description": "A split-bill stand-up hour from Abbi Cole (Hastings Newcomer of the Year finalist) and Ancika Mester (as heard on BBC Radio London). Ancika is sweaty, loosey-goosey and Australian. Abbi is a bit uptight, but still fun. Together they will give you a generous portion of the surreal and wacky. Both are Soho Theatre Comedy Labs Plus alumni, and part of Gigl Comedy/ 'Courageous, funny and refreshing' ***** (MumbleComedy.net).; Category: Comedy",
    "start": "Aug 6-12, 14-19, 21-25 "
  },
  {
    "title": "Abby Wambaugh: The First 3 Minutes of 17 Shows",
    "presenter": "Mick Perrin Worldwide",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABBYWAM_PE.jpg",
    "description": "Abby awoke in hospital after a late miscarriage and, high on anaesthesia, decided to become a comedian. In this silly, goofy, heartfelt show Abby presents her best 17 ideas for her highly anticipated debut hour, including potential hits like Old Man Learns Parkour and a very long impression of the number nine. Funny Women finalist and co-host of Help Hole podcast alongside Sofie Hagen. 'Reminiscent of Hannah Gadsby or Tig Notaro... Tackles what could be a thorny, complex subject with grace, underplayed charm and some great jokes' (Chortle.co.uk).; Category: Comedy",
    "start": "Aug 6-11, 13-26 "
  },
  {
    "title": "ABC of One-Liner Jokes",
    "presenter": "Kevin O'Brien / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Pilgrim",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABCOFON_2W.jpg",
    "description": "An hilarious one-hour alphabetical journey in the medium of quick fire One-Liner Jokes. The material is both insightful, clever and funny from one of the best emerging one-liner comics in the North of England.; Category: Comedy",
    "start": "Aug 11-18 "
  },
  {
    "title": "Abi Clarke: (Role) Model",
    "presenter": "Off The Kerb Productions",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABICLAR_P8.jpg",
    "description": "Abi Clarke lived the modern-day dream. She posted a video online, went to bed a \"nobody\", then woke to thousands of followers. Four years later, this is the debut show they've been waiting for, though it may not be exactly what they want from her... As seen on BBC, ITV2, Comedy Central, Channel 4 and support to Phil Wang and Russell Kane. With 2M followers across platforms, she's taken the internet by storm, but now it's time to see what she does best, stand-up! 'Fresh, silly and very very funny' (Sara Pascoe). 'Hilarious and relatable' (Independent).; Category: Comedy",
    "start": "Aug 7-9, 11, 13-25 "
  },
  {
    "title": "Abigail Rolling: Shit Lawyer",
    "presenter": "Abigail Rolling Comedy",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABIGAIL_CRO.jpg",
    "description": "Dark. Funny. Underfunded. And that's just Abby. The criminal justice system is too. With three decades on the front line, Abby shares hilarious real cases from her own experience as a practising defence solicitor, speaking to all that's wrong with a justice system in existential crisis. From the Post Office scandal to a one-woman shoplifting epidemic, Abby's new show warns that any one of us could get caught up in it at any time. But with the justice system in a death spiral, will there be any legal-aid defence lawyers left to help you?; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "About Comedy: Stand-Up Comedy Course",
    "presenter": "Laughing Horse Comedy ",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABOUTCO_BSB.jpg",
    "description": "Learn the skills and art of performing stand-up comedy on this two-day intensive comedy course. Including: joke-writing skills, generating material, comedy deconstruction, finding material, lively interactive performance practice sessions, history of comedy, technical skills, industry tips. Plus, a graduation show performance in a Fringe show. Our tutors are professional comedians, comedy writers and experienced teachers. The courses run over two days, with two four-and-a-half hour sessions on each day, followed by the graduation show. 'This course has to be one of the best on offer. Highly recommended' **** (ThreeWeeks). Further course information available at: http://www.laughinghorsecomedy.co.uk/comedy/courses2day.asp ; Category: Comedy",
    "start": "Aug 10, 13, 17 "
  },
  {
    "title": "Abracadabra Family Friendly Magic Show",
    "presenter": "Alex Kouvatas / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ CC Blooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABRACAD_ACM.jpg",
    "description": "Join Alex the Magician for an exciting children's magic show, back for its fourth year at the Edinburgh Fringe. Laughter, participation, fun, and of course, magic await! Witness the 'fantastic humour, charming presence and unique magic' (WorldMagicReview.com).; Category: Children's Shows",
    "start": "Aug 6-13 "
  },
  {
    "title": "Abrasion",
    "presenter": "End of the Pier Productions",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABRASIO_CRP.jpg",
    "description": "A one-woman show (written and starring Meg-Rose Dixon) following a diagnosis journey set at the anniversary of her surgery. A dark comedy filled with turbulent embarrassing moments flipped in a comical way, verbatim anecdotes highlighting the importance of patient care, terrible doctors, and a few genuine heroes. This is a darkly funny show that laughs in the face of pain while shedding light on a condition that affects 1.5 million people, but has an average diagnosis wait time of 7.5 years.; Category: Theatre",
    "start": "Aug 6-11, 13-26 "
  },
  {
    "title": "Abs Flab",
    "presenter": "Gill Cordiner",
    "location": "Laughing Horse @ 32 Below",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSFLAB_CEO.jpg",
    "description": "Abs Flab: Outrageous, raunchy and inappropriate. You're gonna pee in your pants laughing – come for the show, leave feeling uplifted and relieved. Gill's not your mum. Scottish comic Gill Cordiner returns to Edinburgh to rip up the stage which her high-octane wild comedy. Be warned – you will laugh till your face hurts! Relatable and ridiculous, Abs Flab is the show for everyone who hates the gym but loves cheese.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Absolute Chaos",
    "presenter": "Stuart Kennedy / Free Festival",
    "location": "Laughing Horse @ 32 Below",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSOLUU_CEO.jpg",
    "description": "The cult show returns! Think you can take down a comedian? Then come to Absolute Chaos – a comedy heckle show, where you the audience are given free reign to heckle comedians – just be prepared to get heckled right back. Not for the faint of heart: get plenty of liquid courage in you and do your worst! Top Shows of Edinburgh Fringe 2023 (Euronews.com).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Absolute Improv!",
    "presenter": "TBC Improv",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSOLUT_U8.jpg",
    "description": "For over 10 years Absolute Improv! has entertained sell-out audiences with off-the-cuff comedy performances from Scotland’s top improvisational comedy actors. For over 10 years audiences have suggested ideas to inspire side-splitting sketches created in the moment: truly you-had-to-be-there comedy created before the audience’s eyes. This Edinburgh Fringe, join us and the finest improv comedy talent in Scotland once more for spontaneously sparkling family-friendly performances that have never been seen before, and are never to be seen again! Official Fringe Sell-Out Show 2013-2017. ‘Absolute magic!’ ***** (Cream of the Fringe).; Category: Comedy",
    "start": "Aug 6-10, 12-24 "
  },
  {
    "title": "Absolute Monopoly",
    "presenter": "RBM Comedy",
    "location": "Assembly George Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSOLUX_AAZ.jpg",
    "description": "Monopoly is a terrible game. It ruins friendships and destroys families. Join comedian Benjamin Alborough as he attempts to improve Monopoly in this chaotic, interactive gameshow where audience members compete against each other and the host, with the audience physically becoming the game board. The show combines role playing, physical challenges and psychological intimidation to make something that, if not the best board game in the world, is at least short. ***** (EdFringeReview.com). ***** (ThreeWeeks). ***** (NorthWestEnd.co.uk) ****½ (One4Review.co.uk). **** (Chortle.co.uk). **** (TheRecs.co.uk). **** (BingeFringe.com).; Category: Comedy",
    "start": "Aug 7-11, 14-18, 21-25 "
  },
  {
    "title": "Absolute Nickhead (Kirk In Progress)",
    "presenter": "Nick Kirk / Free Festival",
    "location": "Laughing Horse @ Eastside",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSOLUW_CMW.jpg",
    "description": "Nick Kirk (West End New Act Finalist 2023) presents his first solo show featuring one man, no hair and a cast of supporting characters unpicking what life is like when you're hitting those awkward middle (age) years. '[The character of safety officer Dave Steed is] an amusing tragi-comic conceit and expertly performed with fine timing' (Chortle.co.uk); 'Stupendous stand-up... Nick Kirk has some fabulous material' (TheatreScotland.co.uk).; Category: Comedy",
    "start": "Aug 6, 8-13, 15-20, 22-25 "
  },
  {
    "title": "Absolutely (not) Free – An Evening of Zappa",
    "presenter": "Pygmy Twylyte",
    "location": "Bannermans",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSOLUV_BYK.jpg",
    "description": "A smorgasbord of Frank Zappa classics hand-delivered by those finest purveyors of conceptual continuity, Pygmy Twylyte! Expect pickles, poodles, dental floss, snowballs and stinky feet! Two nights only!; Category: Music",
    "start": "Aug 15-16 "
  },
  {
    "title": "Absurd: A Live Cabaret Panel Show",
    "presenter": "Ava Beaux and Kane & Abel / PBH’s Free Fringe",
    "location": "PBH's Free Fringe @ Whistlebinkies",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSURDA_B1.jpg",
    "description": "Fun, joyous, raucous… absurd! Join magicians Ava Beaux, Kane & Abel for a riotous evening of wacky games and cabaret performances. Watch playful performers battle to win, cheer on your favourite and even join in the revelry if you’re feeling absurd enough! Optional participation, different guest acts each night, party hats encouraged and an unnecessarily dramatic forfeit ceremony; it’s absurdity at its best! 'An upbeat romp through a wide variety of acts' **** (NorthWestEnd.com). 'Endlessly watchable performers.' **** (BroadwayBaby.com). 'Top Weekend Comedy Pick' (Times). 'Slick patter, a cleverly-worked persona' **** (List). ***** (WorldMagicReview.com).; Category: Cabaret and Variety",
    "start": "Aug 6-9, 11-16, 18-23, 25 "
  },
  {
    "title": "Aca-ballad of a Uni Student",
    "presenter": "Steelworks A Cappella",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACABALL_3S.jpg",
    "description": "Ever wondered what Pitch perfect would be like at a UK university? Come find out! In a flat full of chunder charts and impromptu musical numbers, follow Steelworks through the trials of uni life. Is anyone actually in room 3? Why does the hoover smell? Did those two sleep together? But… I digress… Established at the University of Sheffield (2017), Steelworks annually perform in the International Championship of Collegiate A Cappella. Following rave reviews of their Fringe debut (2023), Steelworks are back with charisma, stunning vocals, and a brand-new show you won’t want to miss!; Category: Music",
    "start": "Aug 19-24 "
  },
  {
    "title": "The Academy Trust: Under New Management!",
    "presenter": "Mode Theatre",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACADEMY_ZL.jpg",
    "description": "'Should I hand in my notice?' A question that resonates with every teacher, and Rachel is no exception. As a new trust takes over the school, bringing with it a slew of initiatives, quality assurance measures, and supposedly \"workload-friendly\" schemes, one thing remains constant: the perennially empty stationary cupboard. Join Rachel and her colleagues as they navigate the absurdities of bureaucracy, juggle newfound responsibilities, and grapple with the everyday chaos of teaching life. The Academy Trust is a comedic rollercoaster, blending sketch-show wit with political satire, all written and performed by teachers.; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "Accidental Baby",
    "presenter": "Alexander Cabana",
    "location": "Paradise in The Vault",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALEXANF_P3.jpg",
    "description": " Real-life dating, brimming with possibilities for passion, romance, or smashing a stranger in the back of your Toyota Camry while they moan a name you don't recognise. How does one navigate the whirlwind of dating and relationships in a world with AI and easy sex? Answer: with the help of comedians. Come to an amazing intimate show where you can receive dating advice from some of the funniest people at Fringe. Or, better yet, watch other people spill their tea as live comedians do their very best to help them out. They're not therapists, they're better: they're funny.; Category: Comedy",
    "start": "Aug 6-10 "
  },
  {
    "title": "Accidental Pop: Now That's What I Call Safety!",
    "presenter": "Ian Crawford",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACCIDEN_P2.jpg",
    "description": "Alright, stop, collaborate and listen! Safety expert Ian Crawford is back with a brand-new presentation. This deadly serious workshop delivers essential safety advice inspired by iconic pop hits. With tips to dodge Tragedy, the Danger Zone and ensure you keep Stayin’ Alive. Don't Stop Believin' in avoiding hazards: just take your passion and make it happen. Grab your Ticket to Safety before it is too late. ‘Well-honed, good silly fun’ **** (TheReviewsHub.com) and ‘forking good’ **** (TheWeeReview.com).; Category: Comedy",
    "start": "Aug 12-17 "
  },
  {
    "title": "Accidentally on Purpose",
    "presenter": "Cal State Fullerton",
    "location": "theSpace @ Venue45",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACCIDEO_VN.jpg",
    "description": "Want to know who murdered my theatre company? Me. Seduction? Check. Betrayal? Check. No checks? Check. The desire for the femme fatale and inclusive ambitions? All of that. I killed it. And I'm going to tell you how. Members of a fledgling theatre company, Studio 212, set out to devise a theatre piece based on the great film noir, Double Indemnity. Will the inclination to change the world through art cause irreparable damage to the very artists who are making it?; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 6-7 "
  },
  {
    "title": "Accommo-dating",
    "presenter": "Selerto",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACCOMMO_CEM.jpg",
    "description": "One birthday. Three housemates. A whole lot of surprises. Mollie, Phoebe and Skye have been inseparable since they met at university. Living together presents all sort of joys and trials, and tonight is no different: it’s Phoebe's birthday, and they’re hosting a dinner. Things are about to be shaken up by something they never expected to have in common, and, with the arrival of their guest, the girls find themselves forced to confront their attitudes towards dating, relationships and each other head-on.; Category: Theatre",
    "start": "Aug 12-17 "
  },
  {
    "title": "Accordion Ryan's Pop Bangers",
    "presenter": "Accordion Ryan / Free Festival",
    "location": "Laughing Horse @ 32 Below",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACCORDI_CEO.jpg",
    "description": "Covering artists from across the pop music spectrum, Accordion Ryan will sing and play your favourite songs like you've never heard them before! Add in a few of his own hilarious tunes and this show is guaranteed to bring a smile to your face. Fresh off an appearance on Britain's Got Talent and a hit run at the 2023 Edinburgh Fringe, he's excited to be back this year! Join in and sing along during this night of music, laughter and overall fun! 'You're funny, I like you' (Simon Cowell). 'Just brilliant…go see him!' (Gary: Tank Commander).; Category: Cabaret and Variety",
    "start": "Aug 6, 8-13, 15-20, 22-25 "
  },
  {
    "title": "The Accused",
    "presenter": "Inner Temple Drama Society",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACCUSED_BSI.jpg",
    "description": "Guilty or not guilty? You decide! From the sell-out production team of the Inner Temple Drama Society comes a story of anger, revenge, love and secrecy. After a superstar is found dead in her dressing room all fingers point to Daniel… but did he kill her? That’s the question on everyone’s lips but only the jury will decide. Join the Inner Temple Drama Society for this interactive show which follows a murder trial. Whilst serious, you can expect a few dance and drag appearances. We promise you will not have seen anything quite like it.; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "Achilles, Death of the Gods.",
    "presenter": "Jo Kelen",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACHILLE_BRO.jpg",
    "description": "A new, bold, poetic reimagining of the myth of Achilles, from storyteller and classicist Jo Kelen. The warrior Achilles finds himself in Troy, fighting a war that is not his. Following a bloody and tragic sequence of events, Achilles’ lover Patroclus is killed in battle. Achilles, enveloped in an insatiable rage and desire for retribution, inflicts unspeakable horrors upon those around him. Content Warnings: Explicit reference to violence, sexual violence and mutilation of the body.; Category: Spoken Word",
    "start": "Aug 6-10, 12-17, 19-25 "
  },
  {
    "title": "Achtung!! The Germans Are Coming! Second Coming",
    "presenter": "Jürgen Strack / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Brewdog Doghouse Hotel",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACHTUNG_CHQ.jpg",
    "description": "Wacky German jokemeister Jürgen's comedy collision is back for a second helping of schnitzel schwitzen! Along with comedy friends and pros! Following a successful Edinburgh Festival Fringe and a sold-out Leicester Comedy Festival, this show is wunder-bar! (Great pub in Düsseldorf, that). 'Very funny, memorable comedian' (The Stand Comedy Club). 'What a hurricane' (Robin Ince). 'A funny guy' (Mike McShane). 'Brilliantly mad' (Mike Gunn). 'Spike Milligan-esque' (Logan Murray).; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  }
]