[
  {
    "title": "Orchestre à Six Mains – Three Pianists, Six Hands, One Piano",
    "presenter": "Candle Concerts",
    "location": "St Vincent's",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ORCHESU_AMT.jpg",
    "description": "Hear our innovative piano orchestra perform finger-gymnastics music for three pianists playing one piano together. 'Artistic Director Matthew Shiel shone' (ThisWeekCulture.com). Orchestre á Six Mains is a unique and creative piano ensemble which celebrates the rarely performed music for one piano, six hands – or three pianists at one piano – creating the powerful impression of a piano orchestra. Tonight’s programme includes a Romance by Rachmaninoff, an African boat-song by Percy Grainger, a medley of Scottish folk songs and a special performance of Sousa’s all-American Stars and Stripes Forever.; Category: Music",
    "start": "Aug 17, 24 "
  },
  {
    "title": "Savoy! Everybody's Doing It",
    "presenter": "NP and Joy Entertainment",
    "location": "C ARTS | C venues | C aquila",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SAVOYEV_JM.jpg",
    "description": "Get ready for blushful stories of passionate affairs, mischievous gossip and racy romances. This vigorous and unapologetic new musical relationship comedy tears the illusion of modern marriage to pieces through its uplifting collection of world-famous operetta songs staged with a brave contemporary twist. The musical line-up includes songs from pre-World War West End and Broadway hit operettas Ball at the Savoy, Riviera Girl and more. Eastern European cultural heritage meets Western contemporary musical theatre in this cabaret-style interactive show by Julia Joy.; Category: Musicals and Opera",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "ScotlandsFest: Forth Bridge Stories – Barbara Henderson",
    "presenter": "Barbara Henderson",
    "location": "St Columba's by the Castle Scottish Episcopal Church",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SCOTLAJ_CRG.jpg",
    "description": "The iconic red railway bridge has spanned the Forth since 1890. Think you know the Forth Bridge? Think again! Its inaugural writer-in-residence, award-winning author Barbara Henderson, takes us behind the scenes at the much-loved structure with surprising stories of enthusiasts, professionals, residents, researchers, souvenir sellers, lifesavers, train drivers, writers, lovebirds and volunteers. Don’t miss the chance to hear of narrow escapes, crazy capers, secrets and storms as featured in Our Forth Bridge: Made from Girders. ; Category: Spoken Word",
    "start": "Aug 12 "
  },
  {
    "title": "Only Bones v1.9",
    "presenter": "Matt Pasquet – Kallo Collective",
    "location": "ZOO Playground",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ONLYBON_BRL.jpg",
    "description": "A journey of evolution, from birth to consciousness. Follow the struggle through a maze of shapeshifting surroundings to the edge and beyond. With an immersive foley soundscape, a dash of acrobatics, a sprinkle of clown and a fist full of kung fu.; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 6-10 "
  },
  {
    "title": "Acting for Film Workshop",
    "presenter": "Acting Workshop by The American Musical and Dramatic Academy",
    "location": "Dovecot Studios",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ACTINGF_CSF.jpg",
    "description": "Workshop participants will learn the skills required to create and deliver their own content – with a focus on delivering and directing professional on-camera acting performances. After learning techniques and exercises aimed at relaxing, concentrating and preparing the actor, workshop participants will learn the fundamentals of on-camera acting techniques. Through the use of a cinema camera and a television, participants will have the opportunity to view on-camera performances live.; Category: Events",
    "start": "Aug 15 "
  },
  {
    "title": "Cyclopath – Stand-Up and Songs",
    "presenter": "Dion Owen",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CYCLOPA_U7.jpg",
    "description": "'Dion Owen is undoubtedly a comedian on the cusp of greatness' (National Post). A show honed from years of professional touring. Featuring a mix of polished jokes, cycling propaganda and improvised keyboard songs. Canadian comedian and cycling advocate Dion Owen returns for his fifth Fringe!; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Comedy Cluedo",
    "presenter": "Lucy Henderson",
    "location": "Laughing Horse @ Eastside",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024COMEDYE_CKC.jpg",
    "description": "Lucy Henderson has been murdered. But by whom? And with what weapon? In which room? In this five-star show audiences are guided through Lucy's personal version of classic murder-mystery game, Cluedo, to uncover the clues and jokes to solve the crime. Created by the Winner of Powerbomb Comedy's 2022 Joke Off Competition, this show's a strong contender for the Fringe's highest rate of LPMs (Laughs Per Minute) and guaranteed highest CPMs (Clues Per Minute). On the back of sold-out shows at Perth, Adelaide and Sydney Fringe Festivals, TheatreTravels.org confirms this hour with Lucy makes 'a fun night out'.; Category: Comedy",
    "start": "Aug 12-25 "
  },
  {
    "title": "Passing Likeness CANCELLED",
    "presenter": "Ash Caton and Company",
    "location": "Virgin Hotels Roof Terrace",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PASSING_CRU.jpg",
    "description": "Step back into the Edinburgh of the eighteenth century! Passing Likeness is a new verse drama by local writer Ash Caton. It tells the story of the life and times of John Kay: a self taught caricaturist living and working in the heart of Enlightenment Edinburgh. Through Kay and his portraits, you will meet a host of famous and infamous residents of the capital, witnessing some of the Golden Age's accomplishments, scandals and aeronautical disasters. A historical satire championing one of Edinburgh's unsung artists, this is a play of grotesque caricatures and still more grotesque originals.; Category: Theatre",
    "start": ""
  },
  {
    "title": "Magical Bones: Bonefide Magic",
    "presenter": "Broken Robot Productions",
    "location": "Underbelly, Bristo Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MAGICAL_APJ.jpg",
    "description": "Following his nationwide tour, the Britain's Got Talent and ITV's The Ultimate Magician finalist hits Edinburgh with a limited Fringe run in a show full of the most awe-inspiring and high-energy magic you'll see this year. Direct from appearances on America's Penn & Teller: Fool Us, BBC One's BAFTA Awards, ITV1's This Morning and Sky's Around The World in 80 Tricks. 'A dazzling show... full of imagination and flair' **** (Guardian). 'What's happening on stage really is magic' (Telegraph). 'A spellbinding show that leaves the audience gasping in disbelief' **** (TheWeeReview.com).; Category: Cabaret and Variety",
    "start": "Aug 6-11 "
  },
  {
    "title": "Macbeth for Bairns",
    "presenter": "Little Supernovas",
    "location": "Scottish Storytelling Centre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MACBETJ_AAR.jpg",
    "description": "Join award-winning storyteller Brooke Dunbar for an immersive, sensory, theatrical version of Macbeth complete with bubbles. A whimsical and comical adaptation of the Bard for bairns aged 0-4 years. Bring your brollies! Little Supernovas stories include music, and props that stimulate the senses to create a magical experience, especially for your baby and toddler.; Category: Children's Shows",
    "start": "Aug 17-19 "
  },
  {
    "title": "Fool's Paradise – A Comedy of Cross-Continental Courting, Clowns and Catastrophes",
    "presenter": "FRANK. Theatre / Richard Jordan Productions, in association with Pleasance",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FOOLSPA_ACF.jpg",
    "description": "Fest Magazine Top Theatre Picks 2024! Winner: 2024 Adelaide Fringe Award. You’re cordially invited to the wedding of the year! Whether you're a fan of Amelie or When Harry Met Sally 'you’ll be laughing, throwing confetti, and tapping your toes to this clever, fun performance' **** (FringeFeed.com.au). Rising-star Britt Plummer's bittersweet long-distance love story’s a 'delectable and thought provoking' **** (Edinburgh Festivals Magazine), heartbreakingly hilarious show which fuses storytelling, puppetry, and clowning into a modern-day fringe rom-com. 'May do for hand sanitisers what Ghost did for pottery' **** (Eventalaide.com).; Category: Theatre",
    "start": "Aug 6, 8-13, 15-20, 22-25 "
  },
  {
    "title": "Thinking Drinkers: The Booze-ical",
    "presenter": "Gag Reflex in association with Long Road Talent",
    "location": "Underbelly, Bristo Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024THINKIN_AWB.jpg",
    "description": "Following last year's sell-out Edinburgh run, the self-styled hardest-working beefcakes in alcohol-based infotainment are back... with a brand-new musical extravaganza complete with five free drinks for every audience member! Sip back and marvel as the award-winning drinks experts embark on an all-singing, all-dancing musical mission to prove that the pub, and indeed alcohol, are cornerstones of civilisation. Accompanied by talented West-End singers Flat and the Curves, Ben and Tom raise a glass to a heady, hilarious cocktail of historical characters in the greatest, most intoxicating, lock-in of your life. 'Pioneers of alcohol-based comedy' (Times).; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "A Celebration of Father Ted",
    "presenter": "Joe Rooney",
    "location": "Le Monde",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CELEBRA_CLJ.jpg",
    "description": "A Celebration of Father Ted is an homage to the 90s sitcom involving music, stand-up, video, slides and audience participation hosted by the comedian/actor who played Father Damo. A huge hit with Edinburgh audiences in 2021, this new updated show has been selling out in theatres all over the UK. There's Lovely Girls and Dancing Priests and you might even win a whistle. 'His act rolls along smoothly and nothing felt forced… great stand-up, excellent storytelling and full of gags' (Chortle.co.uk).; Category: Comedy",
    "start": "Aug 18-25 "
  },
  {
    "title": "Diary of a Gay Disaster",
    "presenter": "Upfront Theatre",
    "location": "Underbelly, Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DIARYOF_UA.jpg",
    "description": "Ellis wakes up in a turbulent fever dream created by the Gods of Sapphic Desire. Mia and Finlay, self-proclaimed expert angel dykes, say she's expected to \"reflect\" on her life or some crap like that. One magic diary and twelve comical tunes later, these three hot queers learn something important: being a disaster is not a unique talent, it's just embarrassing. Oh well, at least there are sexy togas! Don't miss the debut of this new musical comedy show, featuring a disconcerting amount of oversharing despite the fact that literally nobody asked.; Category: Musicals and Opera",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "AI:rish",
    "presenter": "Eddie Mullarkey",
    "location": "Laughing Horse @ The Hanover Tap",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CHATGPT_BBE.jpg",
    "description": "Eddie Mullarkey's latest show blends observational stand-up, crowd interaction, and AI tech, all infused with some ancient Irish wisdom. Amidst battling obsolescence, Eddie crafts a hilarious journey with live tunes, musings on heartbreak and hipster musicians. Expect to be part of the fun! 'Mullarkey certainly knows how to work a crowd' (ThreeWeeks). 'The skill of an old pro' (The Student).; Category: Comedy",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "RUM by Joe Mallalieu",
    "presenter": "Max Emmerson Productions",
    "location": "Underbelly, Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024RUMBYJO_UC.jpg",
    "description": "'Why would anyone work in an office. In a suit, stuck in a cubicle. We shit in buckets and for some reason that makes us freer than them. It just does'. Meet Danny, plastering since he was a kid, not scared of anything, he's RUM. Danny's been up all night and now he's rushing to finish a job before he gives the speech of his life. RUM is the raw one-man play that wrestles masculinity, mental health and addiction in the trade. 'A play of rare truth, raw humour and real force' (Simon Stephens).; Category: Theatre",
    "start": "Aug 17-25 "
  },
  {
    "title": "ALOK",
    "presenter": "AEG Presents in association with Underbelly",
    "location": "Underbelly, Bristo Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALOK_AWB.jpg",
    "description": "Flippant and fabulous. Wicked sharp and delightfully silly. Gender non-conforming and genre non-conforming. Internationally acclaimed comedian ALOK makes a triumphant return to the Fringe with their new stand-up show after a sold-out run at the Traverse Theater in 2022 which was described as 'provocative and powerful' (Chortle.co.uk) and a 'jaw-dropping celestial event' (ToDoList.org.uk). Fresh from their appearance on Hannah Gadsby’s Gender Agenda comedy special on Netflix and headlining the Netflix is a Joke Festival, ALOK delivers a crash course on love, gender, and the awkward choreography of being human.; Category: Comedy",
    "start": "Aug 13-25 "
  },
  {
    "title": "EIFF: Armand",
    "presenter": "Halfdan Ullmann Tøndel",
    "location": "EIFF @ 50 George Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EIFFARM_CUT.jpg",
    "description": "A tightly wound and exhilarating drama that examines the assumptions that adults make whilst trying to uncover the truth. When Elisabeth is called in to her sons’ school, she is shocked to discover that he has been accused of crossing boundaries with one of his classmates. Renate Reinsve (The Worst Person in the World) leads an ensemble cast in this claustrophobic chamber piece that won the Camera D'Or in Cannes. Cert: 15.; Category: Events",
    "start": "Aug 20 "
  },
  {
    "title": "Spy Movie: The Play!",
    "presenter": "A Cabbage Presents",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SPYMOVI_P8.jpg",
    "description": "Agent Blonde has 24 hours to save the world. The only things standing in her way are dastardly villains, an outrageous plot, and... a lack of funding. When Hollywood rejects her script, a frustrated screenwriter invites you, an audience of producers, to a one-night-only presentation of The Greatest Spy Movie (n)Ever Made! From two of the minds behind The New Musketeers (Trinity Theatre) and stars of The Play That Goes Wrong and Peter Pan Goes Wrong, Spy Movie: The Play! is a new hilarious homage to Bond movies and fringe theatre suitable for the whole family.; Category: Theatre",
    "start": "Aug 7-12, 14-19, 21-26 "
  },
  {
    "title": "Kids Can Heckle!",
    "presenter": "RGB Monster",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KIDSCAN_1U.jpg",
    "description": "Fun for the whole family, but especially fun for the little ones! Top UK stand-up Ollie Horn – 'Ollie Horn is a gifted storyteller' (TheWeeReview.com) – attempts to tell the same clean stand-up that he does around the world. The only thing that can stop him is the imagination of your kids, who at any point are allowed, no, encouraged to jump in and be as silly as possible! Weekly award winner, Perth Fringe World 2024: Best Kids Show. 'The perfect way to introduce your kids to the world of stand-up' **** (KidsInAdelaide.com.au).; Category: Children's Shows",
    "start": "Aug 5 "
  },
  {
    "title": "Paradok Platform: The Dink Rodgers Show",
    "presenter": "Paradok Platform",
    "location": "Just the Tonic at The Caves",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PARADOL_JC.jpg",
    "description": "Dink Rodgers has won two Emmys, three Grammys and 84 Oscars. That's right, he's an actor with an EGO! Join us for an unforgettable evening traversing the length and breadth of his illustrious career. Featuring interviews, sketches, songs and more! It's a sketch show framed as a retrospective look at the career of Dink Rodgers, one of the world's most celebrated artistes. A man who thinks humility is when there's a lot of moisture in the air, he's ruffled a few feathers. Now it looks like his chickens are coming home to roost...; Category: Theatre",
    "start": "Aug 6-9 "
  },
  {
    "title": "VEGAS",
    "presenter": "Cambridge University Amateur Dramatic Club",
    "location": "theSpace @ Venue45",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024VEGAS_VN.jpg",
    "description": "Good Kentish girl Poppy wakes to find herself naked next to her ex, who isn't really her ex, Scouser Freddie. Struggling to piece together the night before, they gradually reach the horrifying revelation that they are married. Sounds pretty rock'n'roll, right? But this isn't Vegas, this is a BnB in Slough. Stuck together in the honeymoon suite, Poppy and Freddie are forced to confront what once went wrong and, crucially, decide whether to get an annulment. Oh, and they have an hour until they need to check out. What happens next? You'll have to wait and see...; Category: Theatre",
    "start": "Aug 12-17, 19-24 "
  },
  {
    "title": "Ulysses in Babel",
    "presenter": "Vivian Allvin (Brazil/Italy/USA)",
    "location": "C ARTS | C venues | C alto",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ULYSSES_CSM.jpg",
    "description": "How We Sound. Who We Are. What We Have to Say. The journey is inspired by the myth of Ulysses, suspended between heaven and hell, sentenced here to the Tower of Babel. Different accents and languages - what a feast for the ear and mind! And in Britain, they carry extra baggage: Class! So how can a foreigner resist the temptation to have a go? From the \"upper-class twit\" to the quintessentially English head-tilt, a bit of socially acceptable (and only vaguely Marxist) swearing and fun will be had by all! Come get lost in translation!; Category: Theatre",
    "start": "Aug 12-18 "
  },
  {
    "title": "10 Songs for Geeks – Jollyboat",
    "presenter": "Jollyboat / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Liquid Room Annexe/Warehouse",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JOLLYBO_AJG.jpg",
    "description": "Fringe legends Jollyboat bring their best comedy songs from 14 years of touring and sold-out Fringe shows. Catchy tunes, witty lyrics and high-energy fun from start to finish. Help us celebrate the things that make us laugh, and find out why so many people return year after year! ***** (BroadwayBaby.com). ***** (GeekChocolate.co.uk). ***** (InformedEdinburgh.co.uk).; Category: Comedy",
    "start": "Aug 6-24 "
  },
  {
    "title": "Panoramas: The World in 360°",
    "presenter": "Heritage Collections",
    "location": "University of Edinburgh Main Library",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PANORAM_AGG.jpg",
    "description": "Two hundred years ago the first virtual-reality experiences were born in Edinburgh, not from digital technologies, but from the mastery of painted perspective, the control of space and light and an understanding of the psychology of human perception. Robert Barker’s Panorama rotunda in London’s Leicester Square created a sensation in the early 1790s. This exhibition explores the panorama’s history and gives you a chance to taste the experience of its very first visitors.; Category: Exhibitions",
    "start": "Aug 6-26 "
  },
  {
    "title": "Rahul Somia: Wifey Material",
    "presenter": "Rahul Somia",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/",
    "description": "A work-in-progress show on how secondary school teacher, Rahul, navigates the cultural and personal pressures of finding love.; Category: Comedy",
    "start": "Aug 6-26 "
  },
  {
    "title": "Ope!",
    "presenter": "Ope!",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024OPE_CEM.jpg",
    "description": "Ope! is a long form improv team based in Los Angeles. With a style that can only be described as fast, loud and funny, from a single suggestion Ope improvises a world filled with characters, relationships, compromising situations and a whole lot of laughter. With performers from SNL, HBO, STARZ, Fringe, Second City, UCB and more! We can't tell you what to expect, every show is one-of-a-kind, unpredictable and hilarious 'cuz it's improvised, baby!; Category: Comedy",
    "start": "Aug 19-24 "
  },
  {
    "title": "Mad Ron and Jerry",
    "presenter": "Mad Ron",
    "location": "Assembly Roxy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MADRON_CQU.jpg",
    "description": "Join Mad Ron (Reginald D Hunter tour support) and Jerry Bakewell (as seen on Britain's Got Talent) for a madcap hour of surreal game show and stand-up entertainment.; Category: Comedy",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "Driving Towards the Rain / Ajaen kohti sadetta",
    "presenter": "Passport Theatre Company",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DRIVING_U8.jpg",
    "description": "Driving Towards the Rain / Ajaen kohti sadetta is a Finnish/English physical and verbal encounter that breathes through Adrian Goldman’s poetry over the last 22 years. The organic piece is built from the subconscious meanings and vulnerability of life, which continues to evolve in time. With time. The audience is invited to dive deep into the very moment – and to embody and embrace how it feels to meet someone (yourself?/sinua itse?) you haven’t seen for a long, long time.; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 6-10 "
  },
  {
    "title": "2 and a Half Women",
    "presenter": "Mari Volar, Ann Vaida, Annick Adelle",
    "location": "Laughing Horse @ Home Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242ANDAHA_BCN.jpg",
    "description": "Three queer international comedians (Ann Vaida, Annick Adelle and Mari Volar) bring their WIP shows to Edinburgh and band together to make their solo debuts less harrowing. Mari Volar is presenting the world with a feminist manifesto for all aspiring trophy wives. Ann Vaida invites you along to exist in a completely arbitrary sh*tstorm of a society, and other jokes. Annick Adelle offers the world stand-up shows where true magic unfolds. A show made up of three comedians. One will show up to your show. These really are some of the best odds in showbusiness.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "William Kite Has Memory Issues",
    "presenter": "dottyb / Robot Parrot Productions",
    "location": "Paradise in The Vault",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WILLIAO_P3.jpg",
    "description": "Though dementia is increasingly common in an ageing population, it remains an unknown quantity to many. This drama, based on the writer’s experience of seeking support for someone with early-onset Alzheimer's, features the frustrations and difficulties encountered on the journey from initial symptoms to eventual diagnosis. It explores gentle William’s interactions with interested parties – GP, fraudster, social worker, etc – as he faces his changing reality. The play aims to provide an entertaining, thought-provoking, occasionally humorous audience experience in its depiction of the impact of encroaching dementia on an intelligent, independent individual.; Category: Theatre",
    "start": "Aug 12-17 "
  },
  {
    "title": "I Am Yours Sincerely",
    "presenter": "Ed Saunders-Lee",
    "location": "theSpaceTriplex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IAMYOUR_AMQ.jpg",
    "description": "I Am Yours Sincerely is the true, untold story of John Cox, a member of the Special Operations Executive during the Second World War. This play goes through his life, from university student to soldier to spy. This year marks the 80th anniversary of his first mission parachuting into France. John Cox is also Ed’s step-grandfather and after hearing his story was moved to create this solo show.; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "Chopped Liver and Unions",
    "presenter": "Blue Fire Theatre Company",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CHOPPED_P2.jpg",
    "description": "Sara Wesker – trade unionist, political activist and radical – led the singing strikers of 1928, to improve the working conditions of female garment workers in London’s East End. But her love of the cause battled with the love of her life. Which would win? And was it all worth it? A tale from a century ago but very much a play for today, this five-star reviewed, OffFest-nominated, one-woman play gives a vivid account of the life of a forgotten woman who should be revered as a working-class heroine. ; Category: Theatre",
    "start": "Aug 6-10, 12-17, 19-24 "
  },
  {
    "title": "Ripper",
    "presenter": "Reconnect Theatres",
    "location": "Hill Street Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024RIPPES_BMC.jpg",
    "description": "A terrifying musical look through the eyes of Jack the Ripper, the officer who pursued him, and one of his victims. Returning as a now full-length show after last years Fringe premiere, come see life behind the knife and experience the must-see, edge-of-your-seat, 10/10 sensation that is Pete Sneddon's Ripper.; Category: Musicals and Opera",
    "start": "Aug 6-25 "
  },
  {
    "title": "F**king Legend",
    "presenter": "Olly Hawes",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FKINGLE_ACF.jpg",
    "description": "A show about socks and sex and loving someone even though they're quite annoying, and buying tat on holiday, and fear of death, and cognitive dissonance, and whether or not it's an issue that you're watching the world burn and all you can do is try to find meaning in the dancing of the flames, and also is it even possible to be a good man? Olly returns to the Fringe with a one-man, rollercoaster show that cuts to the core of modern masculinity. 'A performer sure to find greatness' (AYoungerTheatre.com).; Category: Theatre",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Hot Concrete: Too Hot (and Too Concretey) for TV",
    "presenter": "Hot Concrete",
    "location": "Just the Tonic at The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HOTCOND_ACJ.jpg",
    "description": "Join the UK's most energetic-yet-simultaneously-downbeat double act as they record the pilot for their groundbreaking TV chat show. Do they have what it takes to impress Big Telly and bag a series? From Henry Whaley (BBC New Comedy Awards 2021; Chortle Student Comedy Awards 2022) and Charlie Billingham (Frosties Water Skills Level 2 2003). Expect 'witty smart but dumb' jokes (Chortle), 'exceptionally written material' (Theatre Weekly) and 'above average backstroke for his year group' (Charlie's swimming coach). As seen / heard on BBC One, Sky Arts, BBC Radio 4.; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "Sleepover",
    "presenter": "Modge Podge Plays",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SLEEPOV_CPY.jpg",
    "description": "You’re invited to the sleepover! Won’t you join us? Through the eyes of our 12-year-old protagonists, we teeter between childhood make-believe and stone-cold adult reality. The girls aren’t quite willing to believe in the games they play anymore, but they’re still playing them. And you, too, might start to doubt what you know about growing up and all its gruesome glory. Is someone really flying onstage? Or is it all in their head? Who’s cool? Who’s scared? In this sweet, sparkly, and wild new play, the girls are in charge (finally). What could go wrong?; Category: Theatre",
    "start": "Aug 6-10, 12-17, 19-24 "
  },
  {
    "title": "Dreams of Life and Love: A Take Note Concert",
    "presenter": "Take Note Edinburgh Choir",
    "location": "artSpace@StMarks",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LIFEINS_AAQ.jpg",
    "description": "Take Note Choir returns to the Fringe for a second year with a performance celebrating life, love, dreams and fantasies. With beautiful arrangements conducted by award-winning musician Callum Hüseyin, this concert showcases an eclectic repertoire with life-affirming songs spanning the globe, from the worlds of pop, classical, musicals and film.; Category: Music",
    "start": "Aug 5 "
  },
  {
    "title": "Escher's Children",
    "presenter": "Green Carnation Productions",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ESCHERS_CPW.jpg",
    "description": "Paradox becomes reality in this suspenseful journey tracking philosophy, art and David Bowie. Escher's Children follows an art critic, a stockbroker and an electrician as they straddle 1972 and the modern day, searching for fame, fortune and destiny.; Category: Theatre",
    "start": "Aug 12-17 "
  },
  {
    "title": "Rat House",
    "presenter": "Aireborne Theatre",
    "location": "theSpace @ Symposium Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024RATHOUS_CES.jpg",
    "description": "Welcome to Hackton! Cyclists can’t get to Hackton library, literacy rates are dropping, cyclists can barely name a single book, library membership is dwindling and Hackton council have to do something about it! Old grudges resurface as two departments work together to save the library. Time is running out as they have to convince you, the citizens of Hackton, to vote for the right solution. Following a sell-out run of Stuck in the Mud last year, Evie Cowen returns to Fringe with a brand-new, quick-witted comedy exploring cycle paths, libraries, chess, the PTA and lots of yoga!; Category: Theatre",
    "start": "Aug 14-24 "
  },
  {
    "title": "Conspiracy",
    "presenter": "RFT / Strawmoddie",
    "location": "Hill Street Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CONSPIR_BMB.jpg",
    "description": "Berlin, January 1942. Fifteen senior officials are summoned to a conference at a sumptuous villa in leafy, lakeside Wannsee. In 90 minutes the obscene horror of the Holocaust will be unleashed and the fate of over six million human souls will be decided. Strawmoddie and RFT return to the Fringe with a remount of their 2018 sell-out production of Mandel’s theatrical adaptation of his Emmy-winning HBO script. Based on surviving minutes of the conference, Conspiracy is a work whose relevance remains unquestioned. A unique portrait of mankind’s darkest hour made all the more hideous for its breathtaking banality.; Category: Theatre",
    "start": "Aug 16-25 "
  },
  {
    "title": "Anti-Heroine",
    "presenter": "Downstairs Productions",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ANTIHER_CPY.jpg",
    "description": "Join Anti-Heroine through several encounters with Manchester's night-life and dating scene as she teeters on the edge of adulthood. Written by Pip Carew and directed by Em Bunch, this one-woman show is making its debut at Edinburgh Festival Fringe with Downstairs Productions. Anti-Heroine, starring Lottie Burgess, is a love letter to female friendship and bathroom stalls. Over a few nights, a spunky but directionless young woman navigates the perils of online dating, her fractured relationship with her mother and trying to have some self-respect with no income. At least she's not in love with… oh, wait.; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "Jin Hao Li: Swimming in a Submarine",
    "presenter": "IAM",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JINHAOL_PF.jpg",
    "description": "In his debut hour, Jin Hao walks you through the seascape of his mind, filled with nightmares of being a spider, dreams of joining the yakuza and breezy memories of serving in the military with the boys. Confronting fear with mischief and imagination, he surprises with gritty softness, honest lies and pockets of joy. BBC New Comedy Awards and Chortle Student finalist. Tour support for Celya AB, Olga Koch, and Tom Stade. Pleasance Comedy Reserve 2023.; Category: Comedy",
    "start": ""
  },
  {
    "title": "Hot Ghoul Summer",
    "presenter": "Anitha Sri, Katie Kamola / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Canons' Gait",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HOTGHOU_CZ1.jpg",
    "description": "The hottest stand-up duo of the season! Anitha Sri (Bath New Act of the Year Finalist, Leicester Square Quarter-Finalist, Funny Women Quarter-Finalist) and Katie Kamola (Bath New Act of the Year Semi-Finalist 2023 and 2024, Jaguar Comedy, Poster Comedy – 'The Best Comedy Clubs in London' (Londonist.com)) present an hour of wickedly dark humour.; Category: Comedy",
    "start": "Aug 6-10 "
  },
  {
    "title": "It's a Sheet Show",
    "presenter": "Fools and Thieves Theatre Company",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ITSASHE_CEN.jpg",
    "description": "Two people, one bed and no connection. He's lost. She's pretending. Old enough to make the right decisions. Young enough to make the wrong ones. Yet they both keep ending up back in the same place. A story of boredom, crumbs, missed opportunities, box sets, pyjama sets, bad sex, concepts and crushing. Love? Through the lens of a bed it explores two people coming together only to fall apart. Being in your twenties is fun, but most of the time it's just a bit of a sh**t show.; Category: Theatre",
    "start": "Aug 6-10, 12-17 "
  },
  {
    "title": "How I Learned to Swim",
    "presenter": "Rebecca Prentice Productions in Association with Brixton House",
    "location": "ROUNDABOUT @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HOWILEA_CFO.jpg",
    "description": "Jamie can’t swim. Bit awkward when you’re 30. Fuelled by guilt and a need to mend her broken family, Jamie is taking on her biggest fear, the ocean. With the help of a chipper swim instructor, a shady spiritual guide and one cathartic crab sandwich, she’s questioning, ‘how many lengths does it take to wash away regret?’ Brilliantly witty, deeply heartfelt, this play explores what lies beneath the surface of Black people’s relationship to water. Somebody Jones’ searing debut is 'funny with fear, liberating with grief' (FringeReview.co.uk) and impossible to walk away from unchanged.; Category: Theatre",
    "start": "Aug 7-12, 14-19, 21-26 "
  },
  {
    "title": "Nina Conti: Whose Face Is It Anyway?",
    "presenter": "Show And Tell with PBJ Management",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NINACON_PL.jpg",
    "description": "The virtuoso ventriloquist, BAFTA nominee and British Comedy Award winner presents an unparalleled, unscripted new show that delves deep into who we are, hijacking faces to spark a bold, hysterical reality warp. 'Richly entertaining, joyfully funny chaos' **** (Guardian). 'It's genius... gut-bustingly funny' ***** (Telegraph). 'Laughs will definitely ensue' (New York Times). 'Outstanding! High-level comedy craftsmanship' **** (Times).; Category: Comedy",
    "start": "Aug 8-12, 14-18, 20-25 "
  },
  {
    "title": "2 Slut Drops and a Chicken Burger",
    "presenter": "Kirsty Munro",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242SLUTDR_6R.jpg",
    "description": "Slut drop it like it's hot! Kirsty talks about sexy times, nights out and starting a fight with a yoga instructor. 'An absolute joy from start to finish. 100% highlight of the Fringe' (Audience review, 2023). 'Kirsty is a fantastic high-energy act, she was a huge hit with the Fat Penguin audience' (Jay Handley, Fat Penguin Comedy Club). 'High-energy storytelling and subjects from cringe to pure genius. You will absolutely love her!' (Who Knows Comedy). Finalist, Some-Antics Comedy Slam 2023. ; Category: Comedy",
    "start": "Aug 7-12, 14-25 "
  },
  {
    "title": "The Wake of Dick Johnson",
    "presenter": "Long Pig Media ",
    "location": "Paradise in The Vault",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WAKEOFE_P3.jpg",
    "description": "A filthy comedy delving into memory, identity and the human condition in an afterlife purgatory. Johnson, haunted by vivid trauma and existential ponderings, confronts life's fleeting nature and the indifferent cosmos. As he grapples with the absurdity of existence and the torment of his memories, the play blends dark humour with deep questions. It challenges audiences to find meaning in life's chaos and absurdities, exploring themes of cosmic insignificance and eternal torment through a lens of irreverent comedy. It's been cancelled three times in the US for its controversial themes and graphic language.; Category: Theatre",
    "start": "Aug 19-25 "
  },
  {
    "title": "Shellshocked – An Explosive New Play",
    "presenter": "Richard Jordan Productions, 412, with Harrogate Theatre, LBT, Ketchup, Pleasance",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SHELLSH_ACF.jpg",
    "description": "From the creative team behind the five-star, multi-award winning plays Jesus, Jane Mother and Me, and Heroin(e) for Breakfast. The horrors of war have broken young Wesley, but could the madness he encounters beyond it save or destroy a soldier's shellshocked mind? A powerful new play from multi award-winning playwright Philip Stokes, recognised by the British Library as a culturally important playwright of the 21st century, and Olivier, Tony and Emmy award-winning producer Richard Jordan. Starring Jack Stokes (Winner, Adelaide Critics Circle Award 2023) and Lee Bainbridge – Heroin(e) For Breakfast: ***** (Sunday Telegraph).; Category: Theatre",
    "start": "Aug 7-13, 15-26 "
  },
  {
    "title": "EIFF: The Radleys",
    "presenter": "Euros Lyn",
    "location": "EIFF @ The Cameo",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EIFFTHI_CUS.jpg",
    "description": "Bloodthirsty, dark comedy about a suppressed family of vampires, adapted from Matt Haig’s (The Midnight Library) titular novel by Jo Brand and Talitha Stevenson. When their teenage daughter is assaulted by a classmate and an unexpected thirst for blood is awakened, her family is forced to disclose their true nature. The arrival of her arrogant, openly vampiric uncle accelerates the unravelling of the false front they have created. Featuring Damian Lewis, Kelly Macdonald and Harry Baxendale all on excellent form, this is a fresh, inventive take on the vampire genre. Cert: 15.; Category: Events",
    "start": "Aug 20 "
  },
  {
    "title": "Red Richardson: Tour Warm-Up",
    "presenter": "Ebdon Management presents",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024REDRICH_BND.jpg",
    "description": "Red Richardson is a critically acclaimed stand-up comedian, writer and actor and is regarded as one of the most-exciting new faces in comedy. His Stay Toxic videos have received over 90 million views on Instagram and his stand-up comedy shows sell out theatres and comedy clubs across the UK. His most recent stand-up show sold out the iconic Leicester Square Theatre in under 24 hours and he has just finished a sold-out US tour. Join him as he tries out new material for his upcoming debut UK tour.; Category: Comedy",
    "start": "Aug 13-14 "
  },
  {
    "title": "Persistent Shadows",
    "presenter": "Super-8-Auteur",
    "location": "theSpace @ Venue45",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PERSIST_VN.jpg",
    "description": "Persistent Shadows is a narrative-driven piece of work exploring the historical, political and social landscape of Britain throughout the 1980s and drawing parallels to issues faced by the people of Britain during the time as well as today. Join us as we are plunged into the heart of the acid house rave scene, lowered into the mines of East Kent, and shipped out to sea to fight in the Falklands. The show is highly energetic, fast paced and frequently utilises physical theatre to interweave the shifts in atmosphere and setting.; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "45 Degrees of Perspiration",
    "presenter": "Ben Harrington / Free Festival",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202445DEGRE_BSB.jpg",
    "description": "Prepare for a great show full of laughter and enlightenment as comedian Ben Harrington tackles one of the most pressing issues of our time in his latest comedy show, 45 Degrees of Perspiration. Ben Harrington fearlessly delves into the complexities of climate change, offering a fresh perspective on the serious subject matter through the lens of humour. The show promises to deliver a blend of clever observations, witty anecdotes and funny commentary that will leave the audience both amused but also informed, while raising awareness about the global environmental crisis.; Category: Comedy",
    "start": "Aug 19-25 "
  },
  {
    "title": "Beach Boys Sounds",
    "presenter": "The Beached Boys ",
    "location": "Le Monde",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BEACHBO_AJR.jpg",
    "description": "The UK's leading Beach Boys tribute act, The Beached Boys return to the Edinburgh Fringe by popular demand for a third successive year! Hear live hits including Surfin' USA, I Get Around, California Girls, Barbara Ann and many more. Wouldn't it be nice to experience those Good Vibrations, so get your Hawaiian shirts ready and book early to avoid disappointment as tickets will sell fast.; Category: Music",
    "start": "Aug 7-18 "
  },
  {
    "title": "The Locker Room",
    "presenter": "Rogue Schmidt",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LOCKERR_CKF.jpg",
    "description": "A brilliant wild ride of personal monologues intertwined with character sketches and audience participation by the Chicago Reader's winner of Best Comedian in 2024, Rogue Schmidt. As a former all-star athlete, Rogue uses her insider knowledge to sharply satirize the ultra competitive world of high school athletics in America and points the magnifying glass at the ethics of the unhinged coaches leading the charge. With each different coach character presented, a new sport, sketch and premise unfolds before the audience's eyes. It ran for six sold out weeks at the Annoyance Theatre in Chicago, Illinois.; Category: Comedy",
    "start": "Aug 6-10 "
  },
  {
    "title": "Timeless Tales of Gods and Heroes",
    "presenter": "Folk’d Up Theatre and New Celts Productions",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TIMELES_AMW.jpg",
    "description": "Six friends plan a night of folklore and song. With ancient tales of myth and magic brought to life with song and powerful storytelling, they hope to launch a business reflecting their love of Celtic and Gaelic mythologies. It’s the perfect plan. Perfect, that is, until some evangelical Christians get wind of their ideas… as the performance draws near, the protest crowd gathers. Can the company hold their nerve? Will our heroes win the day? Timeless Tales of Gods and Heroes examines the desire to hold on to ancient stories in a modern world.; Category: Theatre",
    "start": "Aug 7, 9, 11, 13, 15, 17, 19, 21, 23 "
  },
  {
    "title": "Sorry (I Broke Your Arms and Legs)",
    "presenter": "Maybe You Like It",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SORRYIB_BQX.jpg",
    "description": "Sam Wilson, Class 8C, is obviously the correct choice for Head Boy. He's got the PowerPoint to prove it. But amidst school discos, playground football and Machiavellian scheming, the road to the top will certainly be no Geography with Mr Baker (Geography with Mr Baker is massively easy). As the race intensifies, will Sam cause another boy grievous bodily harm? See title. Sorry (I Broke Your Arms And Legs) is a riotous debut PowerPoint presentation combining the thrills of World Book Day with the hilarity of the Maths Olympiad. Don't be late!; Category: Theatre",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "Underground Monk Show Works in Progress Show",
    "presenter": "Group of Monks (One is a Girl), PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Banshee Labyrinth",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/202400001UN_4R.jpg",
    "description": "It is a monk show that is a works in progress show. It will be underground. Clowny. Funny. Sexy hot monk action. Stupid. Sacred and profane. Failure and success. A group of mostly attractive idiots come together to create a show with an audience, incubated over the course of the run. Featuring: Max Baumgarten (Opium, Four Larks, Wet the Hippo), John Norris (Mr. Chonkers, Piggy Time), Bill O’Neill (Amazing Banana Brothers), Claire Woolner (A Retrospection). Co-Deviser/Writer: Sam Fishman (Amazing Banana Brothers). Directors: John Norris and Corey Podell (Gutterplum, Mr. Chonkers, Vanessa 5000).; Category: Comedy",
    "start": "Aug 6-8, 11-15 "
  },
  {
    "title": "North Sea Gas: In Concert",
    "presenter": "North Sea Gas",
    "location": "Acoustic Music Centre @ UCC",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NORTHSE_BEZ.jpg",
    "description": "You don't know North Sea Gas?! Where have you been? Over four decades touring around the world with their unique blend of traditional and contemporary folk music. Unreservedly Scottish, three voices and a plethora of instruments! From battle songs to ballads, Grant, Dave and Ronnie will take you on a tour of Scotland, from the East Coast to the Western Isles, from Edinburgh to Wick, all without the long drive. Put simply, come along for a night of great music, great entertainment and a solid dose of humour thrown in for good measure.; Category: Music",
    "start": "Aug 17-19 "
  },
  {
    "title": "A Show About Tomorrow",
    "presenter": "Disaster Class",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SHOWABO_P2.jpg",
    "description": "A Show About Tomorrow is a one-act musical set in the 90s at Bailey's 21st birthday party, which happens to be in the middle of nowhere. The party is going as well as any party could go, until it is rudely interrupted… by the end of the world. The musical follows the different reactions of the guests as they realise their life is ending before it has even really started. They battle with their morals, their desires and their needs as they struggle to decide what is right and wrong at the end of the world.; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "Paul McDaniel – Butter Beans",
    "presenter": "Paul McDaniel / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024PAULMCD_M4.jpg",
    "description": "Hey, this is Paul’s show. Well done, you’ve found it! He’s a Northern Irish comedian and he’s talking about butter beans. But not really. It’s a metaphor for feelings and that, see! It’s very clever. And funny. Come see! 'An inexplicable delight' (Chortle.co.uk). 'Glorious' (Comedy.co.uk). 'Paul McDaniel is f*cking brilliant' (Janey Godley).\n; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Sacred Arts Festival Film at St Vincent's Chapel",
    "presenter": "Introduced by Richard Kendall",
    "location": "St Vincent's",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SACREDK_CBF.jpg",
    "description": "La Vie et la Passion de Jésus Christ. A unique opportunity to see the life of Christ as depicted in the very early days of film. Lasting 40 minutes, this sequence of five biblical episodes, made in 1903 by the celebrated French directors Lucien Nonguet and Ferdinand Zecca, is unusually long for the period and was the first feature film to have colorized sequences. Introduced by Richard Kendall, a specialist in the history of silent film. ; Category: Events",
    "start": "Aug 16 "
  },
  {
    "title": "Athens of The North",
    "presenter": "Mark Hannah",
    "location": "The Hibernian Supporters Club",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ATHENSO_CSQ.jpg",
    "description": "Athens of The North is an interwoven, episodic monologue and love letter to Edinburgh and her people, performed in the iconic Edinburgh Hibernian Supporters Club. In a city being commodified and gentrified so rapidly, three Edinburgh characters weave in and out of each other’s lives; a stream of consciousness set in the capital city over the course of a single day. They subsequently reconnect with what their home truly means to them, in their respective pasts, presents as well as their futures.; Category: Theatre",
    "start": "Aug 6-12 "
  },
  {
    "title": "Odyssea",
    "presenter": "Quicksilver Dance (New York, USA)",
    "location": "C ARTS | C venues | C aquila",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ODYSSEA_CL.jpg",
    "description": "This dance-on-film follows the epic journey of Odyssea, a curious sea traveller, as she encounters flora and fauna in fantastical realms. New York-based Quicksilver Dance perform with only their hands, painted to become vibrant characters. Featuring original music and biomorphic landscapes made from sculptures and fabric, Odyssea offers a feminist take on the concept of an odyssey: she makes her way by helping fellow travellers, building relationships and trading, rather than through the mythologically typical approaches of strength, trickery or intrigue. This playful and poignant tale of encountering difference promises to make the familiar feel excitingly unfamiliar again.; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 4 "
  },
  {
    "title": "The Katet vs John Williams",
    "presenter": "The Katet",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KATETVS_ZO.jpg",
    "description": "The Katet – Edinburgh’s eight-piece jazz-funk superband, famed for their infamous treatment of Stevie Wonder’s back-catalogue – invite you to join them on the dance floor as they funk up the music of Star Wars, Jurassic Park, Indiana Jones, E.T. and more. All your favourite film scores like you've never heard them before! Expect pounding grooves, funky horns and duelling guitars. Featuring national blues star Jed Potts (guitar) and Scottish jazz hero Konrad Wiszniewski (sax). Expertly arranged and led by Northern Ireland's answer to Stevie Wonder, Maestro Mike Kearney. ‘Loved it!’ **** (Steven Spielberg).; Category: Music",
    "start": "Aug 13-14, 18, 20-21 "
  },
  {
    "title": "Northern News: Live",
    "presenter": "Plosive Live in association with Ebdon Management and United Agents",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NORTHES_PB.jpg",
    "description": "Comedians Ian Smith (Edinburgh Comedy Award nominee, The News Quiz, The Now Show) and Amy Gledhill (National Comedy Awards nominee, Would I Lie To You?, The Jonathan Ross Show) return to Edinburgh Fringe with a special late-night live edition of their comedy podcast, Northern News. Two Northerners living in London, Ian and Amy are missing out on the juicy stories from their hometowns. Join them as they scour the local rags of the North to find the stories you didn't know you needed to know. 'Hilarious' (Guardian). Chortle Awards 2024: Best Podcast nominee.; Category: Comedy",
    "start": "Aug 14 "
  },
  {
    "title": "1984",
    "presenter": "witintheatre",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241984_R7.jpg",
    "description": "1984 is a compelling physical theatre adaptation of George Orwell's classic, performed by Slavic actors. With inspiration from Nick Hern's adaptation, it delves into themes of surveillance and control, offering a haunting and immersive experience that challenges perceptions of truth and reality. Through expressive movement and visceral choreography, audiences are transported into Orwell's dystopian universe, feeling the oppressive atmosphere of Big Brother's world firsthand. This innovative fusion of physicality and narrative captivates spectators, leaving a lasting impact and sparking thought-provoking conversations about the state of our society and the dangers of unchecked power.; Category: Theatre",
    "start": "Aug 7-9, 11 "
  },
  {
    "title": "UKIP's Nightmare (Work in Progress)",
    "presenter": "Adam Anwar",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024UKIPSNI_CNM.jpg",
    "description": "Labelled 'Bolton's next big thing' by The Bolton News, following in the footsteps of the likes of Peter Kay and Sophie Willan. Leicester Comedy Festival Circuit Breaker 2022, Adam Anwar previews his show exploring his identity and social expectations.; Category: Comedy",
    "start": "Aug 6-14 "
  },
  {
    "title": "Abbi Cole and Ancika Mester: Shinpads",
    "presenter": "Abbi Cole and Ancika Mester / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Burrito ‘n’ Shake",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABBICOL_CHS.jpg",
    "description": "A split-bill stand-up hour from Abbi Cole (Hastings Newcomer of the Year finalist) and Ancika Mester (as heard on BBC Radio London). Ancika is sweaty, loosey-goosey and Australian. Abbi is a bit uptight, but still fun. Together they will give you a generous portion of the surreal and wacky. Both are Soho Theatre Comedy Labs Plus alumni, and part of Gigl Comedy/ 'Courageous, funny and refreshing' ***** (MumbleComedy.net).; Category: Comedy",
    "start": "Aug 6-12, 14-19, 21-25 "
  },
  {
    "title": "Moving On After Brain Injury",
    "presenter": "Fair Pley / The Stand Comedy Club",
    "location": "The Stand Comedy Club 5 & 6",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MOVINGO_AEO.jpg",
    "description": "Finding a way forward can be difficult, especially for young people. Memory, emotion, behaviour, thinking, planning and responding to change can all be affected by a brain injury. Work, education, relationships and leisure may be challenged and changed. Life goals may need to be reset. Dr Colin Chandler, Dr Lissette Aviles and Dr Catherine Clarissa (The University of Edinburgh) share and discuss stories of young adults moving forward and finding a new life after a brain injury, inviting you to reflect on how better to support young adults with the challenges they face.; Category: Spoken Word",
    "start": "Aug 15 "
  },
  {
    "title": "For the Love of Shane MacGowan!",
    "presenter": "John McLaughlin, Voodoo Rooms and Blond Ambition Productions",
    "location": "The Voodoo Rooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FORTHEM_VR.jpg",
    "description": "John McLaughlin (hit singer/songwriter/producer of Johnny Mac & The Faithful) performs songs of his friend and genius Shane MacGowan (The Pogues and The Popes). Johnny and his band blast through the classic songs of the great man whilst McLaughlin shares fond memories of their times writing and recording together and of course going to the pub! This homage is a celebration of the life and works of one of the greatest artists of all time and is endorsed by Shane’s wife, Victoria Clarke. So, let’s all raise a glass to Shane MacGowan!; Category: Music",
    "start": "Aug 20-23, 25 "
  },
  {
    "title": "Saving Lives?",
    "presenter": "Fair Pley / The Stand Comedy Club",
    "location": "The Stand Comedy Club 5 & 6",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SAVINGL_AEO.jpg",
    "description": "Doctors will only admit seriously ill or injured patients to the ICU if they believe they have a good chance of getting through the gruelling procedures. But of those that survive, one in five will die within a year and many others are left with lifelong, debilitating conditions. Surely we should be doing better than that! Dr Ananda Mirchandani (The University of Edinburgh) believes that oxygen is the key to understanding and predicting life after the ICU and is on a mission to improve patient outcomes.; Category: Spoken Word",
    "start": ""
  },
  {
    "title": "Kings of the Blues",
    "presenter": "Main Street Blues Band",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KINGSOF_ZO.jpg",
    "description": "Electric swing blues tribute show, celebrating the music of the three blues masters: BB King, Albert King, Freddie King. The show includes blues classics such as The Thrill is Gone, Born Under A Bad Sign, Let The Good Times Roll, See See Baby, Oh Pretty Woman and many more. Performed by top Scottish blues band, Main Street Blues, the show features our fabulous horn section and great backing vocals. Previous performances sold out (2021/22/23) so book early. Great reviews and feedback. Great band, brilliant must-see show, standing ovations.; Category: Music",
    "start": "Aug 16 "
  },
  {
    "title": "Too Close to the Sun",
    "presenter": "Wrong Tree Theatre Company",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TOOCLOS_CEM.jpg",
    "description": "Wrong Tree presents a newly devised show: Too Close to the Sun. The sun will come up tomorrow. But what if it doesn’t? Six people on the periphery reckon with what and who they have left when the unfathomable becomes reality. Against the backdrop of the Arctic, doomsday cults, and outer space, and inspired by the story of Icarus, this experimental and physical anthology explores what we take most for granted.; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "Caitriona Dowden is Holier Than Thou",
    "presenter": "Caitriona Dowden / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Banshee Labyrinth",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CAITRIO_BH.jpg",
    "description": "As a lapsed Catholic obsessed with medieval history, Caitriona spends a lot of time thinking about saints. In fact, she's pretty sure she has what it takes to become one. She invites you to join her cult in a debut solo hour complete with graphs, religious guilt and floating nuns. Chortle Student Comedian of the Year 2022. 'Unique and imaginative' (Chortle.co.uk). 'Lots of excellent gags' (Comedy.co.uk). 'Her self-effacing, smart and well-structured routines prove that organised fun is inherently superior to spontaneous fun' (ThreeWeeks).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "This Stand-Up Show is Free and Happening Right Now!",
    "presenter": "Sam Adamson and Jon Hipkiss",
    "location": "PBH's Free Fringe @ Southsider",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024THISSTA_2Y.jpg",
    "description": "Sam Adamson ('Thought-provoking', Mark Watson) and Jon Hipkiss ('Great work', Jack Whitehall) join forces to present you their greatest hits in this late night split-bill stand-up show. They present their absolute gold. Their best of. This show will deliver it with both barrels. This is all killer, no filler. You get the picture. Sam is the West End New Act Finalist 2024. Jon is the Leicester Comedy Festival People's Choice Award Nominee 2024. ; Category: Comedy",
    "start": "Aug 14, 21 "
  },
  {
    "title": "Jezahel – Vampires Can't Weld",
    "presenter": "HystERia Teatar",
    "location": "The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JEZAHEL_BVI.jpg",
    "description": "If you like theatre, darling... you'll hate this. A theatrical wild ride through the past, mixing laughter, memories and the energy of a bygone era. Can a group of ageing ravers defy the odds and stay up past their bedtime one more night to save the day from a horde of young and beautiful vampires? With a B-movie concept 30 years in the making, it is a play that would have the legendary Roger Corman spinning in his grave – that is, if he were already six feet under!\n; Category: Theatre",
    "start": "Aug 19-22 "
  },
  {
    "title": "The Book of Mountains and Seas",
    "presenter": "Alchemation",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BOOKOFM_P8.jpg",
    "description": "In this new play from award-winning writer Yilong Liu, a California dad arrives in New York to visit his late son's last boyfriend to propose an impossible mission: visit all 179 restaurants reviewed on his son's popular Yelp page in one weekend. What ensues is an adventure filled with clashing cultures, unlikely friendships, and the review of a lifetime.; Category: Theatre",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "Absolutely (not) Free – An Evening of Zappa",
    "presenter": "Pygmy Twylyte",
    "location": "Bannermans",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ABSOLUV_BYK.jpg",
    "description": "A smorgasbord of Frank Zappa classics hand-delivered by those finest purveyors of conceptual continuity, Pygmy Twylyte! Expect pickles, poodles, dental floss, snowballs and stinky feet! Two nights only!; Category: Music",
    "start": "Aug 15-16 "
  },
  {
    "title": "The Momma Drama presents Stretchmarks! ",
    "presenter": "The Momma Drama",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MOMMADR_CQB.jpg",
    "description": "The Momma Drama presents the hilarious and heartfelt show: Stretchmarks! An original play written by mums for mums, about the adventure of a lifetime: motherhood. The gorgeous and talented mum-semble light up the stage taking you on a journey of growth we can all relate to. Not just for mums... the show is beloved by everyone with audiences calling it 'super fun' and 'brilliant'! Join us for this mum-entous playdate that includes laughter, love, blessings from Mother Nature and sippy cups of wine!; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "A Life in Boxes",
    "presenter": "Rhiannon Hughes",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LIFEINB_3T.jpg",
    "description": "In the dusty confines of her late mother's attic, secrets unravel like cobwebs as Charlotte embarks on a darkly comedic journey through the forgotten chapters of her family's twisted history. A delightful new solo show written and performed by Rhiannon Hughes.; Category: Theatre",
    "start": "Aug 6-10, 12-24 "
  },
  {
    "title": "Doom and Glitter: A Tribute To Tom Waits",
    "presenter": "Mr Brake Down",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DOOMGLI_BRO.jpg",
    "description": "In this laid-back cabaret hour filled with vocal impersonations, live singing and bluesy banter, drag king Mr Brake Down pays tribute to the wit and wonderment of the iconic Tom Waits. Gloriously odd and experimental, the show takes audiences on a musical journey through some of Waits's seminal works, whilst Brake expounds on just how much a drag king from South Wales might have in common with the California-born performer. Expect to be bemused in a highly enjoyable fashion by a show that must be seen to be believed!; Category: Cabaret and Variety",
    "start": "Aug 6-10, 12-15 "
  },
  {
    "title": "Sophie McCartney: Work in Progress",
    "presenter": "Sophie McCartney / Live Nation / The Stand Comedy Club",
    "location": "The Stand Comedy Club",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SOPHIEM_ST.jpg",
    "description": "Following on from the phenomenal success of her debut stand up tour, award-winning comedian Sophie McCartney is back... older, wrinklier and LIVID. Does life really begin at 40? With neck skin that resembles labia and unobtainable life aspirations of a 'new kitchen' - the jury, much like her childbirth-ruined bellybutton, is out! 'Hilarious' (Metro). 'She is extremely funny' (BBC.co.uk). 'Not quite as funny as me…' (John McCartney, Sophie's Dad).; Category: Comedy",
    "start": "Aug 15 "
  },
  {
    "title": "Undecided: A Musical Misadventure",
    "presenter": "Durham University Musical Theatre Troupe",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024UNDECID_U8.jpg",
    "description": "Durham University's national musical theatre champions are bringing a show full of of iconic musical songs, characters and silliness to Edinburgh this summer! Laugh yourself silly as you choose which of your favourite musical theatre characters find themselves in the wrong song, and watch in amazement as our troupe members belt out classic tune after classic tune – making the troupe's Fringe debut with a bang! Durham University Music Theatre Troupe (DUMT) cannot wait to see you there!; Category: Musicals and Opera",
    "start": "Aug 19-24 "
  },
  {
    "title": "Kavin Jay: Unsolicited Advice",
    "presenter": "RGB Monster",
    "location": "Hoots @ The Apex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KAVINJA_CNK.jpg",
    "description": "Star of Netflix stand-up special Kavin Jay: Everybody Calm Down! makes his Fringe debut with a brand-new show about the worst part of bad news: what will your family say? Big laughs about health, wealth and misguided wisdom, with sharp and hilarious takes on what to do with unsolicited advice from well-meaning yet unqualified family and friends. 'South East Asia's sharpest and funniest voice' (Comedy Masala).; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "Dancing Queens",
    "presenter": "RuJazzle and Skinny Minnie",
    "location": "The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DANCING_CMR.jpg",
    "description": "After a sold-out run at the Fringe 2023, the Dancing Queens are back! Join two of Scotland's most fabulous queens for the ultimate Abba drag experience! Sing, dance and party all night long to all of the group's biggest hits with the Abba queens live on stage! Mamma Mia, you don't want to miss this!; Category: Cabaret and Variety",
    "start": "Aug 7, 14, 21 "
  },
  {
    "title": "One Acchord's That's Life in Harmony ",
    "presenter": "One Acchord A Cappella Chorus",
    "location": "St Vincent's",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024THATSLI_AMT.jpg",
    "description": "Embark on a musical odyssey with One Acchord: That's Life in Harmony. Join us for an unforgettable journey through the stages of life as told by the enchanting voices of One Acchord, the Borders a capella ladies' choir. This mesmerizing performance, a lyrical tapestry woven with the threads of Robert Burns and Shakespeare, invites you to immerse yourself in the melodies of joy, love and reflection.; Category: Music",
    "start": "Aug 3 "
  },
  {
    "title": "Olga Koch Comes From Money",
    "presenter": "IAM",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024OLGAKOC_BRQ.jpg",
    "description": "From the maker of Succession and White Lotus, Money™ brings you yet another little white b*tch you will love to hate: Olga Koch. The star of Live At The Apollo, Mock The Week and QI finally addresses the elephant in the room. Directed by Jet Vevers. 'Nerd and libertine' **** (Scotsman). **** (Guardian). **** (Telegraph). **** (Chortle.co.uk).; Category: Comedy",
    "start": "Aug 7-25 "
  },
  {
    "title": "Rock Choir Live",
    "presenter": "Rock Choir",
    "location": "theSpaceTriplex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ROCKCHO_BKL.jpg",
    "description": "Join Rock Choir, the award-winning national phenomenon, for a spectacular concert of uplifting songs! Throughout August, more than 3,000 Rock Choir members will light up the stage with feel-good hits from Guns'n'Roses to Whitney Houston. Promising an exhilarating experience, blending the excitement of pop music with the magic of choir performances. Join us for an unforgettable night of singing, dancing, celebrating the power of music, which will leave you on a high note! Love pop? Love singing? Love the thrill of a choir? Then you'll love Rock Choir Live – the ultimate musical celebration!; Category: Music",
    "start": "Aug 6-15, 17-18, 20-24 "
  },
  {
    "title": "A Day in the Life",
    "presenter": "Amy Grierson",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DAYINTH_CEL.jpg",
    "description": "A solo narrative navigating life with neurodiversity. Tales filled with smushed lipstick, spelling mistakes and wonky lines. An adventure of love, friendship and joy. Exploring the so-called concept of success predetermined by who? Creative problem solving otherwise known as masking to fit inside lines of a typical world. 45 minutes of a day in the life inclusive of hairstyles, dates, travelling and studying. In the absence of sorrow. A celebration of daily success or come along and decide for yourself?; Category: Spoken Word",
    "start": "Aug 19-24 "
  },
  {
    "title": "Funeral for a Dog",
    "presenter": "Miller and Harlow (New York, USA)",
    "location": "C ARTS | C venues | C aurora",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FUNERAM_CJW.jpg",
    "description": "A musical storytelling experience that tells the larger than life story of a dog who lived a very long time. Audience members are invited to a event similar to a real funeral, but get to watch and participate in the telling of this dog and his owner's life: nearly escaping trains, weathering storms, falling in love… Hear the miraculous account of a good dog, told through storytelling and song, and confront what it means to truly live. Funeral for a Dog is show that is a little haunting, containing a lot of humour, coated in hope.; Category: Musicals and Opera",
    "start": "Aug 14-18 "
  },
  {
    "title": "1 Dazzling Cabaret Show",
    "presenter": "Cabaret in The City ",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241DAZZLI_1U.jpg",
    "description": "'Life is a cabaret, old chum, come to the Cabaret!' Come be treated to a night of creativity, diversity and artistic impression – from sultry dancers to dazzling singers and hilarious comedians. Featuring a mix of music, dance, comedy and tantalising performances, this show will treat you to a diverse range of acts: from glamorous dancers to soulful singers as well as cheeky comedians and seductive burlesque performers. This show exudes playfulness, sensuality and empowerment in a vibrant and inclusive environment. A show that promise to entertain and intrigue all tastes.\n; Category: Cabaret and Variety",
    "start": "Aug 6, 8-13, 15-20, 22-25 "
  },
  {
    "title": "Waiting",
    "presenter": "Kate Farrell",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WAITING_BSI.jpg",
    "description": "It is September 1997. Edna Gould, wife, mother, grandmother, widow, has angina. It must be monitored and her new doctor is attentive and thorough. Despite the occasional setback she is ready for new experiences on a scale compatible with her needs. Edna was born in simpler times, her life lacks what some might term as excitement, but then so much is in the eye of the beholder. She has such hopes. Think Alan Bennett meets Roald Dahl.; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "In Conversation with… Temple Clark",
    "presenter": "Fair Pley / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024INCONVN_SV.jpg",
    "description": "Studied Fine Art Painting at Glasgow School of Art and is regarded as one of the leading storyboard and concept artists working in the film industry. He has over 150 feature film and television credits, ranging from big budget features such as Gravity, Bond, Harry Potter and The Crown, to smaller scale indie features and TV productions, as well as shorts, commercials and music videos. Clark collaborates with production designers, directors of photography, VFX and SFX departments, stunt coordinators and directors such as Sam Mendes, Rob Marshall, Stephen Daldry, Ralph Fiennes and Alfonso Cuarón.; Category: Spoken Word",
    "start": "Aug 9 "
  },
  {
    "title": "Is This Thing On?",
    "presenter": "So La Flair and MissMatch",
    "location": "Underbelly, Cowgate",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ISTHIST_UE.jpg",
    "description": "What's better, sad songs or sh*tty poetry? Meet flatmates Mary and Liz, one a musician and the other a poet, as they battle over integrity, ownership, the spotlight and whose turn it is to buy the freaking toilet roll. As their friendship reaches boiling point, one fateful open-mic night forces them to confront each other over whose right it is to tell someone's story. This two-hander dramedy blends stand-up, song, spoken word, rap and storytelling.; Category: Theatre",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Raymond Mearns Had a Stroke of Luck",
    "presenter": "Raymond Mearns",
    "location": "Scottish Comedy Festival @ The Beehive Inn",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024RAYMONE_1I.jpg",
    "description": "On the first day of Fringe 2023 Raymond had a stroke and didn't even realise it for two days! He was hospitalised and had to cancel, but he's better now and back to tell you all about it. A veteran of the Fringe, Raymond is one of the most consistently funny comedians on the comedy circuit, known for combining brilliant storytelling, sharp observations and blinding improvisation. 'Funny and cathartic' (Scotsman). 'A man who knows how to swear properly' (Billy Connolly). 'Improvisational genius' (Frankie Boyle). 'An arsehole' (Raymond's Ex-wife).; Category: Comedy",
    "start": "Aug 7-11, 13-26 "
  },
  {
    "title": "Karl Porter and Ben Silver: 2 Sick Guyz (Doing Stand-Up)",
    "presenter": "Karl Porter and Ben Silver",
    "location": "Just The Tonic Legends",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KARLPOR_CQJ.jpg",
    "description": "Featuring the slow-mo guy and viral sensation Karl Porter and Hot Water Comedy Club's Breakthrough Act of the Year Ben Silver, 2 Sick Guyz (Doing Stand-Up) will present each act's best 30-minute comedy sets.; Category: Comedy",
    "start": "Aug 13-25 "
  },
  {
    "title": "Sing Along With the Fairy Song",
    "presenter": "Janis Mackay",
    "location": "Scottish Storytelling Centre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SINGALP_T4.jpg",
    "description": "Award-winning children's author and storyteller Janis Mackay invites the fairies of the forest and garden to listen to her stories, along with you. Sing along with the fairy song, dress up if you like and sprinkle some fairy magic! Inspired by Janis' book The Fairy Song (Floris Books), this fun, enchanting and magical performance of storytelling and song is perfect for ages 3-8 years. Books will be available to purchase and Janis will happily sign copies for any wee fairies or forest creatures.; Category: Children's Shows",
    "start": "Aug 6-8, 10-13, 17-18, 24-25 "
  },
  {
    "title": "Amazing Fruit and Vegetables Carving Masterclass",
    "presenter": "Krua Thai Cookery School",
    "location": "Krua Thai Cookery School",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AMAZINO_AOU.jpg",
    "description": "Learn the exotic art of fruit and vegetable carving to enhance the visual appeal of your dishes, making them more enticing and appetizing. Discover new ways to present food that will astound your guests and provide a real talking point (as shown in photo). Fruit and vegetable carving is a Thai royal court culinary art that flourished from 1350 to 1767. Executive Thai chef Rujira Herd will reveal her best-kept secrets she uses for her topflight clients. Learn seven impressive designs with special techniques. Snacks will be served. Only 2.7 miles from city centre.; Category: Events",
    "start": "Aug 6, 9, 11, 24, 26 "
  },
  {
    "title": "Cobin Millage: Fifteen Pints With a Wax Figure of Renowned Painter Pablo Picasso",
    "presenter": "Cobin Millage",
    "location": "Laughing Horse @ The Three Sisters",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NOCOBIN_2A.jpg",
    "description": "Cobin Millage brings his second, and possibly final, show to the Edinburgh Fringe. 'Final?' You ask in horror. 'Yes,' Cobin replies, 'I might get deported.' 'Wow,' you whisper, 'That sucks. Is the show about getting deported?' 'It isn't.' Cobin says, while doing finger guns. 'Is it about Pablo Picasso?' you query. 'Also no!' shouts Cobin as he slams his empty pint onto a fragile glass table. 'You're a bit of a rogue, huh?' you ask, blushing. Cobin smiles; 'Again, no.' 'Hilarious, effortlessly engaging' **** (Edinburgh Festivals Magazine).; Category: Comedy",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "Cabin Fever",
    "presenter": "Fresh !nk Theatre Company",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CABINFE_3T.jpg",
    "description": "Fresh !nk Theatre Company presents a sky-high spectacle! This must-see two-person show is a hilarious theatrical journey set 30,000 feet above the Atlantic. Join us on an unforgettable flight from London Heathrow to LAX, where two actors seamlessly shift between the disruptive passengers to the pilots in the cockpit. This relatable comedy takes turbulence to a whole new level, and showcases universal travel experiences that we are all too familiar with. From unexpected friendships to in-flight shenanigans, buckle up for an unmissable joyride in this entertaining show delivering an uproarious experience as the characters' stories unfold.; Category: Theatre",
    "start": "Aug 19-21, 24 "
  },
  {
    "title": "Juliette Burton's Talking Crazy CANCELLED",
    "presenter": "Ingenious Fools Ltd",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JULIETV_BRG.jpg",
    "description": "In crazy times, what keeps us sane? Comedian, activist and charity ambassador Juliette Burton was sectioned under the Mental Health Act, diagnosed with 15 mental illnesses, an inpatient five times and in therapy 20+ years – but she's not mad about that. What drives her crazy is the lack of change. For two nights only  – armed with research, personal and scientific – this mad harpy and her special guests talk madness for your info-tainment. 'Drips with charm' (Times). 'Huge talent' ***** (Mirror). 'A force to be reckoned with' ***** (EdFestMag.com). 'Liberating' ***** (VoiceMag.uk).; Category: Events",
    "start": ""
  },
  {
    "title": "Mime Club",
    "presenter": "Jon and Ollie",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MIMECLU_CEU.jpg",
    "description": "Sexy dads, Swedish poetry, time-travelling DJs... Welcome to Mime Club. Enjoy the pandemonium. From the minds of acclaimed idiots Jon & Ollie comes a new show packed with physical comedy, chaos and clowning. Prepare yourself for an hour of multi award-winning sketches from the Jon & Ollie universe, each one more ludicrous than the last. Mime Club is a dream* come true for comedy lovers. *If your dreams are about Kenneth Branagh and sentient vacuum cleaners.; Category: Comedy",
    "start": "Aug 6-15 "
  },
  {
    "title": "Tania Kovats: SEAMARKS",
    "presenter": "Dovecot Studios",
    "location": "Dovecot Studios",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TANIAKO_BJG.jpg",
    "description": "Tania Kovats’ ongoing series SEAMARKS, multiple seascapes captured in brushstrokes, drawings and ceramic, is being expanded with the creation of a new tapestry by Dovecot Studios. Kovats presents the passing of time through the broken surface of the sea, the elemental rhythms of the moon and the meditative qualities of weaving and drawing. Kovats' repetitive marks capture the energy and flicker of water in this converted Victorian bath house. As the marks get smaller and closer towards the horizon they invoke a sense of infinity, exploring how art can speak to our critical climate emergency.; Category: Exhibitions",
    "start": "Aug 6-26 "
  },
  {
    "title": "Baggage – Janet Street-Porter In Conversation With Biggins",
    "presenter": "Janet Street-Porter, Christopher Biggins",
    "location": "The Fringe at Prestonfield",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BAGGAGF_CJR.jpg",
    "description": "Opinionated? The former national newspaper editor, award winning columnist and creator of ground-breaking TV takes no crap from anyone. Especially Christopher Biggins, who she beat on a Masterchef Christmas special. She’s done it all – winning Call me Cabbie, Tipping Point and The Weakest Link and was the last woman standing in the jungle. She’s got an Academy Award and a senior railcard, has interviewed David Bowie and Johnny Rotten, is a Loose Woman, passionate rambler, militant pensioner and all round icon. Will Biggins get a word in edgeways? ; Category: Spoken Word",
    "start": "Aug 25 "
  },
  {
    "title": "Colin Steele and Martin Kershaw Play Chet Baker and Stan Getz",
    "presenter": "Colin Steele ",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024COLINSU_ZO.jpg",
    "description": "Chet Baker and Stan Getz exemplified the laid back soulful sounds of 1950's California cool school jazz. This new project features Steele (trumpet) and Kershaw (saxophone) Dave Milligan (piano) Brian Shiels (bass) and Max Popp (drums) who will transport you to a time when melody was king. 'The best music I saw might have been Martin Kershaw and Colin Steele playing 50s bebop at the Jazz Bar, which I wasn't expecting, but it made me hear that music as a living organism rather than a museum piece.' (Stewart Lee).; Category: Music",
    "start": "Aug 21-25 "
  },
  {
    "title": "Agent November's Outdoor Escape Game: Robyn Yew",
    "presenter": "Agent November Escape Rooms",
    "location": "Forces @ The Fringe at the Royal Scots Club",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AGENTNO_CTK.jpg",
    "description": "The Museum of Secrets has been robbed, priceless artefacts are missing and a diplomatic summit is in crisis. Only you can save the day! Take to the streets of Edinburgh to solve the puzzles and recover the artefacts. Along the way you’ll learn more about the stolen relics, and their part in a 350-year-old mystery. Part of Agent November’s award-winning Project Pandora escape game series. 'The perfect mix of puzzles, immersive drama and tongue-in-cheek humour' (BroadwayBaby.com). www.agentnovember.co.uk; Category: Theatre",
    "start": "Aug 6-26 "
  },
  {
    "title": "Who Do Ya Love?",
    "presenter": "ATG Productions, Gavin Kalin Productions and LPO with Dudley Hinton",
    "location": "Assembly George Square Studios",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WHODOYA_AAU.jpg",
    "description": "Get your boogie shoes ready for the official KC and the Sunshine Band musical. Featuring eight West End performers and some of the most iconic dance floor fillers of the 70s, this world premiere celebrates the early life of Harry Casey the King of Disco in a feel-good hour of big laughs and infectious music. Featuring over 20 hit tracks including Give It Up, Please Don't Go, Get Down Tonight, Boogie Shoes and That's the Way (I Like It), see the UK's next big disco musical at the very start of its journey!; Category: Musicals and Opera",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "Mairi Campbell: Living Stone",
    "presenter": "Mairi Campbell",
    "location": "Scottish Storytelling Centre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MAIRICA_T4.jpg",
    "description": "Mairi Campbell encounters a 400 million-year-old stone, fashioned into a family millstone found on the island of Lismore. The stone has become her talisman, revealing layers of mystery and resonance. Song, sound and word combine in an odyssey that unifies lineage, land and pulse. Join Mairi for a feast of image, music and word that brings the living stone to life! Music co-devised with Dave Gray, directed and co-created by Kath Burlinson. Follow-up to Pulse and Auld Lang Syne. 'Incredible storyteller… voice is like no other' (EdinburghGuide.com).; Category: Theatre",
    "start": "Aug 7, 9, 11, 13, 15, 17, 19, 21, 23, 25 "
  },
  {
    "title": "Hagar: War Mother",
    "presenter": "Amena Shehab / Alma Theatre / Mistletoe & Gorse Productions",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HAGAR_HN.jpg",
    "description": "One woman's odyssey to escape Syria's brutal war with her son, who should be having his first birthday party. Hagar's a dreamer, but she never dreamt she'd be a refugee. Now she's negotiating with smugglers and betrayed by friends, but the warmongers won't stop this mother. A passionate story of fighting for a better future, whatever the cost. Written by Aksam Alyousef. Performed by Amena Shehab, a Palestinian-Syrian-Canadian, a refugee twice over. Nominated for Outstanding Fringe Performance, Drama, in Theatre Alberta's Sterling Awards 2020. Produced by Joanna Blundell. 'A heartbreaking story, beautifully told' ****½ (Edmonton Journal).; Category: Theatre",
    "start": "Aug 6-10 "
  },
  {
    "title": "Catriona Price & Friends",
    "presenter": "Catriona Price & Friends",
    "location": "La Belle Angele",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CATRION_BHR.jpg",
    "description": "Inspired by poetry from her homeland of Orkney, Catriona Price’s debut album Hert (Orcadian Scots for ‘heart’) explores the contrasting perspectives that make up the rich tapestry of Orkney life, drawing light upon the non-stereotypical characters – those that may not immediately spring to mind when thinking of a small island community. Featuring a band of nine musicians, Catriona's music draws influence from Scottish folk, jazz, pop and western art music. Hert was released to critical acclaim in 2023 with a launch at Celtic Connections and sold out show at Edinburgh International Festival. Part of MadeInScotlandShowcase.com.; Category: Music",
    "start": "Aug 12 "
  },
  {
    "title": "Naked Truth CANCELLED",
    "presenter": "Tait Productions",
    "location": "Saint Stephen's Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NAKEDTR_BML.jpg",
    "description": "Opened to critical acclaim in London's West End and adapted from the novel of the same name by Johnny Tait, this is an extreme satire on false-celebrity culture. Not for the easily offended. A deep, dark rollercoaster ride.; Category: Theatre",
    "start": ""
  },
  {
    "title": "Boardroom",
    "presenter": "Bristol Spotlights",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BOARDRO_CPY.jpg",
    "description": "2000’s reality TV graced our screens with extremities, from swapping wives to fixing diet \"crimes\". If these outrageous concepts went ahead, what was tossed around the boardroom that didn’t? It’s 2012, Reality TV producers Terry, Carl and Michael are comfortably set in their schoolboy ways, arguing with their wives and playing darts all day while scraping the bottom of the barrel for their next \"big hit\". Fresh-faced producers Mary and Warren arrive, sparking generational and gender clashes and throwing everything out of whack at Silky Productions. How far are we all willing to go for the sake of entertainment?; Category: Theatre",
    "start": "Aug 12-17 "
  },
  {
    "title": "Matt Winning: Solastalgia (Work in Progress)",
    "presenter": "Matt Winning / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Voodoo Rooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MATTWIN_K6.jpg",
    "description": "Everyone's favourite climate academic and comedian Dr Matt Winning tests new ideas about climate change. Host of Net Zero: A Very British Problem (BBC Radio 4). 'Everything a Fringe show should be: hilarious, personal, inventive and something that will stay with you for some time to come' ***** (Edinburgh Festivals Magazine); 'Winning's sharp wit and intelligence allows him to educate as he entertains in this excellent stand-up seminar' ****½ (Sunday Post). 'An entertaining blend of facts, figures and accessible bits of stand-up' (Chortle.co.uk); 'Informative, urgent and amusingly provocative' (BritishTheatreGuide.info).; Category: Comedy",
    "start": "Aug 19-25 "
  },
  {
    "title": "Heathen Apostles: An Evening of Gothic Americana",
    "presenter": "Heathen Apostles, Voodoo Rooms and Blond Ambition Productions",
    "location": "The Voodoo Rooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HEATHEN_VR.jpg",
    "description": "Born of the voices of past lives and baptized in the dust-bowl dirt, the Gothic Americana music of Heathen Apostles harkens back to a bygone chapter of American history. Using contrasting influences such as Bauhaus, Nick Cave and the Bad Seeds, The Pogues, along with Howlin’ Wolf, Loretta Lynn and Bessie Smith, Heathen Apostles have created a style of music that will conjure both angels and demons and will enlighten a darkened soul.; Category: Music",
    "start": "Aug 6-7 "
  },
  {
    "title": "ScotlandsFest: Trainspotting on Location – Tim Bell",
    "presenter": "Tim Bell",
    "location": "Meeting Point opposite Café Truva",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SCOTLAG_CTU.jpg",
    "description": "Choose Life. Choose Leith. Choose a walking tour through Leith’s heart, dissecting Irvine Welsh’s Trainspotting – the book, the movie and the play. Uncover the layers of this iconic phenomenon. This journey offers a unique perspective on Leith’s past and present, weaving narratives of struggle, resilience and transformation. An unforgettable exploration of the intersections of literature, culture and place. Expect well-researched erudition, lived-experience testimony and street-level wisdom from former Port of Leith chaplain Tim Bell who has been leading Leith Walks Trainspotting tours for over 20 years. ‘Top tour’ (Sunday Times).; Category: Spoken Word",
    "start": "Aug 12, 16, 19 "
  },
  {
    "title": "Meat Loaf – Just the Best Bits",
    "presenter": "Dr H Musics / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Fingers Piano Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MEATLOA_HK.jpg",
    "description": "Dine out on a hearty serving of your favourite Meat Loaf pieces as we slice through his back catalogue and digest the finest moments. Renowned Australian piano cabaret entertainer Antony 'Dr H' Hubmayer (Tom Lehrer Show and Monty Python Singalong Circus), will serve up a smorgasbord of entertainment that will have you laughing, singing, reminiscing and consuming the interactive fun and games. Join the festive banquet as we celebrate one of the world’s finest dramatic rock performers, Meat Loaf!; Category: Cabaret and Variety",
    "start": "Aug 12-13, 19-20 "
  },
  {
    "title": "EIFF: The Radleys",
    "presenter": "Euros Lyn",
    "location": "EIFF @ Inspace",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EIFFTHI_CUU.jpg",
    "description": "Bloodthirsty, dark comedy about a suppressed family of vampires, adapted from Matt Haig’s (The Midnight Library) titular novel by Jo Brand and Talitha Stevenson. When their teenage daughter is assaulted by a classmate and an unexpected thirst for blood is awakened, her family is forced to disclose their true nature. The arrival of her arrogant, openly vampiric uncle accelerates the unravelling of the false front they have created. Featuring Damian Lewis, Kelly Macdonald and Harry Baxendale all on excellent form, this is a fresh, inventive take on the vampire genre. Cert: 15.; Category: Events",
    "start": "Aug 21 "
  },
  {
    "title": "The Selkie",
    "presenter": "Oor Theatre",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SELKIE_CQB.jpg",
    "description": "Local lads Finlay and Ciaran are working the last ferry to the Isle of Bute, trying to distract themselves from the unusual happenings on board. But unbeknownst to them, a Selkie follows close behind looking for a husband. Blending folklore with the frustrations of modern rural life, The Selkie is a coming of age play written by rising talent Madeleine Farnhill.; Category: Theatre",
    "start": "Aug 7-9 "
  },
  {
    "title": "Tamsyn Kelly: Work In Progress",
    "presenter": "Tamsyn Kelly",
    "location": "Monkey Barrel Comedy (The Tron)",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TAMSYNK_CKG.jpg",
    "description": "Duchess of Cornwall Tamsyn Kelly spills the tea on her latest moves, as she follows on from her hit tour, Crying In TK Maxx. 'Hilarious' (Independent). ***** (LostInTheatreland.co.uk). **** (FunnyWomen.com). **** (TheReviewsHub.com). **** (One4Review.co.uk). **** (The Student).; Category: Comedy",
    "start": "Aug 19 "
  },
  {
    "title": "3HAMS",
    "presenter": "3HAMS",
    "location": "Just the Tonic at The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20243HAMT_ACK.jpg",
    "description": "3HAMS is produced by Charlie Traisman and Makena Miller. The play premiered in NYC at Triskelion Arts Brooklyn, and ran at Brooklyn Comedy Collective and Caveat NYC. Director: Billie Aken-Tyers, associate director of the hit show, Titanique (Off-Broadway, Daryl Roth Theater). 3HAMS follows Max and Ry, two friends whose bond was forged through their shared struggle with eating disorders. In the confines of their collective brain, they must confront truths of their unhealthy dynamic, and what is needed to break the cycle. In the muck of it all, the greatest insight comes from an unlikely source… a literal ham.; Category: Theatre",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Fin Taylor: Ask Your Mother",
    "presenter": "Show And Tell",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FINTAYL_PA.jpg",
    "description": "Fresh from the viral success of his hit web series Fin vs The Internet, and a sell-out nationwide tour, that comedian your mother doesn't like you seeing shares a new hour of brutally funny stand-up. When he's not in a roll-neck making influencers squirm, he's appearing on BBC's Live at the Apollo, Have I Got News for You, The Mash Report and Comedy Central's Roast Battle. 'Gleefully provocative and packed with big, hard laughs' **** (Guardian).; Category: Comedy",
    "start": "Aug 25 "
  },
  {
    "title": "Òran",
    "presenter": "Wonder Fools, Pitlochry Festival Theatre and Pleasance",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ORAN_PM.jpg",
    "description": "Combining spoken word, lyrical storytelling and a pulsating electronic live score, this is the thrilling story of Òran and his journey to rescue his best friend from the Underworld. Should he arrive, Hades might grant him the chance to lead his friend home… but at what cost? This visceral piece of contemporary theatre is a collaboration between Wonder Fools, ‘one of Scotland’s most exciting new companies’ (Scotsman) and the acclaimed hip-hop artist Owen Sutcliffe in partnership with Pitlochry Festival Theatre and Pleasance Theatre with music by VanIves, creating an urgent, entertaining, modern retelling of the classic Greek myth Orpheus.; Category: Theatre",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "Tales of Haunted Edinburgh – Echoes From Beyond the Grave",
    "presenter": "Ewan Irvine",
    "location": "Arthur Conan Doyle Centre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TALESOF_AAO.jpg",
    "description": "Edinburgh is known as one of the most haunted cities in the world. Listen to its tales of the undead from a paranormal investigator as you discover a host of terrifying stories of hauntings from the city’s dark past. From the House of Horrors, in the West Bow, to Greyfriar's Kirkyard and the infamous George Mackenzie, the servant boy of Queensberry House, to some of the haunted closes on the Royal Mile. These are just a few of the tales.; Category: Spoken Word",
    "start": "Aug 6, 8, 13-15 "
  },
  {
    "title": "Jake Roche: Neporrhoids",
    "presenter": "Rowaters Productions",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NEPORRH_PK.jpg",
    "description": "A (mostly) true story of the meteoric rise and devastating fall of chart-topping boyband member Jake Roche, who is definitely not a \"nepo baby\", a \"one hit wonder\", nor \"completely irrelevant\".; Category: Theatre",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "EIFF: Animation Shorts",
    "presenter": "Various",
    "location": "EIFF @ Inspace",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EIFFANI_CUU.jpg",
    "description": "Animations to arouse the senses. Encounter exceptional animated shorts that ponder the absurdity of life. Fragile bodies and fragile emotions are presented here with wit and wonder. Films that speak of heartache and delight, trauma and healing, and death and rebirth. They have been crafted with an assortment of techniques, including paint on glass, paper cut out, charcoal and cels. Prepare to plunge into an enthralling medley of shorts. Cert: 18.; Category: Events",
    "start": ""
  },
  {
    "title": "The Screen Test",
    "presenter": "Bebe Cave in association with BIGHEAD Comedy",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SCREENT_PF.jpg",
    "description": "The Screen Test, written and performed by Bebe Cave. A one-woman show about delusion, desperation and dreams. A dark comedy. Betsy Bitterly is an aspiring actress in 1930s Hollywood, so desperate to become a star that she might just sacrifice herself along the way. Through a series of \"screen tests\" for roles that could change her life, Betsy herself changes in ways she never expected in her never ending quest to \"make it\". But what does \"making it\" really mean? And when do you let go of the dream?; Category: Theatre",
    "start": "Aug 6-13, 15-26 "
  },
  {
    "title": "Try Not to Worry About It, Death Comes to Us All",
    "presenter": "Jonathan Kinsman / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Banshee Labyrinth",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TRYNOTT_BH.jpg",
    "description": "In the last few years, poet, performer and slam champion Jonathan Kinsman has lost two grandfathers, a great aunt, a cat and his sanity. Watch him try to process his mum's most comforting piece of advice: Try Not to Worry About It, Death Comes to Us All. Laugh with him, cry with him (but maybe try to avoid hallucinating from stress with him).; Category: Spoken Word",
    "start": "Aug 7-12, 14-19, 21-25 "
  },
  {
    "title": "The Glasstown Confederacy",
    "presenter": "Talking Shadows",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024GLASSTO_U8.jpg",
    "description": "Charlotte. Emily. Anne. Bronte. What inspired three lonely, unworldly women from a remote Yorkshire village to become some of the most celebrated novelists of all time? This new work explores the early lives of the Bronte sisters, their vivid imaginary worlds and the tragic family events which shaped their young lives and later writing. Praise for writer and director Rebecca Vines’ Bronte biography More Myself Than I Am: 'A cut above' **** (TheWeeReview.co.uk). 'The kind of period drama you might expect from the BBC' **** (BroadwayBaby.com).; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "The Secret Room at Lauriston Castle",
    "presenter": "Edinburgh International Magic Festival",
    "location": "Lauriston Castle",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SECRETR_BMD.jpg",
    "description": "Sell-out event with a new line-up! On the outskirts of Edinburgh, hidden away at the end of a winding driveway, lies one of Edinburgh's secret treasures – Lauriston Castle. Imagine timeless tapestries, ornate silverware, but also a world of clandestine laboratories, hidden passages and secret rooms... Three expert magicians animate the castle's intriguing past with stories, performances and illusions related to the history of Lauriston and her owners. A High Court judge-cum-surreptitious alchemist, a gambler who nearly lost everything, what other mysteries does this wonderful castle conceal? Featuring Drew McAdam, Lewis Barlow, Tim Licata.; Category: Cabaret and Variety",
    "start": "Aug 13-15, 21-22 "
  },
  {
    "title": "Miss English's Holiday by Action Theatre (Italy)",
    "presenter": "Action Theatre (Italy)",
    "location": "theSpace @ Symposium Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MISSENG_CES.jpg",
    "description": "A teacher’s magical seaside summer holiday is interrupted by an enthusiastic stowaway, Platypus. Miss English enjoys fish and chips, discovers love and deals with the English weather and an annoying seagull, but Platypus just wants her to teach English! With plot twists, puppetry, masks, magic, sing-along songs and comedy, this professional show is a proven hit with young audiences. Aimed at 3 to 7-year-old English speakers or children up to 9 where English is their second language. Action Theatre (Italy) have played to over a million young people. 'A resounding success' (Teacher, Milan).; Category: Children's Shows",
    "start": "Aug 6-10, 12-17, 19-24 "
  },
  {
    "title": "The Duchess of Buckingham Regrets to Inform You That Her Husband is Dead",
    "presenter": "Ruckus Theatre Co",
    "location": "Paradise in Augustines",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DUCHESS_P1.jpg",
    "description": "August 1815. The Duke of Buckingham is dead – but the feelings on this are decidedly mixed. At the Buckingham estate, his widow Selina discovers she must remarry within seven days or lose everything. So, when the perfect candidate appears, she thinks the problem is solved. Only something much darker is happening. And as an unlikely affection emerges, nastier truths come to light. With her bankrupt family depending on her and a power-hungry social climber gunning for her title, Selina's running out of time.; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "Under Milk Wood",
    "presenter": "Guy Masterson",
    "location": "Pleasance at EICC",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024UNDERMI_BDP.jpg",
    "description": "In celebration of his 30 years at Fringe, Guy Masterson, presents his globally renowned solo of Dylan Thomas’ lyrical masterpiece. Playing all 69 of Thomas’ ebullient inhabitants of 'Llareggub' – a fictional sea-town somewhere in Wales, solo, it’s an amazing feat of memory and physical virtuosity. Complemented by a stunning original soundscape by Rolling Stones’ Matt Clifford, it's bawdy and beautiful, sad and sensual and, through the music of language, leaves indelible, unforgettable images of humanity. ‘It's a feat of multiple characterisation impeccable timing, vocal dexterity and precise physical control, performed with tremendous sensitivity and panache!’ (Guardian).; Category: Theatre",
    "start": "Aug 14 "
  },
  {
    "title": "Mat Wills: My Wife Took My Dad to a Brothel (I Drove)",
    "presenter": "Mat Wills",
    "location": "Laughing Horse @ The Hanover Tap",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MATWILL_BBE.jpg",
    "description": "A very funny sex-positive comedy show for people with genitals and a good sense of humour. Mat Wills’ most personal show to date explores family, relationships and losing one’s sense of shame for love. Taboos broken, lessons learned. Fun by, but not for, the entire family!; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Kate-Lois Elliott: How to Belong Without Joining a Cult",
    "presenter": "Kate-Lois Elliott",
    "location": "Gilded Balloon Patter House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KATELOI_CRP.jpg",
    "description": "Kate-Lois Elliott's family lived in a secretive cult until her mum escaped. One generation later, a teenage Kate finds herself in the clutches of an equally militant operation... just your average group of teenage girls. Because, as it turns out, cults are everywhere – ask anyone with a Tesco Clubcard. British Writers' Guild Award nominee, British Comedy Guide Awards finalist. 'Such funny business' (Jessica Fostekew). 'Elliott commands the stage, charming delivery, quality callbacks' (ASpyInTheStalls.com). 'Zeitgeisty' (Dominic King, BBC Radio Kent). 'Could sniff vodka from the plinth' (Helen Lederer). Directed by Esther Manito.; Category: Comedy",
    "start": "Aug 6-18, 20-26 "
  },
  {
    "title": "Wet Feet",
    "presenter": "Michael Neri",
    "location": "Paradise in The Vault",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WETFEET_P3.jpg",
    "description": "Wet Feet tells the story of an encounter between two men in a gay sauna that lasts longer than your typical steamy dalliance. Nathan is an out and proud gay man, while Franko lives his life in the long shadow of Section 28. Throughout this poignant comedy, the towel-clad pair get to know each other a little better and a heart-warming connection is formed. Wet Feet is an Off West End award nominee for duo performance in a play.; Category: Theatre",
    "start": "Aug 12-17 "
  },
  {
    "title": "EIFF: Lollipop",
    "presenter": "Daisy-May Hudson",
    "location": "EIFF @ Inspace",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/Lollipop_SQUARE (1)_7.png",
    "description": "A stirring and powerful film about a young mother, recently released from prison and desperate to maintain custody of her two young children. Just when things appear to be at their darkest and most desperate for Molly (Posy Sterling), a chance encounter with an old school friend might be the start of a road towards a brighter future. Writer/Director Daisy-May Hudson brings wit, warmth and humanity to this beautiful story of individuals on the margins of society bonding in the face of unimaginable hardship. Cert: 15.; Category: Events",
    "start": "Aug 21 "
  },
  {
    "title": "Simply Grimm",
    "presenter": "The Janus Players",
    "location": "theSpace @ Venue45",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JANUSPL_VN.jpg",
    "description": "What do you do when your flight has been delayed for the fourth time as you're heading to the Fringe? You could be grim or Simply Grimm – a fun filled, highly energetic romp through the tales of the Brothers Grimm. Caught in the airport for yet another delay, what else can a troupe of thespians do than breathe new life in to classic stories? Old tales are turned into new yarns, which in turn, turns them into new classics. ; Category: Theatre",
    "start": "Aug 6-7 "
  },
  {
    "title": "Ben Target: LORENZO",
    "presenter": "Soho Theatre",
    "location": "Pleasance Dome",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BENTARG_PV.jpg",
    "description": "Ben Target is a critically-acclaimed performance artist and multi award-winning comedian (yawn), but in 2020 he gave this up to become the live-in carer for an irascible octogenarian prankster. A life-affirming story about death, conveyed through the popular mediums of storytelling, servitude to the audience and live carpentry: a combination not seen on the world stage since Nazareth (circa 30AD). Winner: Scotsman Fringe First 2023. 'A joyous celebration of what it means to love deeply' ***** (Fest). 'A knockout piece of theatre... deeply affecting, tender and funny' ***** (List). ***** (British Theatre Guide). **** (Guardian). **** (Scotsman).; Category: Theatre",
    "start": "Aug 16-25 "
  },
  {
    "title": "Ali Affleck presents: 1933 – Wild Women of the Prohibition",
    "presenter": "Ali Affleck and The Gin Mill Genies",
    "location": "The Jazz Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALIAFFM_ZO.jpg",
    "description": "Bye bye Gatsby! Ali is celebrating 30 years of pioneering blues and hokum. Award-winning vocalist (and jazz historian) with an all-star band! Celebrate the brave and bawdy blues queens who reigned in the prohibition era – many sadly forgotten over time. The music was bold – the women even more so! 'Masterclass in grassroots jazz/blues' ***** (Edinburgh49.org). 'Not a household name yet – she soon will be' (BBC Jazzhouse). ‘Musical storyteller’ (Scotsman). 'Astounding vocals' ***** (San Diego Union-Tribune). ‘Vivacious’ (Herald). Six-time nominee for Best Vocalist (Scottish Jazz Awards).; Category: Music",
    "start": "Aug 6, 21, 23 "
  },
  {
    "title": "Bex Turner: Bexual Healing",
    "presenter": "Bex Turner / Free Festival",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BEXUALH_BSB.jpg",
    "description": "It’s a pun, although some of the characters might be witty and off the wrist. This is the intercourse before the dessert, whoops sorry I mentioned Bex... Bexual Healing is a retro-character comedy in which the awkward sex symbol Maybe West shares her encounters with other socially awkward characters from the 1920s-1990s. Each is struggling to find acceptance and love through the barriers that being female and neurodiverse brings. 'Rebekka Turner plays several highly funny characters with a League of Gentlemen edge' (Simon Topping).; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "Adam Bloom – Masterclasses",
    "presenter": "Adam Bloom",
    "location": "Just the Tonic Nucleus",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ADAMBLP_CTQ.jpg",
    "description": "Last year Adam Bloom wrote a groundbreaking, best-selling book: Finding Your Comic Genius. It's possibly the most advanced book ever written about stand-up and resulted in him holding masterclasses all over the world. This masterclass is an intense and in-depth study of Adam's book in the form of an intimate Q&A, where everyone present will walk away with a much deeper understanding of his methods and theories on comedy. Attendees who have already read the book will benefit most from the class. However, anyone who hasn't read the book will still learn a huge amount.; Category: Comedy",
    "start": "Aug 6-10 "
  },
  {
    "title": "Chicken Little",
    "presenter": "Stage Door Enigma Theatre Company",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CHICKEN_AMW.jpg",
    "description": "While walking through the park one day, Chicken Little is hit on the head! She decides to tell the Prime Minister the sky is falling, and so begins a perilous journey: travelling through a dark and scary forest, the Canyon of Doom and the alligator-infested swamp of the Everglades. On her journey she meets a variety of characters who decide to be witness to this tragic event! Join Stage Door Enigma (Derek Award Best Young Cast 2023) as they return to Edinburgh for the fourth time with a delightful twisty tale of a traditional story.; Category: Children's Shows",
    "start": "Aug 12-16 "
  },
  {
    "title": "Around the World in 80 Puns",
    "presenter": "Iain MacDonald / Free Festival",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AROUNDT_BSC.jpg",
    "description": "Glaswegian comedian and author Iain MacDonald embraces the international aspect of comedy as he takes you on a pun-venture around the world in this hilarious show in which he has a joke for each and every country. You tell him the country – he'll tell you the joke! And with the aid of his giant map and mini-globes for the audience there'll be plenty of opportunities to try and catch him out! UK Pun Championship finalist (2017, 2018, 2020, 2022). Champi-pun-ship runner-up 2019. 'Scotland’s Prince of Pun' (BBC Radio Scotland).; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "2 Truths, 1 Lie",
    "presenter": "Simon Caine",
    "location": "Le Monde",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20242TRUTHS_CLJ.jpg",
    "description": "Funny, but is it true? Three headline comedians step on stage. Two are telling the truth, one is a big fat liar. Can you tell who...? The award-winning interactive comedy compilation sell-out show returns to a brand-new air-conditioned venue on the Grassmarket! The perfect show for fans of BBC's Would I Lie To You? Total sell-out 2023, so book early!; Category: Comedy",
    "start": "Aug 6-11 "
  },
  {
    "title": "Stand-Up Philosophy with Alex Farrow",
    "presenter": "Alex Farrow",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024STANDUQ_LH.jpg",
    "description": "Comedy with philosophical questions. Alex Farrow and special guests perform their favourite stand-up routines. The host then asks philosophical questions to explore the deeper thinking behind comedians' material with thought-provoking and hilarious results. 'An ingenious concept' (BingeFringe.com). Hosted each day by former philosophy teacher, Alex Farrow: 'An intelligent new star' (British Comedy Guide); 'Very Talented' (Chortle.co.uk); 'Perfect' ***** (Scotsman).; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "The Jewel of Africa CANCELLED",
    "presenter": "Ezimnyama Dance Ensemble (Zimbabwe)",
    "location": "C ARTS | C venues | C aurora",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024JEWELOF_CJT.jpg",
    "description": "A unique physical dance show produced to carry your imagination across the cultures of Zimbabwe and Africa through music and dance. Fast-paced African Warrior dances, traditional ceremonial dances, gumboot dance and African contemporary jives are closely accompanied by the sweet melodies of African voices. The Drum (Ingungu) plays a great role in delivering a heart-stopping display of well-choreographed dance moves while instruments like Amarimba (Xylophone), Hosho and Mbira bring everything together. Finally, African costumes brighten a production which proves that art from Zimbabwe is indeed a Jewel of Africa.; Category: Dance, Physical Theatre and Circus",
    "start": ""
  },
  {
    "title": "Your Therapist Is Clueless",
    "presenter": "Nathaniel Tresise",
    "location": "Outhouse Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024YOURTHE_CVQ.jpg",
    "description": "Drawing from experiences of working in mental health, prepare for a night of humour and heart in Your Therapist Is Clueless. Weaving together hilarious anecdotes, poignant stories, and unexpected moments of insight from the everyday absurdities to the profound connections formed with clients and colleagues, this show offers a unique perspective on the highs and lows of working in a mental health drop in service. Prepare to laugh, reflect, and maybe even shed a tear as we navigate through the world of mental health with wit, warmth, and an unwavering sense of humanity.; Category: Comedy",
    "start": "Aug 16-17 "
  },
  {
    "title": "Riding Alone",
    "presenter": "Shenzhen Puppet Art Theatre (China)",
    "location": "C ARTS | C venues | C aurora",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024RIDINGA_CJT.jpg",
    "description": "This one-man puppet drama follows a young performing artist with more than 20 years experience in Chinese puppetry, on his journey of self-discovery as he learns, practices and ultimately passes on his skills. His personal growth is explored through the telling of the classic heroic Chinese story: three sworn brothers in the Taoyuan, riding alone for thousands of miles. Already a favourite at international puppetry festivals, Shenzhen Puppet Art Theatre use a variety of different puppets, string, stick, cloth bag and shadow figures to elevate the everyday in their vivid, innovative and heartwarming shows.; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 4 "
  },
  {
    "title": "Rapunzel",
    "presenter": "Twisted Tales",
    "location": "theSpace @ Niddry St",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024RAPUNZE_3S.jpg",
    "description": "Twisted Tales bring you yet another brilliantly bonkers take on the fairytale Rapunzel... and her discovery that being a heroine is not all it’s cracked up to be! Set in a realm of magic and mystery, and conjured through a whirling world of physical invention, this captivating adaptation of the timeless story weaves together humour, heart, and the power of storytelling. Join us as we follow the spirited Rapunzel on her quest for freedom, tangled in her iconic tower but determined to create her own destiny…; Category: Theatre",
    "start": "Aug 6-9 "
  },
  {
    "title": "Adam B Magic: Welcome to My Reality",
    "presenter": "Adam B",
    "location": "Hot Toddy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ADAMBMA_COY.jpg",
    "description": "Every single one of us sees the world in a completely different way, and there are two groups of people who see it slightly differently from the rest of us: magicians and neurodivergents. Luckily, Adam B happens to be both. Come and see what the world looks like through the lens of magic and neurospice by joining him in his reality. After 26 years of performing magic, and a life time of living with ADHD, I'm sure you'll agree he is more than qualified to give you a tour.; Category: Cabaret and Variety",
    "start": "Aug 7-12, 14-19, 21-25 "
  },
  {
    "title": "Confessions of a Teletubby",
    "presenter": "Nikky Smedley",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CONFESS_TK.jpg",
    "description": "Arguments and poo! Sex and swearing! Blood, sweat, tears and giant rabbits! Life on the set of Teletubbies might not have been quite as you imagined… Nikky Smedley played LaaLaa (the yellow one) in the original series of Teletubbies for six years – that’s a lot of custard for a grown woman to get excited about. Come and hear how she got the job by dressing as a bistro table; what it was really like inside one of those (surprisingly large) Tubby suits; how the NooNoo really worked and why children loved the show so much.; Category: Spoken Word",
    "start": "Aug 6-10 "
  },
  {
    "title": "Spring Day: Exvangelical",
    "presenter": "Impatient Productions",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SPRINGD_PK.jpg",
    "description": "As seen on BBC's Live at the Apollo, American transplant Spring Day provides dark comedy for nice people. Spring joined a Christian cult at 13 years old and left 13 years later. She's never talked about it before because she didn't think you heathens would understand. Watch her recount why she joined, and how she escaped a growing fundamentalist Christian community that had become her whole world. Expect one hell of a coming-of-age story about finding faith as Spring explores the nature of cults and the role they play in our everyday lives.; Category: Comedy",
    "start": "Aug 6-12, 14-25 "
  },
  {
    "title": "No One Is Coming",
    "presenter": "Sinéad O’Brien / Wandering Stories",
    "location": "Scottish Storytelling Centre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024NOONEIS_T4.jpg",
    "description": "'A love letter to my mother that I’ll never send...' A storytelling performance about a mother and daughter, based on real-life events and encompassing elements of Irish folklore. Full of anecdotes, myths, funny stories and tough truths, it’s a rollercoaster experience inside a fun (if slightly traumatised) woman’s brain. This is not only about those with mental-health issues, it is about those that care for, love and grow up with them. 'O’Brien is stellar. This is storytelling as it should be' ***** (Herald). 'A masterpiece' ***** (EdFringeReview.com). 'Absolutely gripping' **** (ScotsGayArts.com). 'Mesmeric to watch' **** (CorrBlimey.uk).; Category: Theatre",
    "start": "Aug 7, 18 "
  },
  {
    "title": "Ali Affleck presents: 1933 – Wild Women of the Prohibition",
    "presenter": "Ali Affleck and The Gin Mill Genies",
    "location": "Argyle Cellar Bar",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALIAFFM_BLI.jpg",
    "description": "Bye bye Gatsby! Ali is celebrating 30 years of pioneering blues and hokum. Award-winning vocalist (and jazz historian) with an all-star band! Celebrate the brave and bawdy blues queens who reigned in the prohibition era – many sadly forgotten over time. The music was bold – the women even more so! 'Masterclass in grassroots jazz/blues' ***** (Edinburgh49.org). 'Not a household name yet – she soon will be' (BBC Jazzhouse). ‘Musical storyteller’ (Scotsman). 'Astounding vocals' ***** (San Diego Union-Tribune). ‘Vivacious’ (Herald). Six-time nominee for Best Vocalist (Scottish Jazz Awards).; Category: Music",
    "start": "Aug 15, 18, 22, 24 "
  },
  {
    "title": "Dr Waverly Weird's Last Night of the Fringe",
    "presenter": "Dr Waverly Weird / PBH’s Free Fringe",
    "location": "PBH's Free Fringe @ Voodoo Rooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DRWAVER_4Q.jpg",
    "description": "End your Fringe in style! Join Dr Waverly Weird for the Chaotic Final* Cabaret of the 2024 Fringe and a late-night party celebrating all that is Fringe-y. Expect a cabaret cavalcade of cheek, cheer and a whole heap of chaos to round out the month with some of the festival’s best and brightest! *I won't tell the other Cabarets if you don't!\n; Category: Cabaret and Variety",
    "start": "Aug 25 "
  },
  {
    "title": "Beryl & Clive, Sing or Die (Their Musical)",
    "presenter": "Amy Gibbons",
    "location": "theSpaceTriplex",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BERYLCL_AMQ.jpg",
    "description": "Beryl & Clive, a wildly funny comedy about a fabulously unconventional couple breaking all the rules to fulfil their creative dreams. Believing in yourself is at the heart of this story, with laughter, chaos and creative spirits unleashed. Amy Gibbons' writing takes you on a joyful journey into the absurd, where relationships and self expression take on a whole new meaning. With clown, song and dance this play promises an explosion of love and hilarity like never seen before. Sing or die! 'Not just funny, hilarious...' (James Pearson, Ronnie Scotts Jazz Club).; Category: Theatre",
    "start": "Aug 6-10, 12-17 "
  },
  {
    "title": "Elaine Robertson: Delulu",
    "presenter": "Elaine Robertson / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ELAINER_M4.jpg",
    "description": "Elaine is famous. Elaine is the worst person in the world. Elaine saw Bootsy Collins on a child's bike outside a Dominoes in Newcastle* *None of these things are true. Elaine Robertson is Delulu. As seen on BBC Three (BBC New Comedian of the Year Regional Finalist). County Durham-born Elaine Robertson has been described as 'laugh out loud' (Cherwell.org), a 'comedic talent' (EdFringeReview.com) and 'a truly special comic' (FeltNowt.co.uk). 'I've been doing comedy over 20 years and it's very rare that I see someone who was born to do it' (Matt Reed). Directed by Lee Kyle.; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Chicken",
    "presenter": "Sunday's Child",
    "location": "Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CHICKEO_BMT.jpg",
    "description": "A chicken's brain is the size of a walnut. But their hearts are as big as the universe. A play about love, fate, delicious white meat and adventure. There's a chicken in the Summerhall basement and she's dying to meet you. From the makers of Mustard (Scotsman Fringe First Winner 2019, Adelaide Critic's Circle Winner 2023).; Category: Theatre",
    "start": "Aug 6-8, 10-11 "
  },
  {
    "title": "Only the Ghosts Can Know",
    "presenter": "Bristol Theatre Program",
    "location": "Central Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ONLYTHE_BDZ.jpg",
    "description": "The water you drink has been drunk before. You have a molecule in your foot that belonged to some guy a million years ago. When you die in the flood it will remind you. A devised piece of theatre exploring a variety of characters unaware of how deep their connections are to one another. A workout instructor, an artist married to a witch, a girl trapped in an airplane bathroom, the ghosts of our ancestors... when the rains come and the flood waters rise, they all discover no one is separate from the sea.; Category: Theatre",
    "start": "Aug 6-7 "
  },
  {
    "title": "Clayton Smith: Guns For Jesus",
    "presenter": "Clayton Smith",
    "location": "Just the Tonic at The Caves",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CLAYTON_JG.jpg",
    "description": "American comedian, Clayton Smith, makes his Fringe debut with a solo stand-up show that is cerebral, raunchy, heartfelt and quintessentially American. He cracks jokes about growing up in a prison town, America's obsession with guns, his life in New York City and his experiences with love and heartbreak. This show asks the important questions: What is the secret to a long marriage? How do you become famous overnight? What kind of gun would Jesus have?; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Shanghai Yuguo Students’ Art Troupe: Elegance and Charm of Art",
    "presenter": "Asian Association of Culture, Commerce and Education in Europe",
    "location": "Venue150 at EICC",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ELEGANC_AAK.jpg",
    "description": "Shanghai Yuguo Students’ Art Troupe aims to develop youngsters’ artistic accomplishments. The students have attended several overseas exchange performances and received many awards. This time, they will present performances including Chinese traditional music and dance with unique rhythms of elegance and charm. The talented children will bring you an extraordinary concert as part of the Opening Ceremony of China/Britain Culture and Art Festival, organised by Asian Association of Culture, Commerce and Education in Europe.; Category: Music",
    "start": "Aug 4 "
  },
  {
    "title": "Alfie Moore: Fair Cop – Live!",
    "presenter": "Alfie Moore",
    "location": "Hill Street Theatre",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALFIEMO_BMB.jpg",
    "description": "Cop-turned-comedian Alfie returns with a brand-new show ahead of recording his BBC Radio 4 comedy It's a Fair Cop. The audience are sworn in as cops before Alfie shares a real-life scenario from his own casebook. He playfully challenges them to say what they would've done – with often unexpected and entertaining results. Policing decisions are easy in hindsight, aren't they?  Now you can experience the thrills, spills and laughter of making high-risk calls in the moment. Fair Cop: Live! is challenging, thought-provoking and fun. It'd be a crime to miss!; Category: Comedy",
    "start": "Aug 12-25 "
  },
  {
    "title": "TBC: A Stand-Up Experiment",
    "presenter": "Rob Alderson",
    "location": "Just the Tonic at The Mash House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TBCASTA_ACI.jpg",
    "description": "The customer is always right, right? So Rob Alderson wants the audience to write his show, two minutes at a time. A daring reinvention of comedy dynamics? Or a cowardly abdication of creative responsibility? We'll see...; Category: Comedy",
    "start": "Aug 6-11, 13-25 "
  },
  {
    "title": "Full Frontal Lobe",
    "presenter": "Lizzy Lenco / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Brewdog Doghouse Hotel",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024FULLFRO_CHQ.jpg",
    "description": "Lizzy Lenco is not right in the head, and has the MRI to prove it. Expect audience interaction, song and silliness as she brings surreal tales of near death, heavy metal and cake to the stage. This is an honest and hilarious show about coming to terms with disability. Full Frontal Lobe pokes fun at the way we react to people with disabilities whilst recognising that no one has a perfect body.\n; Category: Comedy",
    "start": "Aug 7-12, 14-19, 21-25 "
  },
  {
    "title": "Improv Karaoke with Absolute Onions",
    "presenter": "Absolute Onions / PBH's Free Fringe",
    "location": "PBH's Free Fringe @ Carbon",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IMPROVK_CVN.jpg",
    "description": "Absolute Onions take a karaoke classic chosen by the audience and perform an improvised narrative that will uncover the surprising real story behind that song! So pour the Prosecco, spin your disco balls and get ready to drop the mic! \n; Category: Comedy",
    "start": "Aug 18-22 "
  },
  {
    "title": "Bedsheets",
    "presenter": "Puddle Theatre Company",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BEDSHEE_CPV.jpg",
    "description": "Puddle Theatre Company presents a relatable one-woman play. Bedsheets delves into the life of Imogen, who has taken a complete detour in life after a breakup shatters her future plans. Returning all the way back to where it started – her childhood bedroom. Sifting through her room’s nostalgic artefacts, Imogen grapples with self-discovery, reflects on her past, and contemplates her future. Moving back home may be taking away her independence and freedom. Adulthood is not what it’s cracked up to be – she is certainly not thirty, flirty and thriving – but nothing beats coming home to fresh Bedsheets.; Category: Theatre",
    "start": "Aug 19-24 "
  },
  {
    "title": "Iain Dale: All Talk with Wes Streeting MP",
    "presenter": "Seabright Live",
    "location": "Pleasance at EICC",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IAINDAQ_BJN.jpg",
    "description": "Award-winning LBC radio presenter brings his acclaimed, incisive insight on current affairs back to the Fringe with these in-depth interviews featuring audience questions. Today's guest is Wes Streeting MP, Shadow Secretary of State for Health and Social Care. 'The indefatigable Iain Dale always cuts to the nub of politics' (Adam Boulton). 'There are very few commentators and broadcasters with an instinctive feel for real politics. Iain Dale does, which makes him endlessly listenable-to and peerless' (Andrew Marr). 'Makes me feel happier and cleverer every time I hear him' (Jeremy Vine).; Category: Spoken Word",
    "start": "Aug 5 "
  },
  {
    "title": "Tiger Daughter vs The World",
    "presenter": "He Huang",
    "location": "Laughing Horse @ The Counting House",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TIGERDA_Z2.jpg",
    "description": "From stumbling through language barriers in remote locations fulfilling humanitarian work with hilariously inadequate pre-acquired information, her adventures will have you laughing out loud. In a world where navigating international cuisine and handling unexpected racial differences are all part of the journey, the only guide you need to survive as an Asian woman in a white man's world is... Tiger Daughter. As featured on Australia's Got Talent, Thank God You're Here, Melbourne International Comedy Festival Gala and Just For Laughs, the breakout comedy star from China via Australia is debuting in the UK this year.; Category: Comedy",
    "start": "Aug 6-12 "
  },
  {
    "title": "Another Unwasted Evening – The Genius of Tom Lehrer",
    "presenter": "Antony (Dr H) Hubmayer",
    "location": "artSpace@StMarks",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ANOTHER_AAQ.jpg",
    "description": "Enjoy piano musical satire at its finest, celebrating the mischievous wit of Tom Lehrer. This sequel to 2023's Edinburgh and Adelaide Fringe smash hit includes all Tom's hits plus even more laughs, songs and games. Join the merry journey exploring the life and times of Tom Lehrer, retold through such timeless songs as Masochism Tango and Poisoning Pigeons in the Park. You’ll be laughing and singing your way through a great evening of cabaret entertainment thanks to the genius of Tom Lehrer and the performing excellence of Antony (Dr H) Hubmayer.; Category: Cabaret and Variety",
    "start": "Aug 10, 14, 16, 18, 24 "
  },
  {
    "title": "Ali Woods: At The Moment",
    "presenter": "Lee Martin for Gag Reflex",
    "location": "Underbelly, Bristo Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ALIWOOD_BLP.jpg",
    "description": "Ali's in love for the first time and he hates it. Join this viral comedy sensation for a hilarious stand-up hour about trying to be yourself. As seen on Comedy Central Live, ITV2's Stand Up Sketch Show and heard on BBC Radio 4. Tour support for Russell Kane, Adam Kay and Axel Blake. Sell-out Edinburgh Show 2023 and 2022. Hundreds of millions of views on Instagram and TikTok. ***** (Everything-Theatre.co.uk). ***** (LondonTheatre1.com). 'In a world of wannabes, Woods is the real deal' (Evening Standard). 'Expect to see big things from this rising star' (TheWeeReview.com).; Category: Comedy",
    "start": "Aug 7-8, 11, 13-15, 17-25 "
  },
  {
    "title": "The Bite – Mixed-Bill Stand-Up",
    "presenter": "Stags Woodward and Mixed Line-Up",
    "location": "Laughing Horse @ Bar 50",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024BITE_BSC.jpg",
    "description": "A fabulous mixed-bill of new and established acts in a daily changing line-up throughout the Fringe. A fantastic way to see a bite-sized chunk of the Fringe. You’ll be talking about this show for years to come. Acts from our previous shows have gone on to appear on Live at the Apollo, Russell Howard, Radio 4 etc. 'One of the best MCs I've ever seen'; 'The acts were brilliant, compere was fantastic. We laughed so much';'Loved this show! Great mix... a very warm, engaging and funny compere. Will definitely return: highly recommended!' (Audience reviews).; Category: Comedy",
    "start": "Aug 6-11, 13-18, 20-25 "
  },
  {
    "title": "Love, Loss and Cake",
    "presenter": "Damian Corcoran",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TALKING_U8.jpg",
    "description": "Inspired by the style of Alan Bennett's Talking Heads and that of traditional storytelling by a single narrator, this play weaves four humorous and moving narratives into one man’s story of love and loss, buses, taxis and cakes. We are brought gently into the life of John as he recovers from the loss of his wife and discovers the pleasures and challenges of travelling on Edinburgh buses, talking to a London taxi driver, babysitting, sampling Turkish pastries and experiencing the perils, fun and misunderstandings of online dating for the older man. Charming, funny and moving.; Category: Spoken Word",
    "start": "Aug 19-24 "
  },
  {
    "title": "Tatty Macleod: Fugue",
    "presenter": "Phil McIntyre Live Ltd",
    "location": "Monkey Barrel Comedy",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TATTYMA_BRQ.jpg",
    "description": "Time Out 10 Best Comedy Shows at the Fringe 2023. Hot off the back of a sold-out debut UK tour, Tatty Macleod is bringing her certain je ne sais quoi to the stage with her hilarious hour of comedy: Fugue. Building on her hugely popular English vs French online sketches, she asks the important questions like: Is he a f*ckboi or is he just French? Do I have a drinking problem or am I just English? This is a stand-up show about belonging, finding your tribe, or not, and how to be ok with that.; Category: Comedy",
    "start": ""
  },
  {
    "title": "Spontaneous Potter: The Unofficial Improvised Parody",
    "presenter": "The Spontaneous Players",
    "location": "Assembly Rooms",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SPONTAN_BSJ.jpg",
    "description": "Grab your wands and apparate yourselves to the box office! A very magical improv show awaits... Spontaneous Potter is an entirely improvised Harry Potter comedy play, based on an audience suggestion of a fanfiction title. An entirely new Potter adventure is magically improvised on the spot – with live musical accompaniment! Previous titles include: Harry Potter and the Neville Wears Prada, Harry Potter and the Rise of the Planet of the Snapes, Harry Potter and the Struggle for a Decent Mortgage in This Economy. (NB: 16+ age restriction!); Category: Comedy",
    "start": "Aug 12-25 "
  },
  {
    "title": "Katie Massie: Missionary",
    "presenter": "Katie Massie",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KATIEMA_CQB.jpg",
    "description": "Join Los Angeles comedian Katie Massie for her Fringe debut as she muses about religion, sex and modern womanhood. With an eager, impish grin, Katie delivers cheeky jokes and earnest contemplations on topics ranging from pelvic floor therapy to the Book of Genesis. If you like conversations in the women’s room at a bar, you will love this show. Fearless, frank and very funny. ; Category: Comedy",
    "start": "Aug 10, 12-17, 19-24 "
  },
  {
    "title": "In Conversation with… Denise Mina",
    "presenter": "Fair Pley / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024INCONVZ_SV.jpg",
    "description": "One of Scotland's most popular authors. Best known for her celebrated crime fiction, she has written 12 novels as well as 13 issues of DC's Hellblazer comic series. The Glasgow-born author has presented numerous television and radio shows. Her novel The Long Drop, based on the Peter Manuel case, won both the Gordon Burn Prize and the McIlvanney Prize. Denise is in conversation with playwright/poet Hannah Lavery, the official Makar of the City of Edinburgh.; Category: Spoken Word",
    "start": "Aug 10 "
  },
  {
    "title": "Mr Cardboard",
    "presenter": "Miles Calderon and Levi Meltzer",
    "location": "Hoots @ Potterrow",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MRCARDB_CRA.jpg",
    "description": "Welcome to the Land of Cardboard, where friendship lurks around every corrugated crease! On his loneliest birthday yet, rotten little Huxley is whisked away by the timeless Mr. Cardboard! This disturbingly delightful 'unhinged Pixar film' (satisfied viewer) folds the grotesque into the beautiful. It warms the heart and rips it along its perforated edge. Take his hand and Think Cardboard Thoughts! 'Surreal, sinister and side-splittingly funny. Mr. Cardboard is the perfect show.' (Luke Rollason, Disney+'s Extraordinary). 'Dark, funny, occasionally poignant, wilfully odd' (British Comedy Guide). An award-winning comedy by Miles Calderon and Levi Meltzer. Dir. Will Spence.; Category: Comedy",
    "start": "Aug 6-25 "
  },
  {
    "title": "Mamas' Boy – Lesbian Son Comedy Hour",
    "presenter": "Pat Moore / Free Festival",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MAMASBO_BJQ.jpg",
    "description": "Patrick Moore is a total Mamas’ Boy. His parents are lesbians, so it was his only choice. Come see why. Patrick Moore was born and raised in the San Francisco Bay Area, and grew up on a diet of love, attention and tofu. From getting crystals as a Christmas present to being certified as an energy healer at the age of six, his childhood was never the typical all-American experience. Having two moms was just the start. Mamas' Boy is full of stories and jokes about Patrick’s experience growing up with gay parents. ; Category: Comedy",
    "start": "Aug 18-25 "
  },
  {
    "title": "EIFF: All the Mountains Give",
    "presenter": "Arash Rakhsha",
    "location": "EIFF @ The Cameo",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EIFFALL_CUR.jpg",
    "description": "A powerful account of the Kolbari covert goods traden between the Kurdish cities and towns of Iran and borders of Iraq. The film follows Hamid and Yasser over six years as they contend with the life threatening conditions they and their families have to face to survive. A rare insight into the plight of the Kurdish people, this is an elegant portrait of a marginalised people, where the palpable sense of risk and danger is contrasted with the gentle rhythms of family life under harsh conditions. Cert: 15.; Category: Events",
    "start": "Aug 17 "
  },
  {
    "title": "Ladies Who Ranch",
    "presenter": "Georgia House Productions",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024LADIESW_PF.jpg",
    "description": "We heard your pleas. We read your fan mail. Brooklyn's finest improv supergroup Ladies Who Ranch (Kelly Cooper, Caitlin Dullea, Maya Sharma, Caroline Yost and Sophie Zucker) present an hour of comedy that will blow your mind and open your heart. This is not your mother's improvisational comedy – it is character-forward, raunchy and structurally exciting, but mostly it's about uplifting women's voices, in particular their own. Deemed 'local faves' by the New York Times and 'very funny lunatics' by TimeOutNY. As seen on The Daily Show, Adult Swim, Apple TV+, Comedy Central and The Tonight Show.; Category: Comedy",
    "start": "Aug 6-12 "
  },
  {
    "title": "Art",
    "presenter": "Clarendon Productions",
    "location": "C ARTS | C venues | C aquila",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ARU_JM.jpg",
    "description": "Serge has bought a painting. Five foot by four. White. And if you look closely you can see some thin white diagonal lines. Serge thinks it's brilliant. Marc disagrees. Yvan isn’t sure. French author Yasmina Reza's enduring psychological deep-dive is given a concise new rendering in a minimalist setting, shining a spotlight onto the fickle foundations of friendship, marriage, and self-perception, and what it takes to be truly representative of the current time. From Oxford University's Clarendon Productions: ‘Impeccable and immersive’ (Cherwell.org). ‘Excellent… amazing… shining’ (WildRoseAndPearls.com).; Category: Theatre",
    "start": "Aug 19-25 "
  },
  {
    "title": "Amazing Soundtracks for String Quartet: From Morricone to Harry Potter",
    "presenter": "The Random String Quartet",
    "location": "artSpace@StMarks",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024AMAZINH_AAQ.jpg",
    "description": "Indulge in the enchanting melodies of this Italian string quartet at the Edinburgh Festival Fringe. Immerse yourself in a symphony of cinematic favorites as the musicians weave through iconic soundtracks, from Morricone to Harry Potter, bringing each note to life. Join us for a musical journey that transcends time and genre, infused with great passion and love for music. Don't miss this extraordinary concert experience where the magic of live performance meets the allure of beloved film scores. Secure your tickets now for an unforgettable evening of harmonious brilliance!; Category: Music",
    "start": "Aug 23-24 "
  },
  {
    "title": "EIFF: All the Mountains Give",
    "presenter": "Arash Rakhsha",
    "location": "EIFF @ Summerhall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024EIFFALL_CUP.jpg",
    "description": "A powerful account of the Kolbari covert goods traden between the Kurdish cities and towns of Iran and borders of Iraq. The film follows Hamid and Yasser over six years as they contend with the life threatening conditions they and their families have to face to survive. A rare insight into the plight of the Kurdish people, this is an elegant portrait of a marginalised people, where the palpable sense of risk and danger is contrasted with the gentle rhythms of family life under harsh conditions. Cert: 15.; Category: Events",
    "start": "Aug 17 "
  },
  {
    "title": "Carl Donnelly: Boosegumps",
    "presenter": "Strip Light Productions and Ebdon Management",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CARLDON_P8.jpg",
    "description": "Carl used to spend the Fringe in a haze of booze, narcotics and award nominations. He's now a married, middle-aged father with recurring stomach ulcers, a bald patch and recently purchased some anti-leakage boxer shorts. Oh god. Nominated for both the Best Newcomer and Best Show in the Edinburgh Comedy Awards, he's appeared on Mock the Week, Russell Howard's Good News, and was Kevin Bridges tour support. 'Observational genius' (Guardian). **** (Herald Sun). **** (Scotsman). ***** (Skinny). ***** (BroadwayBaby.com). **** (Chortle.co.uk).; Category: Comedy",
    "start": "Aug 6-13, 15-25 "
  },
  {
    "title": "Improv and Chill",
    "presenter": "Flying Chairs",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024IMPROVD_BSI.jpg",
    "description": "Welcome to Improv and Chill, the TV show where you decide what happens. Pick the genre, characters and the action, then we'll do the rest! This show is fully improvised and relies on the audience's participation to decide what happens via a cheer-off. We'll also stop the show at two points so you can dictate how the show pans out. After our show's success in Bristol, we knew we had to take it up to the Fringe!; Category: Comedy",
    "start": "Aug 6-10 "
  },
  {
    "title": "Witch? Women on Trial",
    "presenter": "Edinburgh Storytellers",
    "location": "Greenside @ Riddles Court",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WITCHWO_CEL.jpg",
    "description": "The true story of the witches. Humour and horror are woven together with empathy in a shocking insight into the untold stories of ordinary women caught up in a whirlwind of politics, religion and magic. Be prepared to laugh and cry. 85% of witches were women. Why? Audience reviews: 'Powerful'; 'Consummate storytelling'; 'Heartfelt'; 'Well researched'; 'Not to be missed'; 'Captivating'.; Category: Spoken Word",
    "start": "Aug 6-10, 12-17, 19-24 "
  },
  {
    "title": "Chokeslam",
    "presenter": "WWWC",
    "location": "Assembly George Square",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024CHOKESL_CJN.jpg",
    "description": "A knockout solo show about one woman's love of pro wrestling. Part confessional, part exuberant oral history of sports entertainment's greatest matches and most loved characters. Acclaimed comedian Tegan Verheul leaves no Stone (Cold) unturned in her unflinchingly raw autobiographical debut that grapples with heartbreak, friendship and the healing power of bloodsport. Riotously funny, unexpectedly touching, brilliantly human. You will leave a wrestling fan.; Category: Theatre",
    "start": "Aug 6-10, 12-25 "
  },
  {
    "title": "Tez Ilyas: Before Eight",
    "presenter": "Tez Ilyas",
    "location": "Monkey Barrel Comedy (The Hive)",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024TEZILYA_CFC.jpg",
    "description": "One of the most celebrated stars in British comedy, Tez Ilyas (Live At the Apollo, Mock The Week, Comedy Central, Comic Relief) and Sunday Times best-selling author (Secret Diary of a British Muslim Aged 13 3/4) is back with his hilarious new show. A lot has changed in the last two years for Tez. He got married, he bought a house and he’s became a stepdad... to two rabbits. Trying to make sense of his new life, the changing world around us and wrestling the big questions, like: why is Lotus Biscoff in everything now?; Category: Comedy",
    "start": "Aug 13-25 "
  },
  {
    "title": "1 Murder: The Mind-Reading Lawyer",
    "presenter": "Tomas McCabe",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/20241MURDER_BSH.jpg",
    "description": "Fringe veteran mind reader, Tomas McCabe, is back with a show that combines his trademark mentalism with a courtroom drama. Having been the go-to Fringe performer for mind reading for four years running, Tomas has now taken his skills to the next level by training as a barrister. Expect a family-friendly show of incredible mentalism mixed with the drama of court. Are you brave enough to sit as the judge or jury, or will you be the one on trial?; Category: Cabaret and Variety",
    "start": "Aug 19-24 "
  },
  {
    "title": "King Bantu and Stories from the South",
    "presenter": "Rudy Mbunzama and Laura Mathana and Chinyanta Kabaso",
    "location": "Assembly @ Dance Base",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024KINGBAN_CKN.jpg",
    "description": "Two unique works by Scotland-based performers exploring African history, culture and artistry. The legend of King Bantu by Rudy Mbunzama follows a young Congolese prince born with extraordinary powers. As he grows up he starts to experience something powerful within him – something beyond him that wants to come out. Stories from the South by Laura Mathana and Chinyanta Kabaso weaves dance and spoken word to illuminate the history of African migration, amplifying the stories, struggles and triumphs.; Category: Dance, Physical Theatre and Circus",
    "start": "Aug 4 "
  },
  {
    "title": "Thor Stenhaug: It's So Hard to Speak Without Saying Something Stupid",
    "presenter": "Thor Stenhaug / Free Festival",
    "location": "Laughing Horse @ City Cafe",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024THORSTE_BKH.jpg",
    "description": "Thor Stenhaug is a Norwegian comedian based in the UK. In a short period of time, he has finished multiple sold-out runs at the Edinburgh Fringe, built an online following and been shortlisted for British Comedy of the Year – despite not being British (wonder what happened there). Scottish Field said 'catch him before comedy panel shows beckon', whilst NorthWestEnd.com called him 'the gem of the Free Fringe'. **** (BroadwayBaby.com). **** (EdFringeReview.com).; Category: Comedy",
    "start": "Aug 6-12, 14-19, 21-25 "
  },
  {
    "title": "Alison Spittle: New Stuff WIP",
    "presenter": "Alison Spittle",
    "location": "Monkey Barrel Comedy (The Tron)",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024WIPSIVE_CKG.jpg",
    "description": "At the time of blurb, this is going to be about inbuilt misogyny and trying to quantify how f***able she is compared to the green M&M. As heard on Off Menu, Guilty Feminist, Gargle and Wheel of Misfortune. Shouted out Johnny Cock on Richard Osman's House of Games and said three lines on EastEnders. Come see the show before she remembers to anonymise people and places. Maria Bamford, Rob Delaney and Fern Brady tour support. 'There are very few comics doing what Spittle does today, and even fewer doing it well.' ***** (Irish Times).; Category: Comedy",
    "start": "Aug 21 "
  },
  {
    "title": "Oral Tradition",
    "presenter": "Lara McClure",
    "location": "Greenside @ George Street",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ORALTRA_CPX.jpg",
    "description": "Ancient Ulsterwomen used sex as a weapon, and they made plenty of noise about it! Snarly-yet-lyrical modern Ulsterwoman Dr. Lara McClure rants up a trio of foul-mouthed ancestresses – Ness (Cuchulain’s Nana), who assaulted a druid to further her dynastic ambition; cattle-rustling Queen Medb, whose conjugal relations with warrior husband Aillil took the form of combat; and sorrowful Deirdre, whose closely-guarded virginity drove the nation to mass slaughter. Darkly hilarious storytelling with gnarly traditional roots. Listeners are advised to think long and hard before accepting the friendship of the Queen’s thighs. 'Too bloody right!' (Medb). 'All lies' (Ness).; Category: Spoken Word",
    "start": "Aug 6-10, 12-17, 19-24 "
  },
  {
    "title": "Migrant Shakespeare",
    "presenter": "Seyyar Company (Türkiye/UK)",
    "location": "C ARTS | C venues | C aurora",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024MIGRANT_CJT.jpg",
    "description": "Think you know your Shakespeare? Think again! This is Shakespeare as you’ve never seen him before – ‘trippingly on the tongue’… Migrant actors take on the Bard, reinterpreting his words in alien environments you will never have imagined before. They give his iconic characters a new life, migrating them into the roles assigned to outsiders by society. Hamlet is a meat-packer, King Lear a construction worker, Caliban a hotel cleaner, Lady Macbeth a housewife looking after children, and Shylock washes the dishes in a restaurant. This is no one Bard: Shakespeare belongs both to no-one and to everyone.; Category: Theatre",
    "start": "Aug 6-11 "
  },
  {
    "title": "Roger McGough: Alive and Gigging",
    "presenter": "Roger McGough / The Stand Comedy Club",
    "location": "The Stand Comedy Club 3 & 4",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024ROGERMC_SV.jpg",
    "description": "Touring his Alive and Gigging show, covering the Mersey-soaked sound of his quintessential 60s start, through to tender meditations on fatherhood and family, and on to political sendups, pandemic playfulness and brilliant new writing. A performance poet like no other, he is bringing his best pieces to the stage for new and old audiences alike. Aged 87, he is a force of nature – and poetry. Is poetry the new rock’n’roll? …It always was! ‘The patron saint of poetry’ (Carol Ann Duffy). 'McGough has done for poetry what champagne does for weddings’ (Time Out).; Category: Spoken Word",
    "start": "Aug 13 "
  },
  {
    "title": "Shotgunned",
    "presenter": "Kangaroo Court",
    "location": "theSpace @ Surgeons' Hall",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024SHOTGUN_BSI.jpg",
    "description": "Shotgunned is Kangaroo Court’s debut theatrical production. Written and directed by Matt Anderson, it tells the story of Dylan and Roz, a couple in their early twenties who unexpectedly fall out of love. Described as equal parts hilarious and heartbreaking, Shotgunned is a new, intimate piece of theatre centred around the people we lose that shape who we become. It is a deeply relatable tale of joy, loss, and reconciliation, and has been met with great acclaim throughout the UK in 2024.; Category: Theatre",
    "start": "Aug 6-10, 12-24 "
  },
  {
    "title": "How a Jellyfish Saved the World",
    "presenter": "Jam Jar Theatre Company CIC",
    "location": "Pleasance Courtyard",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024HOWAJEL_FZ.jpg",
    "description": "When we were young, sticks were swords, chocolate was currency and we all had the power to change the world. Clyde the jellyfish is on a quest to find a forever friend, in a home being polluted by the world above. When he mistakes a plastic bag named Bubbles for a total jellybabe, will they discover that a life in plastic is not so fantastic? Jam Jar Theatre Company presents a tentacle-tapping puppetry musical, for children and adults, friends and anemones, for our world and the generation inheriting its issues. You'll be ten-tickled pink!; Category: Children's Shows",
    "start": "Aug 6-18 "
  },
  {
    "title": "Dinner",
    "presenter": "Exeter University Theatre Company",
    "location": "theSpace on the Mile",
    "image_url": "https://tickets.edfringe.com/www-data/uploads/event/2024DINNER_U8.jpg",
    "description": "You are invited to Dinner! Hostess extraordinaire Paige is throwing a dinner party to celebrate her husband's philosophical bestseller being published. A microbiologist, a newsreader and a bohemian artist are on their way to dinner along with a surprise guest! Shocking revelations and Paige's endless games leave a trail of emotional carnage. Algae soup is the first item on the menu followed by Frozen Waste to cleanse the palate. Let the dinner party from hell begin!; Category: Theatre",
    "start": "Aug 12-17, 19-24 "
  }
]